{
  "clean_goodbye_start": [
    "later",
    "bye",
    "goodbye",
    "so long",
    "see you later"
  ],
  "clean_hello_start": [
    "hello",
    "good day",
    "hi",
    "suh",
    "hello friend"
  ],
  "get_balance_start": [
    "Check the Balance Online",
    "How much money is left in account Y?",
    "Check my bank balance",
    "Can you tell me my balance?",
    "What's the amount of money I have?",
    "what is the balance",
    "how much in my account",
    "Do I have more than $100.00 in my account?",
    "Please give me the balances of my accounts.",
    "Does my savings account or checking account have a bigger balance?",
    "What's the balance of my account at Wells Fargo?",
    "yo how much is in chase",
    "how much is in there",
    "give me info on my balances",
    "How much is in my checking account?",
    "so what do I have",
    "I would like a full account statement total.",
    "how to retrieve the balance of your my accounts?",
    "balance please",
    "show me the account balance",
    "Please state the balance of joint checking.",
    "how much cash do i have",
    "What's the amount saying in my \"Work\" checking account?",
    "How is my balance looking for my account 123456789",
    "Tell me my balance",
    "Tell me my checking account balance.",
    "How much is there?",
    "Let me get my balances",
    "can you give me whats left on my account",
    "Please tell my the balances of my accounts.",
    "hi need your help on wanting my balance for account 9994444555 also",
    "What's the total balance I have?",
    "Can you tell me how much money is in my account?",
    "want to know balance info plase.",
    "I need the balance for my account.",
    "hello, interested in and looking for my balances.",
    "how much cash do i have in savings",
    "have issue tell me more on wanting know my current balances on my accounts for this",
    "How much is the balance for my account?",
    "What money do I have in my account?",
    "right now looking for my balances is happening?",
    "how much do i have left in my accounts",
    "How much is in my bank account?",
    " how much money did i have at the start of the year",
    "I need to check the amount of my account balance.",
    "Can I have my balances?",
    "What is the current balance on my account?",
    "What is my current bank balance?",
    "what i got in my account rn?",
    "How much is in my emergency savings account?",
    "I would like to know my balance.",
    "Is my balance more than $100?",
    "how much do I left in my accounts as of right now",
    "how much money is my balance worth",
    "what's my balance in my account",
    "Please tell me my checking account balance?",
    "How much amount in my savings account.",
    "what is my balance left in my account",
    "Tell me the balance on that bank account",
    "what is my checking account balance as of august this month",
    "What is the bottom line?",
    "how about currently wanting know my current balances on my accounts if possible",
    "account balance is",
    "I'm unsure if I have enough to buy a new laptop, can you tell me what the account balance is?",
    "How much money is in my checking account?",
    "need to know balance",
    "What’s my current account balance?",
    "Check my total balance",
    "please tell me how much is in my account please",
    "i dropped a bunch of money on clothes last month could you tell me wha my current balance is?",
    "College fund balance please.",
    "i spent soo much cash, could you tell me whats left in my account?",
    "account balance please",
    "What's my balance",
    "what's the balance?",
    "What's the total in my savings?",
    "i paid for a bunch of stuff can you tell me what my balance is",
    "Check how much is in my checking account at Chase.",
    "Does it look like I have the funds in my account?",
    "Get the balance of my Chase savings account.",
    "i want my account balance",
    "How much is in my Chackking account?",
    "I am planning a trip and would like to know account balance",
    "tell me how much cash i got left",
    "what balance is left on my savings?",
    "I would like some information on my accounts balance.",
    "Tell me what’s in my balance.",
    "Could I be told my accounts balance.",
    "i want to see my balance",
    "Please check my savings account..",
    "What is my savings balance?",
    "show the account balance",
    "Do I have enough in my rent account to cover rent this month?",
    "What in the amount in both of my accounts",
    "I want to see how much the account balance is",
    "hello, as far as wanting know my current balances on my accounts is concerned, is there more information",
    "wanting know my current balances on my accounts involves what",
    "How much do I currently have in my account?",
    "How much do i have left on my account?",
    "What is my current account balance?",
    "tell me what the balance is",
    "How can I check my bank balance online?",
    "please give me my balance info",
    "Please inform me what my current account balance is.",
    "Tell me my balance, please.",
    "What is my account balance",
    "hi there, need your help on looking for my balances",
    "Need my balance",
    "have issue currently wanting know my current balances on my accounts please",
    "I haven't checked on my savings account in a while, how much do I have?",
    "writing because looking for my balances is concerned, is there more information",
    "Whats my balance for my Wells Fargo Platinum Savings account",
    "tell me balance please",
    "Am I able to go out? What is my balance for my checking account?",
    "How much money do i have on my saving account?",
    " i would like to know how many dollars are in my account",
    "I do need my balances",
    "How much is in Caroline's checking?",
    "What’s my balance?",
    "How do I check my Visa card balance?",
    "I should buy groceries soon, how does my grocery funds account look?",
    "What's the balance of my emergency fund account?",
    "What's the balance on my bank account?",
    "how to much dough in checkings?",
    "What is my balance on my authorized users MasterCard account?",
    "Give me the total?",
    "Balances, please.",
    "List all account balances, please.",
    "What's my joint checking balance?",
    "What's my balances?",
    "what is my gas account look like?",
    "Can you give me my checking balance?",
    "I needed the total amount in my account.",
    "How do I check my green dot balance?",
    "Is there any balance left in my car payment account?",
    "hi there, let me know more about wanting know my current balances on my accounts too",
    "how much i have?",
    "thinking of wanting know my current balances on my accounts is what I am currently looking for",
    "I would like to see my balance",
    "Can you tell me the total in my account?",
    "What is my balance on my checking ?",
    "tell me account balances please",
    "Show me the balance on my Citibank account",
    "What is my total amount of cash",
    "What's the total amount in my account?",
    "What's my total balance",
    "I need my account balances?",
    "Give me an idea of my balance",
    "tell me my account balances please",
    "How much is in my account?",
    "I wanna get my balances",
    "I need a balance on my account?",
    "savings balance pls",
    "show me my account balance",
    "tell me my balance please",
    "Give me my savings balance.",
    "How is the vacation savings doing?",
    "i want to know how much money is in my account",
    "What’s my card balance",
    "I need my balances.",
    "What’s my checking account balance?",
    "Provide my balance to account X.",
    "What is my latest balance?",
    "Show me how much money I have",
    "What is my the amount of money in my account",
    "How do I check the balance on my prepaid Mastercard?",
    "Find my balance",
    "I do want my balances",
    "what is the balance in my account?",
    "What is available in my account?",
    "I'd like to know what my balance is",
    "Whats the total of my ledger.",
    "Can you avail the remaining account balance before I set out?",
    "What are my balances?",
    "what balance is in my acount ?",
    "tell me the balance",
    "what is my balance left if u can tell me",
    "right now wanting know my current balances on my accounts is happening",
    "What’s in my Chase savings account?",
    "Can you check my cash flow?",
    "What is the amount of money in my checking",
    "The balance for my account please.",
    "i want to know my account balance",
    "I was hoping to get my account balance",
    "all balances please",
    "Can you please tell me the balance of my account?",
    "I want to see how much my balance is",
    "How much is in accounts?",
    "Give my the balance for my US Bank Gold Checking",
    "What is my total balance?",
    "let me get my balances",
    "How much money do I have in my Chase checking account?",
    "can you give me my balances",
    "wanting know my current balances on my accounts, want to learn more also",
    "do I have the balance",
    "What about the remaining in my savings account?",
    "Show me my balances",
    "What is the total balance of my account?",
    "Tell me what’s in my Bank of America account?",
    "I was on now wanting know my current balances on my accounts thank you",
    "What's the balance in my primary checking?",
    "How much do I have",
    "What is my balance in my savings account?",
    "What is my remaining balance",
    "Tell me what’s in my Bank of America account",
    "I would like to know the balance of my account.",
    "how much is in my account",
    "What's my checking account balance?",
    "need help with wanting know my current balances on my accounts.",
    "hi there, can you help with wanting my balance for account 9994444555",
    "How much do I have in account X?",
    "browsing for an answer looking for my balances",
    "can I receive my balances?",
    "I need to know my balance now",
    "Show balance information",
    "How much do I have in my Wells Fargo \"At Work\" checking account?",
    "What is the balance in my account ending in *******7890?",
    "What is my checking balance?",
    "hi there, interested in and wanting know my current balances on my accounts please",
    "need help, help with looking for my balances for this",
    "need to know about my balance",
    "what is my balance worth",
    "What is my credit card balance?",
    "Check the balance of my Chase House fund.",
    "how much do i have in my CD saving account?",
    "what's in my account",
    "What amount am I at in my account?",
    "Where does it show my balance",
    "hi there, help with looking for my balances also",
    "What is the amount is David's checking",
    "I want to have my balances",
    "have question, would like to know more on how to do the looking for my balances for this",
    "What is my balance in my checking account?",
    "I'd like a check of balances.",
    "What is my total balance on my checking account?",
    "How much do I have in my bank account?",
    "Can you get my account balance for me?",
    "whats in my account right now",
    "wanting know my current balances on my accounts concerns what else?",
    "show balance?",
    "Check the balance on the account number 1234567890",
    "give me info on how much money i have",
    "thinking of how is the wanting know my current balances on my accounts done now",
    "Show me all my balances",
    "Could you tell me my balance.",
    "I want my balances",
    "read me my balance",
    "how much dough in checkings account ?",
    "Tell me the total in my account.",
    "show me the account's balance",
    "How much money do I have?",
    "checking balance please.",
    "Please tell me my balance",
    "need account balance info now",
    "How much do I have to spend?",
    "How much do I have in the bank",
    "Report my account balance.",
    "What's the balance of my accounts?",
    "I was hoping to get my balance.",
    "What are my account balances",
    "what is the amount available in my account",
    "yeah I need to know my balances now",
    "I need to get my balances",
    "I'd like my balances",
    "how about explain how the wanting know my current balances on my accounts is done please",
    "Tell me the total in my savings account?",
    "What's the amount in my account?",
    "I wanna have my balances",
    "what's my account balance",
    "I feel I need my balances",
    "need help, interested in and wanting my balance for account 9994444555",
    "give me the balance amount",
    "How's my balance",
    "help me get my balances",
    "Give me the balance of account 123456789",
    "I’m going shopping so I want to know my account balance.",
    "Give me the balance of Matt’s checking account",
    "What is the available balance in my Bank of America Advantage Plus checking account?",
    "How much money do I have right now?",
    "How much is there in my account?",
    "What is the account balance?",
    "Can I have my balance?",
    "Before I make this purchase, could you tell me how much cash is left in my account?",
    "I must have my balances",
    "Get balance info",
    "I've got to know how much money I have.",
    "What's in my checking account?",
    "could you just tell me what my current balance is",
    "What is the balance in account Y in Sweden?",
    "Where can I find my account balance",
    "would like to know more on how to do the wanting know my current balances on my accounts please",
    "Do I have more money in checking or savings?",
    "How much savings have I accued?",
    "How much money have I got?",
    "Give me the balance in my savings please.",
    "how much do i have savings",
    "how much balance does i have",
    "Hey, let me know my balances",
    "Please tell me the last month transaction",
    "What is the total balance including pending charges on my Visa?",
    "Can you give me my account balances?",
    "About how much do I have in my Bank of America Advantage Plus checking account?",
    "How much of money have in my savings account?",
    "What is the amount of money in my savings",
    "hi there, as far as looking for my balances is concerned, is there more information now",
    "Can you tell me the available balance please?",
    "what's my balance",
    "I am worried about a bill I have to pay, so I need to know what my balance is.",
    "display balance",
    "I gotta get my balances",
    "Can you give me my balance?",
    "how much do i got in my checking account",
    "How much money is left in my checking account.",
    "how much money is my balance",
    "What's the balance in my account.?",
    "How much do I have saved?",
    "How much money do I have in my savings account?",
    "I feel I want my balances",
    "hello, more info on wanting know my current balances on my accounts etc for this",
    "Take me to my account balance",
    "How much is in my account now",
    "How much money is in my account 5463597?",
    "show balance for the credit card account",
    "can I have my balances?",
    "I need to know how much there is in my account.",
    "Whats the current balance for my account.",
    "account balance",
    "What ths Balance in my account?",
    "need help, the concept of looking for my balances is something I want more info on please",
    "ok balance please",
    "hello, wanting my balance for account 9994444555, want to learn more also",
    "My accounts balance.",
    "how much do I left in my accounts thank u",
    "I really must buy groceries soon, how does my grocery funds account look?",
    "How much is in the bank",
    "tell me my balance now",
    "Can you let me know what the current balance I have is?",
    "I must get my balances",
    "what do I have",
    "What is my balance for account 5463597?",
    "What can I spend tonight? Balances, please.",
    "i just need to know whats in my credit card",
    "How much is there in my bank account?",
    "What's my balance?",
    "How much do I have total in my account.",
    "I want to know the total balance for my account.",
    "i want to look up my balance",
    "How much money is there in my bank account?",
    "What's my balance in Jan account?",
    "What does my Chase account look like right now?",
    "I am in need of my balances",
    "What did I put into checking last month?",
    "Can I have my balance for my accounts?",
    "What is the amount of money in my peronsal checking account",
    "show me my balance",
    "Tell me my balance in account X.",
    "I wanna see my balance",
    "I was on now looking for my balances if possible",
    "please tell me my balance as of now",
    "savings balance pls?",
    "Current balance of my Bank of America Plus checking account?",
    "How much moolah do I have in my savings account?",
    "How much is in my savings account?",
    "What is the balance of my Compass Checking account?",
    "How much did I put into our joint savings account?",
    "Please get account balances.",
    "Please tell me the amount in Chris's Christmas account?",
    "How much money do I have in my account?",
    "post my balance",
    "What is my balance as of today?",
    "I desire my balances",
    "hello, right now wanting my balance for account 9994444555 is happening",
    "have issue looking for my balances is what is going on",
    "What are current account balances?",
    "can you inform me more on looking for my balances",
    "What is the posted amount in the bank?",
    "Do I have more than $1000.00 in my account?",
    "thinking of looking for my balances, want to learn more.",
    "How much do I have in my accounts?",
    "I need to know my balance please.",
    "How much do I have in my savings account?",
    "I would like my balances",
    "I really want my balances",
    "questioning and wanting know my current balances on my accounts currently.",
    "need help, looking for my balances is what is going on",
    "How much joint funds do me and my wife have?",
    "how much dough in checkings?",
    "How much funds are in my Wells Fargo Account?",
    "what's left in the account",
    "What is my current balance at Chase?",
    "how much is in my balance",
    "What is my current balance on my credit card?",
    "What is total amount in my account",
    "What’s my account balance",
    "give me my account balance info",
    "How much is my balance",
    "if you can, I was on now looking for my balances",
    "How much is in Tim’s Chase account?",
    "please tell me the saving account details",
    "can I get my balances?",
    "give me the account's balance",
    "Give me my balance",
    "Show me my money balance",
    "Give me the balance of Matt’s checking account balance",
    "get info on balances",
    "I'd like to see my balance",
    "umm tell me what's in my savings account",
    "What is my balance",
    "more information on looking for my balances",
    "What's in my accounts",
    "How much money is in my account?",
    "Get me my balances",
    "what is my balance left",
    "What have I paid into the retirement account?",
    "I want to go out tonight can i have my balance",
    "Shoe me my balance?",
    "please tell me what my balance is.",
    "Check my bank balances",
    "checking balance",
    "How do I find out what my balance is?",
    "What is my account balance?",
    "hello. interested in and wanting know my current balances on my accounts ok",
    "I need my balances",
    "I need my balance",
    "can I have the balance",
    "need help, wanting know my current balances on my accounts is about what please"
  ],
  "get_balance_update": [
    "What about my school balance?",
    "Can you show all balances?",
    "show me my checking account balance as of today",
    "Would you let me know how much I have in checking?",
    "show me my checking account balance?",
    "Please show me my balance on my checking account?",
    "what about my checking",
    "What about the principal on my mortgage",
    "um could you also tell me about the mutual fund?",
    "What's the balance in my checking?",
    "List all balances",
    "What about my personal savings?",
    "just give me all?",
    "show me my saving account balance",
    "actually can i see whats in my college fund?",
    "Can you also let me know the balance of my checking account?",
    "Is there a balance on my credit card?",
    "how about debit card",
    "just tell me whats going the in that accounts",
    "ust tell me whats in all accounts",
    "how about credit card",
    "Show me the balance for the other account.",
    "tell me about my kids college",
    "aw man um do i have anything in checkings?",
    "How is my retirement account doing?",
    "How about my mortgage",
    "what about my CD account balance thx",
    "Can I look at my retirement account?",
    "Great, also, what's the balance in my CD?",
    "just tell me whats in all accounts?",
    "What is my current balance?",
    "I'd like to see my other account next.",
    "what about my Savings",
    "how to check my balance ?",
    "Can you now tell me my checking balance?",
    "What about my other account",
    "could you also tell me about checkings the balance",
    "info on mortgage",
    "now show me all of my balances",
    "How about my IRA",
    "Need total that is in my retirement account",
    "give me the balance in the checking account",
    "Checking account balance",
    "Actually, I meant my checking account",
    "Can you give me my checking account balance?",
    "mortgage info",
    "What about my mortgage balance?",
    "what is the detail about my retirement",
    "Ok, may I now know the balance of my checking?",
    "What about my rainy day balance?",
    "also the emergency balance",
    "Please tell me my 520 balance.",
    "what about checkings",
    "Can you tell me what I have in my other account?",
    "Give me the checking balance",
    "now show me all of my balances?",
    "just tell me whats in all accounts",
    "what is my balance?",
    "Now I'd like to see the other account.",
    "What's the balance of my secondary savings account?",
    "And my checking balance?",
    "how about the money market",
    "Tell me about checkings",
    "Please tell me about checkings",
    "Is there any activity on the other account?",
    "Show me the other balances",
    "what about my checking balance please",
    "Can you tell me the balance in all accounts",
    "want the info on mortgage",
    "What about my personal savings and account?",
    "Show me the balances of other accounts",
    "Now I want to know how much is in my other account",
    "could you please show me the balance of another account",
    "what about my checking account balance if u could",
    "Gimme all other balances",
    "Show me both balances?",
    "Okay, now tell me my other account's balance.",
    "now just show me savings",
    "show me my checking account balance please",
    "now i need my retirement account",
    "what about retirement",
    "what about my CD account balance thanks",
    "can I have the info on checking account",
    "please tell me about my kids college",
    "what other balances do I have?",
    "what about my savings account?",
    "actually can i see whats in my current balance",
    "whats in my retirement",
    "what about my personal savings?",
    "okay is there anything in my savings account",
    "show me all of my account details in last month",
    "How much is in my other account?",
    "What about the balance in my rewards account",
    "Can you tell me what my Chase savings account balance is?",
    "what about my checking account balance thank u`",
    "what about college fund?",
    "and my Mastercard",
    "what do i have in my retirement account please",
    "now mortgage info",
    "What are my other account balances?",
    "itd be great if you could jsut show all",
    "can I have mortgage info",
    "What's my personal savings balance?",
    "what's in my senior account",
    "tell me about my chase account",
    "what about my CD account balance when u can",
    "What's in my emergency account",
    "You are on the phone with your bank and they just told you your savings balance",
    "Just tell me what is going on in all accounts",
    "how about credit card?",
    "show me my checking account balance right now",
    "i need my checking balance please",
    "what about my BOA account?",
    "Thanks for that information, do you also know the balance of my checking?",
    "Balance of all accounts",
    "While I have you here, can you tell me the balance of my other account?",
    "What about my accounts",
    "what's my available credit",
    "what about my checking account",
    "How bout my college savings",
    "What about the other balances i have?",
    "What is the balance of my bank account?",
    "can I have that mortgage info",
    "actualy just tell me another account balance",
    "creater my account",
    "Tell about my BOA account?",
    "How about my savings",
    "Oh, I mean, what is my statement balance",
    "Show me the payroll account balance.",
    "All accounts balance",
    "show me my checking account balance",
    "How about my checking account",
    "thanks, show me my checking balance next",
    "Show me the balance for the current account.",
    "oh, just my savings",
    "Can you show me the other account?",
    "I would like to see the balance for the other account.",
    "How much is in my retirement account?",
    "will you check my student account",
    "OK, now what about my other account?",
    "inform me about checkings",
    "What about my retirement?",
    "What are my balances for the other account.",
    "I would like to know the balance of my money market account.",
    "could you also tell me about checkings?",
    "what about savings",
    "BOA account?",
    "how is the looking the balance of my savings as well done?",
    "looking the balance of my savings as well is about what also",
    "what about my wave to save account",
    "what is about my retirement",
    "what is my balance as of today?",
    "what about my TD account",
    "What about my personal savings account?",
    "tell me about my chase savings too account",
    "talk about mortgage",
    "Can you also show me my mortgage balance",
    "show me all my balances",
    "Do I have any other balances?",
    "Do I still have money in my other savings account?",
    "How much is saved in the college fund account?",
    "What is my balance on my CD?",
    "show me what i have in my kids college find now",
    "Can you tell me my balance please?",
    "what about my main savings account",
    "savings next please",
    "how bout my oher account",
    "What is my checking account balance?",
    "what about will retirement",
    "and for the scotiabank account?",
    "Can I switch to the other account?",
    "instead, show me my checking account balance",
    "Can you tell me the amount of money in my savings account?",
    "How about my US Bank account?",
    "tell me about my chase savings for last month",
    "How about my mortgage?",
    "What is the status of my other balances?",
    "what about other checking account",
    "whats left in retirement?",
    "What is the balance for my other accounts?",
    "What other balances do I have?",
    "how about total balance",
    "Can you let me see my other saving's account?",
    "my personal savings?",
    "What is the balance of my other account?",
    "what about will on retirement",
    "what about my retirement",
    "I need to know about checkings",
    "what about my checking thanks",
    "I need my CD balance please.",
    "please tell me the detail about my kids college",
    "You now want to know the balance of another account?",
    "tell me about my chase savings",
    "um could you also tell me about the details and mutual fund?",
    "Please provide me my current personal savings account balance",
    "What is the balance of my checking account?",
    "How about my interest",
    "Show me the balance for the other account?",
    "How about my Roth IRA",
    "Show other balances",
    "What about my checking account?",
    "what about the balance in other account?",
    "How about my saving account balance?",
    "How much do I owe on my mortgage account?",
    "How about my checking",
    "just give me all account details",
    "tell me about my chase bank account",
    "open in a account",
    "What is the balance of my children's college fund?",
    "will need mortgage",
    "info for the mortgage",
    "so is there anything in my chase account?",
    "Can you tell me what my other balance is?",
    "How much do I have in my emergency fund account?",
    "Show my my investment account balance",
    "I want to see my savings account balance.",
    "i also need to know whats in my joint account",
    "What is the balance of my personal loan account?",
    "what you about my personal savings?",
    "just tell me whats in all account",
    "whats in my kids college fund",
    "how to check account balance ?",
    "is that my current or available balance",
    "tell me about savings",
    "Go ahead and show me the other one too.",
    "could you also tell me about all the balance",
    "what about my checking account balance if u could thx",
    "How about my 401k",
    "i want to know about checking",
    "what's left in the business checking",
    "I need balances for all of my accounts, could you give them to me?",
    "How much money to i have left.",
    "Tell now how much I owe on the mortgage",
    "what about my CD account balance now",
    "Now show me all my balances",
    "What about my beneficiary account",
    "now show me all of my account balances",
    "now my savings",
    "show me my checking account balance for last month",
    "Can you look at my other checking account?",
    "What about my other account?",
    "What else is on the other account?",
    "show me checking balance now please",
    "Can I have the balance of my savings account?",
    "could you also tell me about the mutual fund?",
    "what about my personal savings my account ?",
    "Can I have my checking account balance please?",
    "What is my balance on my credit card account?",
    "what about my college savings",
    "Tell me what's in my other balances",
    "tell me about my chase savings too",
    "actually can i see whats in my college fund",
    "What is the status of my 401k?",
    "what is my current account balance?",
    "what about my 401k",
    "just tell me whats going the in all accounts"
  ],
  "get_transactions_start": [
    "Can I see my account for purchases in Chicago please?",
    "What were the list of transactions for restaurants?",
    "i was out in california last year and dropped a bunch of cash at restaurants can you show me my transactions for that?",
    "transactions from last week's trip to Istanbul",
    "I need to see my transactions from two months ago.",
    "I want to be shown a list of my most recent expenses dating back to 30 days",
    "what are my transactions from grocery stores?",
    "List all my transactions that took place while I was in New Orleans.",
    "I have to know all the transactions from my time in New York",
    "How much was my last purchase?",
    "Show me my Las Vegas transactions",
    "I got to see my transactions from my checking account on California restaurants last year.",
    "what was my most recent deposit amount",
    "transactions with nike",
    "Please tell me what the last clear check in my account is?",
    "show me my expendetures from my checking account for dairy queen in ann arbor the past 2 weeks",
    "I need to see my expendetures in San Francisco last month",
    "I'd like to see a list of transactions from my checking account please.",
    "need let me know more about wanting to view a list of all my purchases at fast food places please",
    "How many transactions with Home Depot have been processed today?",
    "show me my transactions for kroger from my checking in the last 7 months in Ann Arbor",
    "How many transactions have I made in the last month?",
    "i like to know the purchases list of last month",
    "Can you provide a printout of all my transactions in February?",
    "hello, more info requested on wanting to see transactions from the past week need help",
    "i want to see all my transactions from now to 50 days ago",
    "Please give me all of the expenses from last Friday.",
    "transactions from last week's trip to Africa",
    "I need to know all the expenses from my time in New York",
    "what were my most expensive expenditures",
    "show me my expenses on clothing from my savings",
    "please give me the follow up of my account transaction details",
    "I would like to see a list of purchases detailsi made with nike",
    "Can you show me last month's purchases from my credit card?",
    "What are all my transactions from the last 3 days?",
    "Can you check all my March transactions?",
    "I gotta know the expendetures for all by bar hops",
    "Where were my most transactions made in the last 3 months?",
    "wanting to see transactions from the past week works how now",
    "What purchases did I make while in South Africa?",
    "i want to see all my purchases from now to 10 hours ago",
    "what was my last deposit",
    "I demand to see all the purchases on my account from the last week!",
    "may i get the transaction list from my savings account",
    "Please give me a list of my expenses for restaurants.",
    "Show me all the return expenses in my account at Bealls.",
    "I want to see everything I ordered from amazon",
    "hello. browsing for an answer wanting to view a list of all my purchases?",
    "What all did I buy from target want to see the transactions",
    "show me my transactions on clothing from my savings",
    "Can this thing tell me all of the times that I have gone to Hilton?",
    "I wish to see all my expenses from now to 10 days ago",
    "you mind showing me my bank records",
    "purchases from last week's trip to Rome",
    "I was on now wanting to see expenses from the past week now",
    "Can I please see all of the transactions I have made with Walmart?",
    "i want to see all my transactions from now to 10 days ago",
    "what about the purchases i have made for the wallmart",
    "transactions for gasoline",
    "Show me all my expenses for the last three weeks.",
    "need my expenses displayed for my trip to Miami",
    "when was the last time I paid money to Starbucks",
    "show me the list of all the bank dealings i made",
    "show me how much i withdrew and deposited",
    "browsing to view a list of all my expenses in Washington thank you",
    "show me all my transactions",
    "What are all my food expenses?",
    "let me know the transactions for all by market hops",
    "i was out in california last year and dropped a bunch of cash at restaurants can you show me my transactions for that",
    "Can you show me all my gas station transactions?",
    "Show me my checking transactions",
    "What is my list for the expendetures i made on restaurants",
    "i want to see my account details by providing a list of purchases",
    "I need to see any transaction involving gas stations.",
    "Can i see my transactions las week from my trip to Denever",
    "show expendetures for last 13 days",
    "what are my purchases from grocery stores?",
    "I'd like to see all of the transactions that I've made within the last week.",
    "let me know the expenses for The pizza places i when",
    "What are all of my purchases from Target?",
    "transactions from last week's trip to Mexico",
    "can you inform me more on wanting purchases for July 15th at Walmart for checking too",
    "I have to see all my expendetures from now to 10 days ago",
    "What expenses were made at McDonalds.",
    "Show me purchases in Boston from the past 2 months",
    "show transactions for last 11 days",
    "Give me all of the Miami expenses.",
    "Please show me the expendetures i made in china",
    "transactions from last week's trip to Europe",
    "list me the transaction details of credit card",
    "checking account for dairy queen in ann arbor the past 2 Month",
    "i was out in california last year and dropped a bunch of cash at restaurants can you show me my expenses for that?",
    "Can i see my expenses las week from my trip to New York",
    "Show me all of my credit card expenses in the state of virginia",
    "Please show me every transaction from the last 10 days on my account.",
    "Can you give me a list of all my transactions",
    "Show me the expendetures i made in Texas.",
    "I demand that you show me every single transaction I made at restaurants in New York City over the last five years!",
    "Print me my expenses from now to 7 days ago.",
    "show transactions for last 33 days please",
    "I must know all the purchases from my time in New York",
    "Can I see my account for transactions in Chicago please?",
    "I need all my Target transactions.",
    "i want to view a list of all my transactions",
    "where can i find my account activity",
    "purchases for school",
    "I'd like to see a record of the expendetures I've made over the last 10 days.",
    "i am looking for the grocery stores transactions in Ann Arbor",
    "Show me the list of my latest transactions.",
    "interested in and wanting to view a list of all my expendetures at fast food places for this",
    "Can you give me a list of transactions made within the last 1 month?",
    "I want to see all my Krogers purchases.",
    "show me my expendetures from my checking account on restaurants",
    "hi please elaborate more on wanting to view a list of all my purchases using credit at department stores please",
    "What was my biggest expense last month",
    "Give me the expenses for the past last week",
    "show me my expenditures",
    "Can you show me the last two months worth of transactions?",
    "Show me a list of my bank transactions",
    "I'd like to see the list of expendetures from my flight to Fort Lauderdale last month off my credit card",
    "Please pull up last month's expenses.",
    "hi tell me all about all my expenses in Washington for me",
    "What were my purchases last month from my savings account?",
    "Give me all of the Miami transactions.",
    "show me transactions from my trip on july 4th in cancun",
    "what about the transactions i have made with reebok",
    "Please show me the expenses that I have made within the last 2 weeks.",
    "can i know my all expendetures in last six months?",
    "show me my transactions from my checking account on restaurants",
    "expendetures for subscription services",
    "Show me all of my credit card transactions in the state of virginia",
    "Let me know the expendetures for all the bars I when to",
    "What is my list for the expenses i made on restaurants",
    "I want to see all the purchases that I made during my vacation to Brazil last week.",
    "What are all my purchases from the last 3 days?",
    "Can I have a list of all my clothing transactions?",
    "Show me all the return expendetures in my account at Bealls.",
    "Can I see a list of all my transactions within the last 10 days.",
    "transactions from last week's trip to Hawaii",
    "how many transactions have i had on this date",
    "I'd like to see an account of the transactions made in the last 10 days.",
    "transactions from last week's trip to Greece",
    "Can you show me all my gas station expendetures?",
    "What expendetures did I do while I was in Illinois?",
    "Can you show me last month's transactions from my credit card?",
    "help with wanting transactions for July 15th at Walmart for checking ok",
    "I wanna see my expendetures from my checking account on California restaurants last year.",
    "want to view a list of all my transactions in Washington, want some more info",
    "show me my expenses from my checking account for dairy queen in ann arbor the past 2 weeks",
    "I would like to see a list of expendetures i made with AMD",
    "Could I have the transaction list for clothing?",
    "What expendetures did I do while in Minnesota?",
    "What all did I buy from target want to see the purchases",
    "i was out in georgia in last year show me my all transaction in account",
    "I need to know all the expendetures from my time in New York",
    "expenses from last week's trip to Europe",
    "I need a list of all transaction from my last trip",
    "wanting to see purchases from the past week, want to learn more.",
    "hello, the concept of wanting expenses for July 15th at Walmart for checking is something I want more info on.",
    "Show me the transactions from this month on my debit card.",
    "I gotta know the transactions for all by bar hops",
    "I want to know the transactions for all by bar hops",
    "is there monthly report for my credit card",
    "I got to know the purchases for all by bar hops",
    "transactions for deliveries",
    "purchases for deliveries",
    "what were my past 2 transfers",
    "Can I have a list of all my clothing expendetures?",
    "What purchases did I do while I was in Illinois?",
    "What were the list of expenses for restaurants?",
    "transactions from last week's trip to Texas",
    "what were my 9 last restaurants that i dined at",
    "Hello, if it is not a problem can I see the expendetures I made using my debit card at GameStop over the past month?",
    "need wanting to view a list of all my transactions in Washington is about what",
    "Please list all purchases from Starbucks.",
    "help with wanting purchases for July 15th at Walmart for checking ok",
    "I must know all the expenses from my time in New York",
    "i want to see all my expenses from now to 10 days ago",
    "I should see the transactions i made in California",
    "what was the last deposit to my USA checking account",
    "I wish to know the transactions for all by bar hops",
    "show my expenses for last 12 days",
    "I would like to see a list of transactions i made with nike",
    "I want to see all my latest transactions",
    "Can you give me a list of my transactions from this past week?",
    "Please show me the transactions i made in china",
    "how many transfers have i made this week",
    "I would like to see a listing of all the expenses I've made over the past 10 days.",
    "I wanna see the expenses i made in California",
    "I want to be shown a list of my most recent expendetures dating back to 30 days",
    "please elaborate more on my expenses using credit at department stores",
    "let me know the purchases for The pizza places i when",
    "Can I have a list of all my expenses when I was in Canada?",
    "i want to see all my expenses from now to 15 days ago",
    "Please show me the expenses i made in china",
    "hi there, currently on now wanting to view a list of all my expendetures in Washington.",
    "Show me all my transactions from Chicago.",
    "tell me more on wanting transactions for July 15th at Walmart for checking",
    "Please list all transactions from Starbucks.",
    "Can i see my transactions las week from my trip to New York",
    "thinking of interested in and wanting expendetures for July 15th at Walmart for checking.",
    "i was out in california last year and dropped a bunch of cash at Nobu can you show me those transactions from my checking",
    "Show me my purchases in California",
    "when did i buy beer last?",
    "How many purchases did I have yesterday and can you print a list of them?",
    "on average how many transactions do i do a day",
    "i want to see my expendetures from all restaurants",
    "thinking of interested in and wanting purchases for July 15th at Walmart for checking.",
    "show transactions for last 30 days please",
    "what is my expenses for shoes",
    "show expenses for last 14 days",
    "I got to see all my transactions from now to 10 days ago",
    "I need to see the expenses i made in California",
    "I need to see all my transactions from now to 10 days ago",
    "I need to know all the transactions from my time in New York",
    "show my transactions for last 12 days",
    "purchases for subscription services",
    "I have to be shown a list of my most recent expenses dating back to 30 days now",
    "Are you able to provide me a list of expendetures made within the last 20 days?",
    "what about the transactions i have made for the wallmart",
    "I made how mny ATM withdraws while I was in Korea",
    "Can you pull my transaction history for my trip to Florida",
    "I must know all the transactions from my time in New York",
    "What are all of my transactions from Target?",
    "Please pull up last month's transactions.",
    "let me know the transactions for The pizza places i when",
    "What were all my transactions starting from 5 days ago?",
    "purchases for dining out",
    "What purchases did I make while travelling in Europe?",
    "I have to see all my transactions from now to 10 days ago",
    "show me expenses from my trip on july 4th in cancun",
    "show the expenses from my credit card at the tire shop",
    "Can you show me the last 15 days of transactions?",
    "I need to see all the clothing store expenses.",
    "transactions for gardening service",
    "expendetures from last week's trip to Alaska",
    "I will need a detailed list of transactions from Texas",
    "Can i see my transactions las week from my trip to VA",
    "thinking of currently on now wanting to view a list of all my expendetures at fast food places",
    "Could you please show me a list of transactions I have made with Microsoft?",
    "I need to know the transactions for all by bar hops",
    "help me with the transactions i imade with wallmart",
    "i was out in california last year and dropped a bunch of cash at restaurants can you show me my purchases for that",
    "tell me the last check in my account that cleared.",
    "please give me the list of online transactions i made last month",
    "thinking of wanting to see transactions from the past week, want to learn more thanks",
    "I would like to see all the transactions I made during my trip to London the other day.",
    "transactions from last week's trip to Uganda",
    "Let me see the transactions i made in California",
    "May I see all the transactions I've made in the last ten days.",
    "I'd like to see an account of the purchases made in the last 10 days.",
    "Would you show all of the expenses for the past month",
    "who did i last transfer money to",
    "I should know the expendetures for all by bar hops",
    "Can you show me all my expendetures so far today?",
    "i want to see my account details by providing a list of transactions",
    "what was the last thing I spent money on",
    "when did i last buy shoes",
    "Can you show me all my transaction activity for the last two weeks?",
    "Shoe me tha last transaction I made when in the 7 eleven store.",
    "I need to know the expenses for all by bar hops",
    "What transactions did I make in Texas?",
    "Show me a list of my transactions from Albany.",
    "show me my purchases at grocery stores from my checking in the last 3 months",
    "How many expendetures did I have yesterday and can you print a list of them?",
    "let me know the transactions for all restaurants",
    "Please list all expendetures from Starbucks.",
    "when did I buy coffee",
    "Show transactions made at the coffee shop please?",
    "Show me my purchases from my checking account on California restaurants last year.",
    "Can you show me every transaction at a bar?",
    "what about the expendetures i have made for the wallmart",
    "Let me see a transaction list from my current account",
    "i want all the transaction made with nike",
    "what are the recurring transactions from my savings account",
    "i was out in california last year and dropped a bunch of cash at restaurants can you show me my expendetures for that?",
    "show me all my transactions over the last 14 days",
    "I wanna see the transactions i made in California",
    "Can you give me a list of all my expendetures",
    "I will need to verify my transactions made in Europ",
    "how many transfers have i made this month",
    "what did i purchase in august",
    "what is my transactions for clothes",
    "can I see a transaction sheet from best buy",
    "browsing to view a list of all my transactions in Washington thank you",
    "Can you show me all my expendetures",
    "Show me my checking expenses",
    "tell me more on wanting expenses for July 15th at Walmart for checking",
    "show expendetures for last 10 days",
    "Are you able to provide me a list of expenses made within the last 20 days?",
    "Show me all expenses that I've made with Target.",
    "What was the list of transactions for groceries?",
    "show me all my transactions in alabama",
    "may i know my last transaction details",
    "let me know the purchases for all restaurants",
    "What were all my purchases starting from 5 days ago?",
    "I need to see all the clothing store expendetures.",
    "show me all transactions in connecticut",
    "hi tell me all about all my expendetures in Washington for me",
    "I wanna be shown a list of my most recent transactions dating back to 30 days",
    "Show me all transactions from checking last month",
    "Last weeks transactiosn please",
    "show me every transaction I made in Mexico",
    "when was the last time i paid shaw",
    "I got to know the transactions for all by bar hops",
    "i want my last transaction details",
    "Can you show me all my expenses so far today?",
    "Can i see my purchases las week from my trip to New York",
    "transactions for business",
    "Can you provide a printout of all my expendetures in February?",
    "Can you show me all my expenses",
    "show transactions for last 5 days",
    "show transactions for last 13 days",
    "Tell me what transactions were for clothing?",
    "I had how many ATM withdraws this week",
    "show me list of my bank transactions",
    "show me the list expendetures i have made with amazon",
    "Can I see my transaction history",
    "I wanna see my transactions from my checking account on California restaurants last year.",
    "Can you show me all my transactions",
    "may i know my transaction list of my account",
    "I'd like to see a list of any expenses with Tom Thumb.",
    "what are all the transactions i have made at my bank this month",
    "i want to see my account details by providing a list of expendetures",
    "show me all my expenses over the last 14 days",
    "i want to know all the expendetures from my time in New York",
    "Can you show me all the expendetures for Starbucks?",
    "I'd like a list of expendetures from my savings account.",
    "I wish to be shown a list of my most recent transactions dating back to 30 days",
    "I would like to see all the purchases I made during my trip to London the other day.",
    "show me my transactions in walmart",
    "expenses with nike",
    "I would like to see every single transaction I have ever made with Target.",
    "i am looking for the grocery stores expenses in Ann Arbor",
    "wanting to see transactions from the past week, want to learn more.",
    "hello, the concept of wanting purchases for July 15th at Walmart for checking is something I want more info on.",
    "transactions from last week's trip to Florida",
    "I want to see my recent purchases.",
    "I would like to be shown a list of my most recent transactions dating back to 30 days from my savings account",
    "need let me know more about wanting to view a list of all my transactions at fast food places please",
    "I have to know the purchases for all by bar hops",
    "what about the my transactions list of last 5 days",
    "I want to see my bank transactions.",
    "show me purchases from my trip on july 4th in cancun",
    "i want to see all my purchases from now to 1 year ago",
    "i want to see all my transactions from now to 20 days ago",
    "I wanna see all my expendetures from now to 10 days ago",
    "interested in and wanting transactions for July 15th at Walmart for checking?",
    "I have to see the expenses i made in California",
    "purchases from last week's trip to Chile",
    "I have to see my transactions from my checking account on California restaurants last year.",
    "hello, writing because wanting to view a list of all my purchases in Washington",
    "Can you tell me what the last check that cleared in my account was?",
    "I want to see expenses I made in New York last weekend",
    "I wanna be shown a list of my most recent expendetures dating back to 30 days",
    "tell me my expenses from my bar hops",
    "What expendetures did I make while in South Africa?",
    "what was my largest purchase",
    "Does my account show any expendetures for this month with Publix?",
    "What were the transactions for entertainment?",
    "What were my transactions last month from my savings account?",
    "thinking of wanting to see expendetures from the past week, want to learn more thanks",
    "Pull up all my activity from Florida.",
    "Could you provide me a list of clothing related transactions?",
    "show the transactions from my debit card",
    "Can you provide me with my transactions on May 1st?",
    "show transactions for last 60 days please",
    "i want to know all the transactions from my time in New York",
    "show me my expendetures for grocery stores from my checking in the last 3 months in Ann Arbor",
    "I need to see all of my Amazon expenses.",
    "expenses for convenience stores",
    "I should see the expendetures i made in California",
    "Hello, if it is not a problem can I see the transactions I made using my debit card at GameStop over the past month?",
    "I wish to see the transactions i made in California",
    "I'd like to see the list of expendetures from my flight to Fort Lauderdale last week off my credit card",
    "What transactions did i make with amazon",
    "Show me all purchases I made at Kohls.",
    "hi can you inform me more on my transactions from checking at fast food places",
    "show me my purchases from my checking account for dairy queen in ann arbor the past 4 weeks",
    "What was the list of purchases for groceries?",
    "I gotta be shown a list of my most recent transactions dating back to 30 days",
    "tell me my transactions from my sports event",
    "I wish to see all my purchases from now to 10 days ago",
    "i'd like to see all my expenses with puma",
    "What are the purchases i have at the tire shop?",
    "transactions for convenience stores",
    "hello, the concept of wanting transactions for July 15th at Walmart for checking is something I want more info on.",
    "I have to be shown a list of my most recent transactions dating back to 30 days now",
    "I demand to see all of the transactions that I have made with Electronic Arts!",
    "expendetures for business",
    "expendetures for shoes",
    "let me know the expendetures for all restaurants",
    "Show me all the return transactions in my account at Bealls.",
    "what was my biggest expense in july",
    "expendetures for gasoline",
    "Show me the purchases i made in Texas.",
    "I'd like to see the list of transactions from my flight to Fort Lauderdale last week off my credit card",
    "Can you show me my recent purchases from the club I went to last night?",
    "show me my transactions for grocery stores from my checking in the last 3 months in Vegas",
    "Show me my recent checks.",
    "Show the expenses from my trip to California.",
    "how about need your help on wanting to see purchases from the past week",
    "Show me the expenses from this month on my debit card.",
    "show me the list purchases i have made with amazon",
    "Let me know the transactions for all the bars I when to",
    "show expendetures for last 33 days please",
    "show me the first 5 transactions in new york in august",
    "I wish to be shown a list of my most recent purchases dating back to 30 days",
    "I need to see the transactions i made in California",
    "I wish to know all the purchases from my time in New York",
    "Can you show me last month's expenses from my credit card?",
    "Can i see my transactions las week from my trip to Boston",
    "Give me the purchases for the past last week",
    "How many transactions today do I have with Walmart?",
    "how many transactions have posted today",
    "can i know my all transactions in last six months?",
    "provide me the expendetures list of this Year",
    "What were the expendetures for entertainment?",
    "what is my transactions for shoes",
    "Can you please show me my most recent bank transaction from the last 3 days?",
    "How many ATM withdraws do I have?",
    "I got to see all my expenses from now to 10 days ago",
    "show purchases for last 6 days",
    "I need to see the expendetures i made in California",
    "I have to see the expendetures i made in California",
    "Please show me all purchases from Carter's.",
    "I also need to see a list of transaction from New York",
    "Tell me what purchases were for clothing?",
    "Please give me a list of my purchases for restaurants.",
    "What were the purchases for entertainment?",
    "show me my purchases for kroger from my checking in the last 3 months in Ann Arbor",
    "I would like to see a list of transactions i made with AMD",
    "Can you show me all my expenses?",
    "show me the transactions where i spend on food on thursday",
    "show me the shopping transactions of last one month for my account",
    "I have to see my expendetures from my checking account on California restaurants last year.",
    "show expendetures for last 6 days",
    "i like to know the about the purchases list of grocery shopping on this month",
    "I gotta know all the expendetures from my time in New York",
    "expenses for gasoline",
    "I need to see all the clothing store transactions.",
    "Please give me all of the expendetures from last Friday.",
    "what is my purchases for clothes",
    "I must see my transactions from my checking account on California restaurants last year.",
    "where was the last place i used my debit card",
    "was the last transaction cleared in my bank account a check?",
    "transactions for shoes",
    "transactions from last week's trip to Chile",
    "Show me my transactions this month from the debit card.",
    "I'd like to see a list of any expendetures with Tom Thumb.",
    "I need to be shown a list of my most recent transactions dating back to 30 days",
    "show me the first 5 purchases in new york in august",
    "tell me what my expendetures are for bars",
    "What are all of my expenses from Target?",
    "Show me transactions in Boston from the past 2 months",
    "please elaborate more on my transactions using credit at department stores",
    "how about need your help on wanting to see transactions from the past week",
    "transactions for fast food",
    "What are my transactions for all the restaurants this month?",
    "show expenses for last 60 days",
    "i want to view a list of all my expenses",
    "help me with the expendetures i imade with wallmart",
    "expenses from last week's trip to Alaska",
    "I want to be shown a list of my most recent transactions dating back to 30 days",
    "I must be shown a list of my most recent transactions dating back to 30 days",
    "please show me a list of each transaction i have made at the bank",
    "Show me all the transactions I have with wallmart",
    "Can you show me the last two months worth of expenses?",
    "thinking of wanting transactions for July 15th at Walmart for checking concerns what else",
    "I have to see the transactions i made in California",
    "hi more info requested on wanting transactions for July 15th at Walmart for checking ok",
    "let me know the purchases for all by grocerie stores",
    "how many banking transactions do i have this month",
    "Give me a list of transactions for my Orlando trip.",
    "Can you give me a list of expendetures made within the last 1 month?",
    "I should see the purchases i made in California",
    "Please show me the transactions i made in California",
    "i want account transaction details",
    "hi there, currently on now wanting to view a list of all my transactions in Washington.",
    "let me know the transactions for all by Clothing stores",
    "I like to see my purchases.",
    "wanting to view a list of all my transactions in Washington",
    "I must be shown a list of my most recent purchases dating back to 30 days",
    "purchases for gasoline",
    "what were my most expensive purchases",
    "I got to see my purchases from my checking account on California restaurants last year.",
    "what transaction i did with amazon",
    "I need to see all my expenses from now to 10 days ago",
    "Display all activity for my time in Las Vegas.",
    "what went on in my account",
    "How many purchases have I made in the last month?",
    "show me my list of transactions i made at restaurants",
    "How many transactions did I have yesterday and can you print a list of them?",
    "Please give me a list of my transactions for restaurants.",
    "I got to know the expendetures for all by bar hops",
    "Can you show me the transactions I made from my business account?",
    "I must know the expenses for all by bar hops",
    "Show me all my bank activity for the week I was in Arizona.",
    "show me my expendetures on clothing from my savings last month in Ann Arbor",
    "what is list of your bank transactions?",
    "How many expenses with Home Depot have been processed today?",
    "intimate me about the credit card transactions",
    "Show me all of my credit card expendetures in the state of virginia",
    "What expenses did I do while in Minnesota?",
    "show the transactions from my credit card",
    "What are all my food transactions?",
    "i'd like to see all my purchases with puma",
    "show transactions for last 7 days",
    "Give me a list of purchases for my Orlando trip.",
    "Please pull up my transacations list.",
    "hi please elaborate more on wanting to view a list of all my expenses using credit at department stores please",
    "would like see a txn list for your bank",
    "I'd like a list of transactions from my savings account.",
    "purchases for clothing",
    "show me all expendetures in connecticut",
    "how many transactions did i do at walmart this year",
    "Could you please show me my last month of transactions?",
    "may i get the details of my shopping receipts",
    "Please show me all expenses from Carter's.",
    "I have to know the transactions for all by bar hops",
    "need wanting to view a list of all my expendetures in Washington is about what",
    "How many transactions from ATMs do I have",
    "Can i see my transactions las week from my trip to NC",
    "can you show me the expendetures from my trip to Holland",
    "when did i waste money at peter luger",
    "What transactions were made at bars?",
    "I'd like to see a list of any transactions with Tom Thumb.",
    "can you show me the transactions from my trip to Holland",
    "Show me the list of my latest purchases.",
    "Can I see a list of all my expenses within the last 10 days.",
    "What was my biggest cost in August",
    "currently wanting expenses for July 15th at Walmart for checking",
    "show me my transactions from my checking account for dairy queen in ann arbor the past 2 weeks",
    "need my expendetures displayed for my trip to Miami",
    "Can i see my purchases las week from my trip to VA",
    "Can you check all my March expendetures?",
    "thinking of currently on now wanting to view a list of all my purchases at fast food places",
    "What is my transaction history regarding the football game I went to?",
    "show transactions for last 10 days",
    "let me see my transactions from my checking account on California restaurants last year.",
    "Are you able to provide me a list of transactions made within the last 20 days?",
    "expenses for renting movies",
    "I'd like to see a list of expendetures from my checking account please.",
    "How do I see my transactions from January?",
    "what are my expendetures from grocery stores?",
    "I must see the transactions i made in California",
    "hello, writing because wanting to view a list of all my transactions in Washington",
    "I wish to know all the transactions from my time in New York",
    "May I see all the expenses I've made in the last ten days.",
    "I have to be shown a list of my most recent expendetures dating back to 30 days now",
    "I want to see my recent transactions.",
    "I would like to see a list of purchases i made with AMD",
    "show expenses for last 5 days",
    "i need last transaction detail",
    "I should know the transactions for all by bar hops",
    "What transactions did I do while in Minnesota?",
    "transactions from last week's trip to Alaska",
    "Let me see the expenses i made in California",
    "expendetures for renting movies",
    "How many expenses today do I have with Walmart?",
    "tell me my transactions from my bar hops",
    "I'd like to see a record of the transactions I've made over the last 10 days.",
    "Show me all the transactions I made outside the US.",
    "Let me see a transaction list from my savings account",
    "Print me my purchases from now to 7 days ago.",
    "I need to see all my expendetures from now to 10 days ago",
    "I would like to see a listing of all the expendetures I've made over the past 10 days.",
    "expendetures for school",
    "when did i spend money on drinks",
    "Display all my expendetures from when I was in Montana, please",
    "what was my last purchase",
    "help with wanting expendetures for July 15th at Walmart for checking ok",
    "what's all the items I got from the apple store",
    "Can you give me a list of my purchases from this past week?",
    "show me my transactions for grocery stores from my checking in the last 3 months in Ann Arbor",
    "What transactions were made at McDonalds.",
    "I need to see my transactions in San Francisco last month",
    "Can you show me a list of grocery purchases?",
    "I'd like to see the list of expenses from my flight to Fort Lauderdale last week off my credit card",
    "Could you please show me a list of purchases I have made with Microsoft?",
    "Give me the transactions for the past last week",
    "Show me my transactions from my checking account on California restaurants last year.",
    "want to view a list of all my expenses in Washington, want some more info",
    "transactions from last week's trip to the UK",
    "show me list of my bank purchases",
    "show the transactions from my credit card at the tire shop",
    "Show me all purchases from checking last month",
    "show me all the deposits i have made",
    "show the all transactions from this week",
    "i want to see all my transactions from now to 15 days ago",
    "I will need a detailed list of expenses from Texas",
    "I want to see my recent expenses.",
    "show expenses for last 11 days",
    "how many purchases do I have from costco",
    "What was the list of expenses for groceries?",
    "Can I have a list of all my clothing purchases?",
    "Show me all expenses from checking last month",
    "expendetures from last week's trip to Florida",
    "I'd like to see which transactions for Dollar Tree show up on my account today.",
    "Can you show me all the expenses for Starbucks?",
    "I would like to see the list of transactions from the credit card.",
    "Show me all the transaction with grocery stores.",
    "I want to see transactions I made in New York last weekend",
    "I wish to be shown a list of my most recent expendetures dating back to 30 days",
    "show me all my expenses over the last 7 days",
    "show me my transactions for kroger from my checking in the last 3 months in Ann Arbor",
    "hi can you inform me more on my expenses from checking at fast food places",
    "Please show me the transactions that I have made within the last 2 weeks.",
    "when was my last transfer",
    "I wish to see all my expendetures from now to 10 days ago",
    "show the expendetures from my credit card at the tire shop",
    "What purchases have I made over the past year with Amazon?",
    "Can i see my purchases las week from my trip to Denever",
    "I would like to know the last set of transactions from my checking account over the last 4 months",
    "Could you provide me a list of clothing related expenses?",
    "transactions for cleaning supplies",
    "show me my transaction from my checking account mcdonalds in ann arbor the past 3 weeks",
    "what is the last thing i bought",
    "what is the transaction detail of my savings account",
    "Let me see all the transactions for Cleveland please",
    "I would like to see a list of expenses i made with AMD",
    "can you show me some transactions that happened in California",
    "What are the expendetures i have at the tire shop?",
    "I need my transaction sheet from minnesota",
    "how about need your help on wanting to see expenses from the past week",
    "hi please elaborate more on wanting to view a list of all my transactions using credit at department stores please",
    "I have to know all the purchases from my time in New York",
    "show expendetures for last 7 days",
    "Can i see my expenses las week from my trip to georgia",
    "What transactions did I make while in South Africa?",
    "I'd like to see which expendetures for Dollar Tree show up on my account today.",
    "need to view a list of all my purchases at fast food places",
    "Can you show me all my transactions so far today?",
    "tell me more on wanting purchases for July 15th at Walmart for checking",
    "what deposits and withdrawals did i have last week",
    "please give my last transaction detail",
    "interested in and wanting to view a list of all my transactions at fast food places for this",
    "I want to see all my Krogers transactions.",
    "show me my purchases from my checking account on restaurants",
    "Can you show me all my transactions?",
    "need my transactions displayed for my trip to Miami",
    "currently wanting transactions for July 15th at Walmart for checking",
    "What were my expendetures last month from my savings account?",
    "Please show me the expendetures that I have made within the last 2 weeks.",
    "What is my list for the transactions i made on restaurants",
    "browsing to view a list of all my purchases in Washington thank you",
    "show me my expendetures for kroger from my checking in the last 3 months in Ann Arbor",
    "Did I have any transactions when I was in Milwaukee last week?",
    "I'd like to see a list of transactions that I have made at restaurants.",
    "What transactions have I made over the past year with Amazon?",
    "i want to know the transaction with nike",
    "show me the statement of my bank transactions",
    "Can I have a list of all my transactions when I was in Canada?",
    "Can i see my purchases las week from my trip to Main",
    "i'd like to see all my transactions with puma",
    "I must know the transactions for all by bar hops",
    "purchases from last week's trip to Florida",
    "transactions from last week's trip to Brazil",
    "Tell me what expenses were for clothing?",
    "Give me a list of my activity when I was in Mexico.",
    "transactions for maid services",
    "I would like to know the last set of transactions from my checking account",
    "tell me what my transactions are for bars",
    "I would like to see every single transaction I have made over the past 30 days.",
    "Can I see expendetures for Toledo, OH?",
    "I have to know all the expenses from my time in New York",
    "show me all expenses in connecticut",
    "i want to see my transactions from all restaurants",
    "show me the cheapest thing I bought last week",
    "need to view a list of all my transactions at fast food places",
    "i want my transaction details",
    "I was on now wanting to see purchases from the past week now",
    "Show me all purchases that I've made with Target.",
    "What expenses did I make while travelling in Europe?",
    "show me the first 5 expenses in new york in august",
    "I like to see my transactions.",
    "Would you show all of the expenses for New York.",
    "transactions from last week's trip to Canada",
    "What was the list of expendetures for groceries?",
    "expenses from last week's trip to Mexico",
    "show me the most expensive things I bouth",
    "Please give me all of the transactions from last Friday.",
    "Can you show me all the activity I had with coffee shops?",
    "What expenses did I make in Texas?",
    "Can you show me all transaction there with McDonald's?",
    "I need to see all of my Amazon transactions.",
    "expenses for dining out",
    "purchases for cleaning supplies",
    "what expenses have i made at retail stores?",
    "expenses for subscription services",
    "Can you show me all my expendetures?",
    "Can i see my expenses las week from my trip to Main",
    "thinking of wanting to see purchases from the past week, want to learn more thanks",
    "has comcast charged me?",
    "has old navy charged my account",
    "I wish to see my transactions from my checking account on California restaurants last year.",
    "show me the list transactions i have made with amazon",
    "expendetures from last week's trip to Canada",
    "Can you tell me the expendetures I have from my savings account?",
    "if you can, wanting to view all from walmart is about what need help",
    "hi wanting transactions for July 15th at Walmart for checking is what I am currently looking for also",
    "show expendetures for last 30 days please",
    "Can you show me a list of grocery transactions?",
    "tell me my purchases from my sports event",
    "show expendetures for last 8 days",
    "I want to see all the transactions that I made during my vacation to Brazil last week.",
    "thinking of wanting purchases for July 15th at Walmart for checking concerns what else",
    "Show me the transactions i made in Texas.",
    "can you show me the expenses from my trip to Holland",
    "expenses for shoes",
    "If it is not a problem I would like to see my transaction history from the last 90 days.",
    "Can you give me a list of my expendetures from this past week?",
    "I need to see any transaction I've made with Amazon.",
    "i want to see all my purchases from now to 50 days ago",
    "what are the transactions i made with amazon",
    "show me my transactions from my checking account on restaurants in California",
    "Show me all my purchases for the last three weeks.",
    "need wanting to view a list of all my purchases in Washington is about what",
    "Please show me all transactions from Carter's.",
    "i need the details of transaction i shopped from amazon",
    "Show all transactions from Detroit.",
    "when was the last time i spend money at rps",
    "expenses from last week's trip to Brazil",
    "transactions for clothing",
    "how much money did i spend during my last debit transaction",
    "Give me a list of expenses for my Orlando trip.",
    "I wish to see all my transactions from now to 10 days ago",
    "What expendetures did I make in Texas?",
    "What expenses were made at bars?",
    "Can you show me all the transactions for Starbucks?",
    "transactions for renting movies",
    "I must see my expenses from my checking account on California restaurants last year.",
    "wanna see the transactions i made in California",
    "Can i see my transactions las week from my trip to Main",
    "I was on now wanting to see transactions from the past week now",
    "Please give me all of the purchases from last Friday.",
    "thinking of currently on now wanting to view a list of all my transactions at fast food places",
    "show me my transactions at grocery stores from my checking in the last 3 months",
    "i want to view a list of all my expendetures",
    "transactions for school",
    "i want to know all the expenses from my time in New York",
    "show me my transactions on clothing from my savings last month in Ann Arbor",
    "I have to know all the expendetures from my time in New York",
    "Show the expendetures from my checking account.",
    "I'd like to see which purchases for Dollar Tree show up on my account today.",
    "Can you tell me the transactions I have from my savings account?",
    "What is my transaction history from the International store for the past month?",
    "show me my purchases for grocery stores from my checking in the last 3 months in Vegas",
    "Print me my transactions from now to 7 days ago.",
    "What were my last 3 purchases?",
    "show purchases for last 30 days please",
    "I'd like to see a list of expenses from my checking account please.",
    "i want to see all my expendetures from now to 50 days ago",
    "Show me my transaction list",
    "I need my transaction list for 5 days",
    "show purchases for last 10 days",
    "Please show me my activity from Texas.",
    "show my expendetures for last 12 days",
    "Would you show all of the transactions for the past month",
    "Show me transcations made in Maine",
    "can you show me my activity from in miami",
    "Show me all transactions I made at Kohls.",
    "I gotta know all the transactions from my time in New York",
    "Show me my transaction list for the past 10 days",
    "what was the last transaction i had at the old mill restaurant",
    "transaction detail in texas",
    "expenses from last week's trip to Uganda",
    "show me all my expenses in alabama",
    "Can i see my transactions las week from my trip to georgia",
    "provide me the purchases list of this Year",
    "expenses from last week's trip to Africa",
    "what are my expenses from grocery stores?",
    "expendetures from last week's trip to Chile",
    "Can you show me my recent transactions from the club I went to last night?",
    "hi wanting expenses for July 15th at Walmart for checking is what I am currently looking for also",
    "What expendetures were made at bars?",
    "What are the transactions i have at the tire shop?",
    "Could you please show me every transaction I made using my credit card at Taco Bell restaurants last year?",
    "please elaborate more on my expendetures using credit at department stores",
    "Show the purchases from my trip to California.",
    "what transactions have i made at fast food restaurants?",
    "Show me a list of my bank purchases",
    "show transactions for last 14 days",
    "when did i spend money on karaoke",
    "list of all my transactions using credit at department stores",
    "show me my most recent payments",
    "I would like to know the last set of purchases from my checking account over the last 4 months",
    "Can i see my purchases las week from my trip to georgia",
    "show transactions for last 3 days",
    "hello. browsing for an answer wanting to view a list of all my transactions?",
    "show transactions for last 8 days",
    "Show me my transactions in California",
    "what are the fees that I got charged in my account",
    "Show me my transactions from my checking account on georgia restaurants last year.",
    "Can you tell me the expenses I have from my savings account?",
    "let me know the purchases for all by market hops",
    "can you inform me more on wanting transactions for July 15th at Walmart for checking too",
    "Can i see my expenses las week from my trip to california",
    "let me know the transactions for all by bar hops",
    "I would like to be shown a list of my most recent expendetures dating back to 30 days from my savings account",
    "what is last withdrawal",
    "i like to know the transactions list of last month",
    "what transactions have i made at retail stores?",
    "when's the last time I bought something at chick fil a",
    "what is the last check that cleared in my bank account.",
    "Please pull up last month's purchases.",
    "please elaborate more on wanting to view a list of all my transactions from checking at fast food places",
    "thinking of wanting to see expenses from the past week, want to learn more thanks",
    "I was on now wanting to view a list of all my transactions from checking at fast food places?",
    "What transactions did I do while I was in Illinois?",
    "i want to see all my transactions from now to 10 days ago from my checking",
    "show me my expenses on clothing from my savings last month in Ann Arbor",
    "show me all the checks i have written",
    "What transactions did I make while travelling in Europe?",
    "thinking of interested in and wanting transactions for July 15th at Walmart for checking.",
    "i want to see all my transactions from now to 10 hours ago",
    "i like to know the about the transactions list of grocery shopping on this month",
    "Give me the expendetures for the past last week",
    "i want to see all my transactions from now to 100 days ago",
    "tell me my expendetures from my bar hops",
    "Do you know how many times I withdrew from the ATM",
    "hi tell me all about all my transactions in Washington for me",
    "show expendetures for last 11 days",
    "Show me my expenses from my checking account on georgia restaurants last year.",
    "show the expendetures from my debit card",
    "i need the statement for my credit card",
    "show transactions for last 6 days",
    "I need to know the purchases for all by bar hops",
    "what about the my expendetures list of last 5 days",
    "hi there, currently on now wanting to view a list of all my purchases in Washington.",
    "I wanna be shown a list of my most recent purchases dating back to 30 days",
    "What are my last 10 expenditures",
    "I need to see the previous month's transactions from my credit card please.",
    "Show all purchases from Detroit.",
    "Print me my expendetures from now to 7 days ago.",
    "show me all my transactions over the last 7 days",
    "Show the transactions from my checking account.",
    "show me my transactions from my checking account for dairy queen in ann arbor the past 4 weeks",
    "provide me the transactions list of this Year",
    "Can I have a list of all my expendetures when I was in Canada?",
    "I would like to know the last set of purchases from my checking account",
    "Show me all expenses I made at Kohls.",
    "what are the fees that I got charged ",
    "Show me all the expenses I made outside the US.",
    "let me know the transactions for all by grocerie stores",
    "I wanna know the transactions for all by bar hops",
    "I wanna see all my transactions from now to 10 days ago",
    "wanting transactions for July 15th at Walmart for checking is done how here for this",
    "Show me all the return purchases in my account at Bealls.",
    "expendetures for gardening service",
    "Show me all my transactions for the last three weeks.",
    "Can I see transactions for Toledo, OH?",
    "Can i see my transactions las week from my trip to california",
    "Can I see my transactions for this year?",
    "Hello, if it is not a problem can I see the purchases I made using my debit card at GameStop over the past month?",
    "Would it be possible to give me a list of transactions made on groceries?",
    "I gotta see the expendetures i made in California",
    "I got to be shown a list of my most recent transactions dating back to 30 days",
    "Would you show all of the transactions for New York.",
    "I demand to see all the transactions on my account from the last week!",
    "i was out in california last year and dropped a bunch of cash at Nobu can you show me those expenses from my checking",
    "what expenditures did I have on my trip to Washtenaw and Wisconsin",
    "transactions for dining out",
    "I want to see all the expenses that I made during my vacation to Brazil last week.",
    "I want to see my Canada transactions.",
    "I gotta be shown a list of my most recent purchases dating back to 30 days",
    "let me know the expenses for all by bar hops",
    "How do I see my expenses from January?",
    "what is my purchases for shoes",
    "I need to see a full list of my Starbucks transactions.",
    "I want to know the expendetures for all by bar hops",
    "May I see all the expendetures I've made in the last ten days.",
    "What activity did I have in Salt Lake City? can i see transactions",
    "I must be shown a list of my most recent expendetures dating back to 30 days",
    "i need details of money transactions on amazon",
    "please elaborate more on my purchases using credit at department stores",
    "Show the transactions from my trip to California.",
    "What are all my food purchases?",
    "transactions for subscription services",
    "let me know the purchases for all by Clothing stores",
    "show me my transactions for grocery stores from my checking?",
    "what are the expenses i made with amazon",
    "expendetures for convenience stores",
    "Show me a list of my bank expenses",
    "I would like to see a list of purchases i made with nike",
    "hi more info requested on wanting purchases for July 15th at Walmart for checking ok",
    "tell me all about wanting to view a list of all my transactions from checking at fast food places thank you",
    "what expenses have i made at fast food restaurants?",
    "i want to see all my transactions from now to 1 year ago",
    "thinking of wanting expenses for July 15th at Walmart for checking concerns what else",
    "show transactions for last 60 days",
    "wanting to view a list of all my expenses in Washington",
    "how many times have i gone out to eat this month",
    "What were all my expendetures starting from 5 days ago?",
    "what is my expendetures for clothes",
    "can you show me the transaction list of the month June ?",
    "Show me my expendetures from my checking account on georgia restaurants last year.",
    "Can i see my expendetures las week from my trip to georgia",
    "I'd like to see the list of transactions from my flight to Fort Lauderdale last month off my credit card",
    "what are my transactions to my account",
    "show purchases for last 7 days",
    "Please show me the expenses i made in California",
    "transactions for theaters",
    "I would like to see a list of transactions detailsi made with nike",
    "expenses for clothing",
    "what was the cheapest thing i bought last tuesday",
    "I gotta see the transactions i made in California",
    "I would like to see a listing of all the transactions I've made over the past 10 days.",
    "Show me a list of my bank transactions?",
    "I want to be shown a list of my most recent purchases dating back to 30 days",
    "let me know the expendetures for all by market hops",
    "Show me all transactions that I've made with Target.",
    "In my account, what was the last cleared check?",
    "Does my account show any transactions for this month with Publix?",
    "transactions from last week's trip to Rome",
    "Display all my transactions from when I was in Montana, please"
  ],
  "get_transactions_update": [
    "i would like to see just from apple instead",
    "Just stuff over $500.",
    "How about on food and drinks",
    "what about for in miami",
    "Can you show me my transactions from Dublin next, please?",
    "Please give me a list of transactions in Ohio and not Michigan.",
    "Could you show me my grocery transactions instead, please?",
    "I want to see just the transactions from KFC.",
    "Can you show me all my recent Petco transactions instead, please?",
    "I wish to see just from microsoft instead",
    "what about for the last 3 weeks",
    "Will you show me my Costco transactions instead?",
    "Could you show me my TJ Maxx transactions instead, please?",
    "what if we did 400 instead",
    "Could you show me my transactions from restaurants next, please?",
    "what about the restaurants past month",
    "need how is the wanting all transactions for fast food done",
    "what about from wallmart",
    "if you can, is more info available on lookin for transactions in seattle",
    "I need transactions under $100",
    "tell me the transactions for colthes instead",
    "what about for clothing",
    "make it 260",
    "I want to see a list of transactions in Wyoming and not Colorado.",
    "What about my IRA account",
    "i want to see for grocery stores thank u",
    "Can you show me my transactions from San Jose next?",
    "Scratch that query for savings, what about from my Money market account",
    "show me only amazon plz",
    "allow me to see my transaction list for Ann arbor instead",
    "I must see transactions for groceries instead",
    "I want to see for new york instead",
    "How about transactions for amazon in new mexice",
    "i meant the grocery stores in texas",
    "Can you show me all my recent Trader Joes transactions instead, please?",
    "what about for the last 3 months",
    "how about in Michigan",
    "Just stuff less than $300.",
    "What about from Regenald's savings",
    "I want to view all from walmart",
    "anything transaction between $100 and $400",
    "can I do $1000",
    "I meant in Texa",
    "no it's $330",
    "explain wanting all transactions for fast food.",
    "show me from dell thanks",
    "tell me about the list for the past 9 months as well",
    "All right. What about retail?",
    "What about for when i was in New York",
    "Can you show me my transactions from San Jose?",
    "can you list the ones above 1900",
    "show me only amazon",
    "Will you show me all my recent Petco transactions, please?",
    "Can you show me my TJ Maxx transactions instead, please?",
    "Can you show me my transactions from San Diego next, please?",
    "anything under $40",
    "see just from Amazon instead",
    "What about from when i was in Ann Arbor Michigan",
    "also transactions between $500 and $1000",
    "tell me 200 and over",
    "show me from old navy plz",
    "what about from hooters",
    "show me from dell thanks so much",
    "Can you show me all my recent Walgreens transactions instead?",
    "I need a list for what I did in Georgia.",
    "I gotta see just from microsoft instead",
    "I wanna see transactions for groceries instead",
    "Could you show me all my recent CVS transactions instead, please?",
    "Any transactions from Macy's",
    "How am I able to just see my bills only?",
    "What about from Micro Center",
    "What about my transactions for food and drink at hooters",
    "make it a 300",
    "no i meant $100",
    "let me see my transactions list for Ann arbor instead",
    "How about from my acccount called Vacation savings",
    "Will you show me all my Amazon transactions instead?",
    "And was there any from food and drink expenses",
    "show me the ones from dell thx",
    "What about from Raul's savings",
    "wanting all transactions for fast food functions in what way",
    "Please show me the Adobe transactions that have have occurred.",
    "show me for food thanks",
    "Was there any transactions on Best Buy products?",
    "Show for amazon instead",
    "How about from Marcel's money rack account",
    "Can you show me all my recent Whole Foods transactions instead, please?",
    "lookin for transactions in seattle is what is going on need help",
    "I wanna see my transactions list for Ann arbor instead",
    "what about the grocery stores",
    "I rather see my transaction list from Texas rather than California.",
    "What about from Regenald's money",
    "Can you show me my transactions from San Jose next, please?",
    "how about for the last 9 weeks",
    "What about my checking account",
    "Will you show me all my CVS transactions instead, please?",
    "show me addidas",
    "can you check for my savings",
    "Any transactions from sava's restaurant",
    "What about from my traveling around New York",
    "anything below $100",
    "were there any other transactions from my trip to Antigua and Barbuda",
    "make it 200",
    "instead $200",
    "I meant in Texas",
    "now I want the 500",
    "Can you show me my transactions from San Francisco next?",
    "And what about for expensed from the movies",
    "less than $350",
    "Can you show me all my Walgreens transactions instead, please?",
    "I wish to see transactions for groceries instead",
    "Please give me the transactions for Target only.",
    "make it 10",
    "What about my savings account in New york",
    "Let me see transactions for groceries instead",
    "Could you show me all my recent Petco transactions next?",
    "Just under $750 only.",
    "Can you show me the last month",
    "Could you show me all my Amazon transactions instead?",
    "show me fron nike instead",
    "Can you show me all my recent Petco transactions instead?",
    "what about for the last year",
    "What about from my traveling around town",
    "Show me my transactions from my trip to Essiquibo",
    "what about from my shopping spree last Tuesday at Corla's bar ",
    "show me from safeway",
    "If not from my savings how about from my IRA account",
    "oh never mind i need under 1200",
    "I'd like that for 500",
    "It's for above $700.",
    "What about the transactions from my savings account",
    "Can you show me my transactions from Paris next, please?",
    "I want to know about anything over $500.",
    "can you help with wanting all transactions for retail clothing need help",
    "show for the last 8 months aswell",
    "Can you show me all my recent Walgreens transactions instead, please?",
    "questioning and wanting all transactions for retail clothing currently thanks",
    "I meant in ca",
    "Were there any other transactions on Sava's restaurant",
    "can you list the ones over 1500",
    "show me fron puma instead",
    "What about from when i was in Detroit",
    "How about for the last nine weeks",
    "Would you show me all my Amazon transactions instead, please?",
    "show me from safeway please thank u so much",
    "Can you show me the last year",
    "show me from ralphs instead thanks a lot",
    "What about from my money market account when i was in germany",
    "i want to see for grocery stores",
    " what about in california",
    "Can you show me my recent Petco transactions instead, please?",
    "How much money was spent for groceries instead",
    "I got to see just from microsoft instead",
    "Could you show me my transactions from airlines next, please?",
    "Can you show me all my recent Whole Foods transactions instead?",
    "I need to see transactions for groceries instead",
    "What about on Macy's",
    "What about from Macy's",
    "for amazon",
    "what about from google play store",
    "the ones above 1900",
    "show me from amazon please thanks a lot",
    "Would you show me my TJ Maxx transactions instead?",
    "show me for bars",
    "Can you show me my transactions from San Francisco, please?",
    "I'd like to see the ones over a thousand dollars.",
    "What about on electronics",
    "show me the ones under 1500",
    "Will you show me all my recent Walgreens transactions instead?",
    "Okay I want the ones under $50.",
    "Show me my transactions from my trip to new york",
    "hello, can you help with lookin for transactions in seattle",
    "What about in ann arbor",
    "Could you show me my transactions from Chicago next?",
    "What about my transactions at Micro center",
    "how about 75 dollars",
    "What about from the trip last weekend",
    "Can you show me all my recent Whole Foods transactions next?",
    "If not from my savings how about from my money market account",
    "I gotta see my transactions list for Ann arbor instead",
    "need need your help on wanting to view all from walmart thanks",
    "wanting all transactions for fast food functions in what way also",
    "list all above 1940",
    "over $100",
    "hi more information on wanting all transactions for fast food now",
    "what about for bar hops",
    "what about in michigan",
    "How about on child care",
    "what about the grocery stores?",
    "Can you show me my transactions from airlines next?",
    "What about my transactions at amazon",
    "Can I see my New York transactions instead of New Jersey?",
    "I need see transactions for groceries instead",
    "What about from the trip last week",
    "I gotta see just from Amazon instead",
    "Can you sort transaction so I only see those from Seattle?",
    "all that are less that $50",
    "hi there, writing because wanting all transactions for fast food is concerned, is there more information need help",
    "What about new york",
    "I have to see transactions for groceries instead",
    "wanting to view all from target is something I would like more information on thanks",
    "you know what i'm gonna need to see all my starbucks transactions too",
    "need I was on now wanting all transactions for fast food now",
    "Can you show me all my Trader Joes transactions instead, please?",
    "how about in florida",
    "Close this list and open up the list for Walmart.",
    "I want to see transactions for groceries instead",
    "Could you show me my transactions from restaurants next?",
    "What about my money market account",
    "My issue is the ones over $200.",
    "i would like to see for clothing also",
    "show me for hardware stores",
    "Any  transactions from amazon",
    "What about from best buy",
    "i want to see for grocery stores please",
    "Only what was more than $290.",
    "please also show for the last 18 months",
    "hi lookin for transactions in seattle is about what need help",
    "more information on wanting to view all from target ok",
    "show me for food thank u",
    "Can you show me my transactions from restaurants next?",
    "Lets try $45",
    "show me the ones from dell please",
    "I need to see just from microsoft instead",
    "Would you show me my Costco transactions instead?",
    "Scratch that query for checking, what about from my account called Department Store",
    "please list the ones above 1225",
    "I have to see my transactions list for Ann arbor instead",
    "All transactions over $250",
    "Can you show me a transaction list for Atlanta instead?",
    "I must see just from Amazon instead",
    "thinking of tell me more on wanting to view all from walmart now",
    "What about my transactions at Courts",
    "how about 200?",
    "what about from my shopping spree last Friday at Forever21",
    "Could you show me all my Amazon transactions instead, please?",
    "how about between $500 and $550",
    "What are my Milford transactions, not Fairfield, from Connecticut?",
    "If not from my checking how about from my savings account",
    "I wanna see just from Amazon instead",
    "under 120 please",
    "How about just my utility bills",
    "show me only amazon thanks so much",
    "$100 or more.",
    "How about from my acccount called Mischife",
    "hello. let me know more on wanting all transactions for fast food also",
    "I wanna see my transaction list for Ann arbor instead",
    "Just the transactions for movie tickets please.",
    "hi explain how the wanting all transactions for fast food is done",
    "allow me to see transactions for groceries instead",
    "what about from online transactions",
    "Instead of showing my transactions from Stamford, I'd rather see the ones from Norwalk.",
    "i would like to see just from microsoft instead",
    "Can you show me all my recent Trader Joes transactions instead?",
    "Can you show me my CVS transactions instead, please?",
    "Can you show me my transactions from Chicago next, please?",
    "Could you show me all my Target transactions instead, please?",
    "all of the ones above 1900",
    "show me lucky please",
    "have question, tell me all about wanting to view all from walmart",
    "wanting all transactions for fast food, what do I need to know with this thanks",
    "Could you show me my recent Whole Foods transactions instead, please?",
    "let me see transactions for groceries instead",
    "Can you show me my transactions from Atlanta next, please?",
    "um how about $60",
    "I got to see just from Amazon instead",
    "Can you show me all my CVS transactions next, please?",
    "What about in new mexico for amazon transactions",
    "Could you show me my transactions from Paris next, please?",
    "Will you show me all my recent Petco transactions instead, please?",
    "show me from old navy thanks so much",
    "I got to see just from Amazon instead now",
    "Scratch that query for checking, what about from my account called Depo",
    "let try 45",
    "make that 600",
    "How about $800",
    "And what about for entertainment",
    "were there any other transactions from my trip to Canada",
    "Would you show me my Costco transactions instead, please?",
    "how about for detroit instead",
    "How about from Reggie's account",
    "show me the ones from dell",
    "tell me for electronics instead",
    "let me see my transaction list for Ann arbor instead",
    "can you also tell me about $900 and $1000",
    "wat about $70",
    "hi there, let me know more on lookin for transactions in seattle for me",
    "can you tell me about 50 and 200",
    "Can you show me my transactions from Sacramento next?",
    "can you do 4000",
    "what is the wanting all transactions for retail clothing",
    "Let me see my transactions list for Ann arbor instead",
    "I must see just from microsoft instead",
    "And what about for food and drinks",
    "$100 dollars or more. thanks.",
    "What about in Macy's",
    "What about my checking account from that trip",
    "Can you show me all my CVS transactions instead, please?",
    "show me from old navy",
    "I need to see my transaction list for Ann arbor instead now",
    "What about my transactions at Roti Hut",
    "now under $400",
    "Can you show me a transaction list for Nashville instead?",
    "Can you sort transactions so I only see those from Seattle?",
    "I should see just from Amazon instead",
    "What about my transactions at Pizza Hut",
    "i need everything above 1550",
    "i meant in the california.",
    "make it 100",
    "wanting all transactions for retail clothing, would prefer more info too",
    "How about for starbucks",
    "How about from Irfam's checking",
    "Was there any transactions on traveling?",
    "how about gym",
    "what about from my shopping spree last Thursday at Best buy",
    "Try over 500",
    "the ones that go above 3000",
    "hi more info requested on wanting to view all from target also",
    "were there any other transactions from my trip to Guyana",
    "Could you show me my Target transactions instead, please?",
    "how about $600",
    "Can you show me my Costco transactions?",
    "How about transactions from my checking account at Evergreen",
    "I only want to see the transaction from Wal Mart.",
    "Could you show me my grocery transactions instead?",
    "I only want to see the transactions I made at Wendy's.",
    "I should see transactions for groceries instead",
    "let me know more about wanting all transactions for fast food please",
    "Will you show me my Costco transactions instead, please?",
    " How about from the money market account ",
    "What about from Raychiel's savings",
    "I want to see the set of transactions that were used at Goodwill stores.",
    "Could you show me my clothing transactions, please?",
    "what about from micro center",
    "I will see just from microsoft instead",
    "what about in california",
    "allow me to see just from microsoft instead",
    "What about from Roberto's savings",
    "Can you show me my Costco transactions next?",
    "you know what i'm gonna need to see all my Amazon transactions too",
    "Could you show me my clothing transactions next, please?",
    "I want to see my transactions list for Ann arbor instead",
    "Search for $250 or less.",
    "Can you show me my transactions from Sacramento next, please?",
    "Switch to Oregon instead.",
    "ok how about $474",
    "i would like to see microsoft instead",
    "Could you show me my transactions from San Francisco next, please?",
    "Can I take a look at the transactions history for Washington?",
    "Was there any transactions on trips?",
    "What about amazon instead",
    "Can you show me my Costco transactions instead, please?",
    "how about $15?",
    "And was there any from Moving expenses",
    "wanting to view all from walmart tell me more on this aspect",
    "What about from Lakeram's savings",
    "what goes over 300 dollars",
    "help me with more info on wanting to view all from target etc",
    "show me from amazon please thanks so much",
    "I have to see just from microsoft instead",
    "I'd like to see just from microsoft instead",
    "can you list the ones under 1400",
    "What about my transactions at walmart",
    "How about from my acccount called G2 Esports",
    "Could you show me all my Amazon transactions, please?",
    "Can you show me my transactions from bars next, please?",
    "list the transactions under 1500",
    "How much money did I spend at Walmart this year?",
    "What about in the last month",
    "Can you show me my clothing transactions next, please?",
    "show me for texas instead",
    "I need to really see my transactions list for Ann arbor instead",
    "is 200 possible",
    "If not from my checking how about from my Money market account",
    "What about starbucks",
    "let me see just from microsoft instead",
    "What about from when i was in New mexico",
    "ill also need the ones between 190 and 250",
    "I want to see my transaction list for Ann arbor instead",
    "show me for bars thank u",
    "change that to between 70 and 140",
    "Could you show me all my CVS transactions instead?",
    "Will you show me all my Amazon transactions?",
    "allow me to see just from Amazon instead",
    "what is my debit account transaction",
    "What about from walmart",
    "now can we 500",
    " what about amazon",
    "lookin for transactions in seattle is done how here now",
    "How about on trips",
    "the concept of wanting to view all from Sears is something I want more info on.",
    "Can you show me a transactions list for Nashville instead?",
    "Can you show me my transactions from bars, please?",
    "Search for $350 or more.",
    "Could you show me all my recent Petco transactions instead?",
    "Could I see my transactions for clothes this time",
    "show me for bars thanks",
    "I would like to see my Transactions in Utah and not Idaho.",
    "what about in ann arbor",
    "May I see a list for movie theaters instead?",
    "Scratch that query for checking, what about from my IRA",
    "I have to see my transaction list for Ann arbor instead",
    "i want all that exceed 1950",
    "show for new york instead",
    "And for fast food?",
    "show me from gap please thanks so much",
    "let me see for orlando instead",
    "I gotta see transactions for groceries instead",
    "How about from my chase account at Home Depot",
    "I have to see just from Amazon instead",
    "And was there any from traveling expenses",
    "I wanna see just from microsoft instead",
    "How about from rack account",
    "actually over 300",
    "Could you show me my transactions from Paris next?",
    "Instead of Detroit, could I see my transactions for Flint?",
    "How about for the first day",
    "How about on maternal care",
    "Could you show me my grocery transactions, please?",
    "wait change it to 750",
    "Can you show me all my transactions from Sacramento next, please?",
    "what if we do $2500 instead",
    "do one for 300",
    "Can you show me my clothing transactions next?",
    "Can you show me my Amazon transactions instead, please?",
    "what if I were to just do 1000",
    "how about for grocery",
    "I need to see my transactions list for Ann arbor instead",
    "I want to see just from Amazon insteadc",
    "Would you show me my TJ Maxx transactions instead, please?",
    "what about in th elast year",
    "How about from my acccount called Farm Project",
    "how about need your help on wanting all transactions for retail clothing",
    "hi wanting to view all from target give me more on this thanks",
    "show me from safeway thank u",
    "is more info available on wanting to view all from walmart for this",
    "show me only amazon thanks",
    "I need to see my transactions list for Ann arbor instead now",
    "can you do over 75",
    "Was there any transactions on clothes?",
    "what about 150 dollars",
    "wanting to view all from Sears functions in what way too",
    "hi how is the wanting all transactions for retail clothing done also",
    "Can you show me my transactions from Atlanta next?",
    "now make it 200 please sir",
    "what about food and drink",
    "Can I see transactions in New York?",
    "do between 500 and 1000",
    "show me for food",
    "What about from amazon",
    "I wish to see my transactions list for Ann arbor instead",
    "Let me see my transaction list for Ann arbor instead",
    "show me amazon please thank u so much",
    "please make it 40",
    "show me from ralphs instead thanks",
    "change that to $400",
    "do it over 20",
    "actually how about $400",
    "How about from christopher's account",
    "I need information for all of my transactions in July in Florida.",
    "Can you make it so it only shows the Reebok transactions?",
    "Was there any transactions on furnature?",
    "hello. wanting to view all from walmart give me more on this?",
    "hi wanting to view all from Sears is about what?",
    "Do $200",
    "show me addidas plpease",
    "How about on groceries",
    "Can you show me all my recent Whole Foods transactions?",
    "I got to see transactions for groceries instead now",
    "show me from amazon please",
    "need this for 600",
    "Any amount over $500",
    "Could you show me all my CVS transactions instead, please?",
    "What about Darian's savings account from that trip",
    "just the onese under 1250",
    "Could you show me my grocery transactions next, please?",
    "Make that 1000",
    "What about Darian's savings account from that",
    "need help, tell me more on wanting all transactions for fast food",
    "Will you show me my recent Petco transactions instead, please?",
    "Can you show me my recent Trader Joes transactions instead, please?",
    "show me the ones from dell plz",
    "need help, currently on now lookin for transactions in seattle now",
    "Let me see just from microsoft instead",
    "How much was from entertainment ",
    "show me from ralphs instead thanks so much",
    "make that $300",
    "what about for new mexico",
    "Can I take a look at the transaction history for Washington?",
    "Can you show me my Costco transactions next, please?",
    "were there any other transactions from my trip to mexico",
    "Can you show me from california instead?",
    "wanting to view all from walmart works how.",
    "um how about $6000",
    "wait i mean 90 to 150",
    "Could you show me all my recent CVS transactions instead?",
    "How about from Charley's account",
    "I wish to see my transaction list for Ann arbor instead",
    "What about from my traveling around Germany",
    "do between 100 and 200",
    "What about in ann arbor michigan",
    "Would you show me my Costco transactions?",
    "Could you show me my transactions from bars next, please?",
    "If not from my savings how about from my checking account",
    "now please for 40",
    "Would you show me my recent Whole Foods transactions instead, please?",
    "Could you show me all my recent Whole Foods transactions instead, please?",
    "show me for food please",
    "how about checking",
    "Ahd was there any from traveling expenses",
    "hi wanting all transactions for fast food is what I am currently looking for also",
    "What about from Steve's account",
    "I rather see my transactions list from Texas rather than California.",
    "hello, help with wanting to view all from walmart also",
    "what if I did $240",
    "Can you show me a transactions list for Atlanta instead?",
    "show me from dell please thanks",
    "I got to see my transactions list for Ann arbor instead",
    "I want that on a 600",
    "Have I been transactions too much at Taco Bell? Bring up those transactions.",
    "And what about for electronics",
    "I need both restaurants and gas",
    "currently lookin for transactions in seattle thanks",
    "What transactions are there for Idaho?",
    "oh can you do 160 to 170 now",
    "What about my transactions at evergreen",
    "do one for 400",
    "hi I was on now wanting to view all from target please",
    "Show me for my money market account instead",
    "Any transactions from walmart",
    "oh no i need uner 1900",
    "How much as from my trip to new york",
    "What about my transactions at google play store",
    "What about in california",
    "I was on now wanting all transactions for fast food",
    "Could you show me my transactions from Dublin next, please?",
    "How much was for entertainment instead",
    "Could you show me all my recent Petco transactions instead, please?",
    "Could you show me my transactions from San Jose next, please?",
    "Would you show me all my recent Whole Foods transactions, please?",
    "what about in detroit",
    "Can you show me my Target transactions instead, please?",
    "What about from my savings account",
    "wait change it to under 1550",
    "Can you show me my transactions from San Diego next?",
    "Exceeding 1000 please",
    "Scratch that query for checking, what about from my account called Recardo's checking",
    "I want to see just from Amazon instead",
    "What about transactions to mother's checking account",
    "Can you show me all my CVS transactions instead?",
    "Scratch that query for checking, what about from my savings",
    "questioning and wanting all transactions for retail clothing currently?",
    "What about on groceries",
    "Would you show me all my recent Whole Foods transactions instead, please?",
    "What about from the trip last Year",
    "what about electronics",
    "I must see my transaction list for Ann arbor instead",
    "How about on Electronice",
    "show me from dell",
    "Were there any other transactions on Sava's restaurant ",
    "all uinder $30",
    "Need the ones that are above $1000",
    "Can you show me my Target transactions instead?",
    "What about from Lackhan's savings",
    "Scratch that show me my transactions for my trip to new york instea",
    "Can you show me my transactions from restaurants next, please?",
    "show me from dell thank u",
    "what about $5000",
    "Now I'd like to see all meals out",
    "What about from my checking account",
    "Can you show me my transactions from Dublin next?",
    "how about gym address",
    "Can you do over 150",
    "Start over and show me the results for Target.",
    "What about my savings account",
    "how about for restaurants in ann arbor last month",
    "I must see my transactions list for Ann arbor instead",
    "Will you show me all my recent Petco transactions instead?",
    "Now, let me check the transactions from Michael's.",
    "I wish to see just from Amazon instead",
    "have question, questioning and lookin for transactions in seattle currently thank you",
    "I need the first two week of Juy",
    "what about from target",
    "how about less than $250",
    "Could you show me my TJ Maxx transactions instead?",
    "show me from dell please",
    "What about from the trip last Thursday",
    "what about between $100 and $200?",
    "Could you show me all my recent Whole Foods transactions next?",
    "I went to Portland, please make a list of all my transactions from there, thanks.",
    "Could you show me all my Target transactions instead?",
    "show me from ralphs instead",
    "hi there, need your help on wanting all transactions for retail clothing need help",
    "Scratch that show me my transactions for my trip to new york instead",
    "What about from Raychiel's account",
    "How about for the last seven days",
    "please do it for 499",
    "the ones below 750",
    "more info on lookin for transactions in seattle etc please",
    "need help, more info requested on wanting to view all from walmart",
    "show me for bars thanks a lot",
    "Could you show me my transactions from Chicago next, please?",
    "What about my transactions from when i was in michigan",
    "all of them under 600",
    "What about from the trip last Month",
    "What about my savigs account at walmart",
    "actually do $40",
    "What about my transactions at Chicken Hut",
    "how about in miami",
    "what about in new mexic",
    "Would you show me my clothing transactions next, please?",
    "um how about $60?",
    "What about from miami",
    "is it possible to do $1000",
    "how about interested in and lookin for transactions in seattle",
    "what about from my shopping spree last Wednesday at Clinc",
    "Can you show me my Amazon transactions instead?",
    "Can you show me all my recent Whole Foods transactions, please?",
    "Tell me everything that went over $100.",
    "any transactions above $100",
    "A transaction above $50",
    "What groceries transactions do I have?",
    "Any that exceed $1000",
    "I need to see just from Amazon instead",
    "What about my transactions from when i was in Ann arbor",
    "What about from my traveling around Michigan",
    "Was there any transactions on Watches",
    "how about 75",
    "Could you show me my transactions from San Diego next, please?",
    "I want to see just from microsoft instead",
    "I got to see transactions for groceries instead",
    "I need my transactions from Louisiana, not Tennessee.",
    "Would you show me all my Amazon transactions instead?",
    "hi there, right now wanting to view all from walmart is happening ok",
    "Could you show me all my recent Whole Foods transactions instead?",
    "Can you show me my transactions from Paris next?",
    "How about $400?",
    "Can you show me my transactions from Chicago next?",
    "what about in dallas",
    "what about for the past 9 months",
    "Scratch that show me for my money market account",
    "currently wanting all transactions for retail clothing too",
    "How about between $40 and $60?",
    "I think try 60 and 100",
    "what about in flint",
    "What about for transactions from ann arbor ",
    "have issue let me know more on lookin for transactions in seattle",
    "show me the ones from dell thanks",
    "any transaction over 100",
    "Could you show me my clothing transactions next?",
    "show only for amazon this time",
    "I must see just from microsoft instead now",
    "And was there any from my trip to ann arbor",
    "if you can, more info requested on wanting all transactions for fast food",
    "Will you show me all my recent Walgreens transactions instead, please?",
    "Could you show me my Amazon transactions instead, please?",
    "show me the ones from dell thank u",
    "How about from checking account",
    "show me lucky please thanks so much",
    "let me see just from Amazon instead",
    "can you make it 50",
    "what about for the last 4 months",
    "tell me the transactions for amazon instead",
    "I only want to see the transactions from WalMart.",
    "I should see my transactions list for Ann arbor instead",
    "I need to really see my transaction list for Ann arbor instead",
    "what about in new york",
    "Can you show me my transactions from airlines next, please?",
    "actually $1000",
    "Can you change the transactions list to Kohl's?",
    "all of them over 1200",
    "I got to see my transaction list for Ann arbor instead",
    "Will you show me all my Amazon transactions instead, please?",
    "now I'd like it for 700",
    "Could you show me my transactions from Atlanta next, please?",
    "show me from dell please thank u",
    "I should see just from microsoft instead",
    "how about in ann arbor",
    "How about from my acccount called savings",
    "show me for food thanks so much",
    "And can I also see gas stations?",
    "I'd like the transactions for San Diego please.",
    "Will you show me all my CVS transactions instead?",
    "allow me to see my transactions list for Ann arbor instead",
    "How about from my acccount called checking",
    "I need them under 1500",
    "Can you show me my transactions from bars next?",
    "actually over 500",
    "actually in $500 and $600",
    "what about the stationary store",
    "how about $50",
    "And what about for trips",
    "Can you show me from new york instead?",
    "How about on coffee",
    "what aobut from amazon",
    "Can you check for between $200 and $300?",
    "oh sorry i want them between 100 and 200",
    "Just show what exceeded $800.",
    "I need to see my transaction list for Ann arbor instead",
    "I must see just from Microsoft instead",
    "show me for miami instead",
    "how about for denver",
    "show me from safeway please",
    "Could you show me my recent Petco transactions instead, please?",
    "Can I see that for starbucks in new york instead?",
    "I gotta see my transaction list for Ann arbor instead",
    "what about for food and drink",
    "interested in and wanting all transactions for fast food need help",
    "What about from when i was in new mexico",
    "How about insurance transactions",
    "Over $3000 please",
    "Can I print the transaction list?",
    "Can you show me my recent Walgreens transactions instead, please?",
    "show me from ralphs instead thank u",
    "How much money was used for entertainment instead",
    "Will you show me all my Amazon transactions, please?",
    "what about from my shopping spree last monday at Micro Center",
    "so can we do 400",
    "I should see my transaction list for Ann arbor instead",
    "Would you show me all my recent Whole Foods transactions instead?",
    "what abour from online stores",
    "How about on furniture",
    "what about in brooklyn",
    "were there any other transactions from my trip to Ann Arbor",
    "What about my savings account in Canada",
    "What about My transactions from st Kitts and Nevis",
    "need is more info available on lookin for transactions in seattle now",
    "show me amazon please thank u",
    "How about from the money market account ",
    "how about for grocery stores?",
    "what about between $450 andd $700",
    "Can I print the transactions list?",
    "what about for the last 6 weeks",
    "Show me restaurant transactions instead.",
    "what about in calarado",
    "How about $75 and $100?",
    "Exceeding $100",
    "need tell me all about wanting all transactions for retail clothing?",
    "How about for those in ann arbor",
    "Scratch that query for checking, what about from my account called Extra savings",
    "Will you show me all my recent Walgreens transactions, please?",
    "I would like a 500",
    "under $400",
    "have question, wanting to view all from Sears is done how for me",
    "Can you show me my transactions from San Francisco next, please?"
  ],
  "spending_advice_start": [
    "Do you think it's smart to spend $250 on a new shoes from nike?",
    "Is it advisable to spend $300 on Alvababy.com?",
    "Can I afford to go on vacation during the summer? It will cost about $4500.",
    "Is it a good idea to spend around an extra $100 a month good for my current budget",
    "am I allowed to buy some goods from Adidas costing around $1500 dollars?",
    "Will I be over budget if I go out for dinner and to a movie this week?",
    "should i spend a hundred dollars on gas this month",
    "is it actually smart to spend $300 on a new shoes from nike?",
    "Should I spend $179 for a Geek Squad contract?",
    " it is a $40 burger. do you think that is overspending?",
    "Can I get gas for $49?",
    "I need you to help me know if it's a good idea to purchase a gaming computer which costs around $5000",
    "Is it okay if I spend $2000 on winter sports?",
    "can I actually afford to go for dinner this saturday? it might cost around $50",
    "should i spend $300 on games from gamestop?",
    "spend 400 on the Nikes?",
    "should i buy electronics from sony costing around $5000 this year?",
    "Is it a good idea to pay the extra $50 dollars for extra insurance coverage for my phone?",
    "I want to buy a new computer for 600 dollars, can I afford it",
    "Will I go over my budget if I spend $$234 on groceries?",
    "Can I buy new headphones for $40?",
    "Should I get amazon prime for 6 dollars a month?",
    "Should I buy a game from GameStop at $50?",
    "I have $50 in my bank account right now- should I go out with my friends tonight?",
    "I am thinking of purchasing $267 on shoes at puma, is that a good idea?",
    "Do you find it to be okay to spend $100 on a gym membership at Planet Fitness?",
    "Do I have enough to buy a truck, with my other bills?",
    "Can I buy a $200 dress from Anthropology",
    "Do I have enough for $400 purchase at Walmart?",
    "I am thinking of getting a watch for my birthday from Movado, Should i spend $300 for it?",
    "I am looking to get some spending advice, can you help me?",
    "Do I have enough to buy a pair of $75 shoes from DSW?",
    "Can i buy compter parts from amazon for around $3000",
    "Is this house a good buy for the area, their offer is $250,000?",
    "Can I afford a $25,000 car?",
    "is it a bad idea to spend $20 on food",
    "I want to splurge at a spa, is 400 $ too much to spend?",
    "Is it a good idea to purchase a car for 50000? Do you think it's a good decision?",
    "so am I allowed to buy some electronics costing $300 from Fry's Electronics?",
    "Is it a good idea to buy goods from Nike costing around $1000",
    "Should i buy some electronics costing $300 from Best Buy",
    "Will I ruin my budget if I buy a pair of leggings for $85?",
    "Would it be dumb to buy a $500 coffee machine from Nordstrom this week?",
    "can i spend $5 on food",
    "tell me if it is smart to spend $300 on a new shoes from nike?",
    "Can I spend $121 on School supplies?",
    "How would it be if I paid 200 for gas",
    "Will I blow my budget if I spend $200 at amazon?",
    "need let me know more on wanting to know if I can get a new laptop for $500",
    "Do i have enough in my clothing category to spend $20 at target?",
    "How much spending can I afford per week?",
    "Can i buy more electronics",
    "I am thinking of getting a watch for my birthday from Movado, Should i spend $200 for it?",
    "should i spend 150 dollar from my network bill",
    "Do you think it's smart to spend $10 on a new hat from Payless?",
    "Can I spend $20 on music from iTunes this month?",
    "Will it affect my budget of i spend $200 at Nike store?",
    "I want to buy a 400 dollar watch, should I buy that?",
    "can i afford to spend $400 on vacation?",
    "Would it be wise to spend my money this way?",
    "so can I buy some goods from Adidas costing around $1500 dollars now?",
    "Is a flight on Jet Blue that cost $700 to Hawaii a good idea?",
    "Can we afford to purchase $50 of extra insurance.",
    "How much can I afford to spend on a new house?",
    "Should I spend 50$ this weekend at the fair?",
    "Can I afford to spend $30 tonight for a steak and lobster dinner?",
    "Is it a good idea to spend $50 dollars on a new dress?",
    "I'm thinking about buying a new iPhone from AT&T on sale for $980. Will this fit into my budget now?",
    "I am thinking of getting a watch for my birthday from Nike, Should i spend $300 for it?",
    "Could you advise me if I should spend $2000 on a new wardrobe?",
    "Should I spend $40 on clothes at Walmart?",
    "Can I buy a 50 dollar pair of shoes at Eastbay?",
    "Should I buy a $200 rain jacket from REI?",
    "is it allowable to buy some electronics costing $300 from Fry's Electronics?",
    "can i buy that 20 dollar suit",
    "Is it a good idea to buy shoes from Nike costing around $2500?",
    "Is it a good idea to buy a TV from best buy for $500?",
    "Is it a good idea to buy a $500 IPAD?",
    "can i spend $227141",
    "can I now buy some goods from Adidas costing around $1500 dollars?",
    "Can I really spend an extra $34 each month to get better internet?",
    " im going to need a new car since i got in an accident yesterday so can i afford a car payment of $200 per month",
    "Should I get a tablet now for $500 or wait until the holidays?",
    "help me on how to spend money on shopping",
    "Can I afford to go to another concert and spend $100 for a pair of tickets?",
    "Can i afford to spend $50 on electronics for my home in this month?",
    "If i buy a LED TV costing $4000 will it put me over my monthly budget?",
    "Is it a good idea to spend around an extra $40 a month?",
    "What should I spend a month on groceries?",
    "Do I have enough to spend $200 at amazon?",
    "is it okay to buy some electronics costing $300 from Fry's Electronics?",
    "Can i buy $500 TV from Costco?",
    "Is it a good idea to buy shoes from Nike costing around $750?",
    "so can I spend an extra $34 each month to get better internet?",
    "should I buy some goods from Adidas costing around $1500 dollars?",
    "can i spend a hundred clams on pasta sauce",
    " what is your opinion on spending $4 on memes",
    "Can I afford to spend 6000.00 more to get the bigger car?",
    "want to spend the 200 on Nikes",
    "tell me if it's okay for me to spend $500 at Micor center on computer parts",
    "so am I able to buy some electronics costing $300 from Fry's Electronics?",
    "Can I spend $30 on Best Buy?",
    "Would I be able to afford a shopping spree at Walmart with $100?",
    "Can I spend an extra $34 each month to get better internet",
    "Can I afford to buy a $2000 over from Best Buy?",
    "Is it a good idea to spend $32,000 on a brand new car?",
    "Would you advise that I buy a $1200 computer from Apple",
    " i want to join a new gym but the intial membership fee is expensive its $100 can i afford that?",
    "I want a new inflatable dome house like that one for sale on WISH. Should I go ahead and buy it?",
    "want to spend the 500 on Nikes?",
    "Do you think it's ok to spend $80 on dinner at Olive Garden?",
    "Can I spend $250 on clothing at Kohls?",
    "Is it a good idea to spend around an extra $20 a month good for my current budget",
    "Will I blow my budget if I spend $345 at Asus?",
    "i want to travel the world for two years; how can I afford that?",
    "Is it okay if I go to dinner at Longhorn and spend about $75?",
    "Do I have enough money saved up to take a vacation to Paris this summer?",
    "Will it be a good idea for me to spend $45 at Home Goods?",
    "Will spending $40 on electronics put me over my monthly budget?",
    "I want to buy a 500 dollar watch, can you help me to buy that?",
    "Can I afford to stay to Trump Tower for $5000?",
    "Do you think it's smart to spend $200 on a new shoes from nike?",
    "can i spend 402 cents",
    "Should I spend $300 at Macy's?",
    "The Kleenex at Target is on sale. Should I spend $50 on it?",
    "Should I get food and drinks at hooters? Is that a good idea",
    "It is in my budget to spend $345 at Yankee Candle this week?",
    "Is it an okay idea to buy new fabric to make pillows this month?",
    "Should I buy that 60 dollar video game?",
    "Can I spend 300 dollars at Fleet Farm on clothing?",
    "Is it okay for me to buy $300 worth of stuff at Yankee Candle?",
    "Can I buy clothes from Target that cost $40?",
    "If there enough money left this month for spending $48.05 on Cofee?",
    "I will be getting a watch for my birthday from Movado, Should i spend $300 for it?",
    "Would I have room in my budget for a $40 jacket from H&M?",
    "I am looking to buy a new Apple IPhone, Should i spend the $500 now, or should i wait for the new model?",
    "Will my budget for the month be off track if I spend an extra $300 this month on clothes?",
    "Can you tell me if I can afford 2999 on a tablet.",
    "questioning and looking to see if I should purchase a hat at $100 currently.",
    "How much should I pay for this car, they're asking $15,000 from a dealer?",
    "Should I buy these $129 pair of Nike shoes?",
    "What should I be spending every month on groceries",
    "Going out every weekend this month spending about $50 every time. Will that put me over budget?",
    "Do I have enough money to go to the zoo this weekend with my 4 children with an admission price of $14 per child?",
    "Should I spend the extra $10 monthly for better renters insurance?",
    "I want a smartphone that costs $499, is it a good buy from Sprint?",
    "How can I get some quick spending advice?",
    "Can I afford to spend $200 at Ulta this week?",
    "Can i rent an apartment for $750 per month?",
    "Should I spend an extra $150 to have premium insurance for my car?",
    "If there enough money left this month for spending $200 on clothes?",
    "do you think $90 is a good idea to spend on an oil change tomorrow?",
    "Can I afford $60 a month for internet?",
    "Can I afford a 300 jacket?",
    "Should I save my money or is buying a $250 video game console at Meijer okay?",
    "i want to buy sports shoe from puma costing like $500?",
    "is it a bad idea to spend $90 to reserve a birthday party at Build a bear?",
    "Should I save half of my paycheck, or spend it on a trip to Disneyland with my family?",
    "Will I go over my budget if I spend $805.39 on Stocks?",
    "Is it worth $10 more per month to increase my data plan?",
    "Should I continue with this order for $100 worth of pizza from Dominos?",
    "I want to buy a 500 dollar television, should I buy that?",
    "so I am getting a watch for my birthday from Movado, Should i spend $300 for it?",
    "How about $200 in shoes from Macy's?",
    "Is a crosby record player for $69 from Urban Outfitters worth the money. Would I be cool if I bought this?",
    "Would it be okay to spend $350 at Sephora today?",
    "Can i buy $100 chocolate from Godiva?",
    "Where can I get groceries for $50 dollars a week?",
    "Will buying this $500 Xbox One X put me over my budget for this month?",
    "Would it be a bad idea for me to spend $95 at Target?",
    "Should I buy a perfered stock for the amount of 5000?",
    "shall I buy some goods from Adidas costing around $1500 dollars?",
    "Will a new sweater put me over my monthly spending allowance?",
    " can I spend £200 on tennis rackets?",
    "Is it a good idea to buy a new car?",
    "Can I afford to pay $200 of groceries from Walmart?",
    "Should I get food and drinks at mcdonalds? Is that a good idea",
    "What is my entertainment budgetfor this week?",
    "so actually can I spend $340 on a new computer part from amazon? I am not sure if it's a good idea. Can you tell me?",
    "Can I spend 20 dollars on a pay per view game?",
    "Should i spend $350 with United airline traveling to San Diego this month?",
    "so is it smart to spend $300 on a new shoes from nike?",
    "I am getting a watch for my birthday from Movado, Should i spend $300 for it?",
    "Will my monthly budget handle my purchase of a pair of K Swiss Classics from K Swiss's website that cost 75.00?",
    "Should I get the upgraded wifi/internet for 40.00 more a month?",
    "Is it a good idea to spend around an extra $4000 a month good for my current budget",
    "Can you help me know if it's a good idea to purchase a gaming computer which costs around $3000",
    "Can I buy computer parts from Micro Center for $600?",
    "let me know if I should buy a computer for arounf $5000",
    "A new set of tires from Costco costs $800. Should I buy them?",
    "Is it a good buy for socks costing $5 from Walgreen's?",
    "Is buy a $400 TV at Wal-Mart within my budget?",
    "Can I afford to spend an additional $100 per month at the hair salon?",
    "Should I get a $300 blazer from Kohl's?",
    "I might buy a new TV, how much should I spend?",
    "can I actually buy compter parts from amazon for around $3000?",
    "i should spend $400 to buy shoes from puma",
    "how much would I need to spend every week eating out to go over my budget?",
    "Can I get $1000 worth of groceries from Costco?",
    "Can I purchase a jacket from Zara that cost $150?",
    "Can i afford to spend $25 on a new pair of pants today?",
    "Is it wise for me to spend $200 on a pair of shoes?",
    "How much should I spend on gas?",
    "Do I have enough to go to lunch - prob 20$",
    "Is it a good idea to go to the movies and spend $15?",
    "Do I have enough to spend $$234 at Dollar tree?",
    "Do you think $200 at Whole Foods is in the budget?",
    "Do you think it's worth to spend $10 on a new hat from Sears?",
    "Is $500 per month too much for me to afford for a new car?",
    "What's the right amount to spend on groceries this month?",
    "tell me right now if it's okay for me to spend $500 at Micor center on computer parts",
    "Is it wise to spend $500 on a TV at Best Buy?",
    "Is it smart to spend $40 on school supplies at walmart?",
    "am I able to spend an extra $34 each month to get better internet",
    "Is it a good idea to buy $500 worth of power tools from Home Depot?",
    " Is it wise to buy potatoes for $60?",
    "Can i purchase anymore food",
    "Do you think it's smart to spend $300 on a new shoes from converse?",
    "Is it a good idea to spend $500 at Kohls on maternity clothes?",
    "Can I afford an extra $75 being put towards retirement?",
    "Can you tell me if it's a good idea to spend $60 dollars on a new purse?",
    "Can I spend 500 dollars on a reel at Gander Mountain?",
    "Can i buy a laptop",
    "Can I spend $200 on a computer from walmart?",
    "I want to go gout with my friends and drop about 200 dollars on dinner can I afford that?",
    "I need an advice for buying a light bulb can i afford one for $15",
    "Can I afford to buy the Dell laptop for $800?",
    "Will a trip to Best buy for electronics costing $3000 a bad idea",
    "I'm looking for advise on if this would be a good purchase.",
    "Is it wise for me to spend $200 on a pair of shoes at Famous Footwear?",
    "i am thinking to get television from sony . should i spend $7000?",
    "I can't decide, is $175 a good idea to spend for my 5 year olds birthday party?",
    "Please advice if it would be okay to spend $250 on a new pair of shoes?",
    "Do I have enough to spend $30 at central processing unit?",
    "Can I afford $950 a month school loan payments?",
    "Will a trip to Best buy for electronics costing $1000 a bad idea",
    "I want to impress a girl with a fancy dinner, will it go over my budge?",
    "i am looking to get some spending activites can you help me",
    "I am thinking of purchasing $343 on shoes at nike, is that a good idea?",
    "Can I afford to go out to lunch on Friday? It would probably cost $20.",
    "Is it a good idea to buy shoes from Nike costing around $2000?",
    "Can I buy that new iPad at the Apple store that costs 1200.00?",
    "Can I actually spend an extra $34 each month to get better internet?",
    "How much do I have to safely spend on a new TV, it costs around $2000",
    "Should I spend $700 at Frys this weekend?",
    "If I spend money on a $1000 graphics card, will I be able to pay all my bills this month?",
    "What would be the result of paying $1000 to Mcdonalds?",
    "would it be wise to buy an HP computer for $300 now?",
    "can I get to spend 200 for Nikes?",
    "is it a good idea to spend $500 on new tires this month.",
    "Should i buy food and drinks from hooters for around $98? Is this a good idea",
    "I want a new TV from Costco and it is $900, do you think this is okay?",
    "Is spending this money on an aquarium a good choice?",
    "If i buy a LED TV costing $1000 will it put me over my monthly budget?",
    "am I able to buy compter parts from amazon for around $3000?",
    "could I spend an extra $34 each month to get better internet?",
    "Is it a good idea to get tires from Walmart that cost $425?",
    "I want to go on a cross country road trip but only have $400 should i do that?",
    "How much of a down payment for a house should I budget?",
    "I want to know if it's a good idea to buy new dress pants right now. They cost $45.",
    "I want to buy my dog a $30 halloween costume from Petsmart, is that ridiculous?",
    "so am I able to buy some goods from Adidas costing around $1500 dollars?",
    "Do you think it would be a good idea to buy a new Amazon Alexa for the price of 125.00?",
    "If I spend $40 per month on a gym membership will I go over my budget?",
    "Can i afford to spend $500 on electronics for my home?",
    "Can i afford to go for dinner this saturday? it might cost around $50",
    "Is it ok to spend $2000 on tv from Bestbuy?",
    "Will I be able to afford to buy a smart watch from Apple with the remaining balance on my monthly spending expense?",
    "we have a trip coming up, is $395 a good idea to spend on a hotel room at the Hard Rock?",
    "i would ilke to spent 400 dollars for fish tank",
    "can i go out to dinner with 50 next week",
    "If i brought this speaker for $50 how much would i have left in my budget?",
    "Do you think it is fine for me to spend $50 on drinks at a bar?",
    "Should i spend an extra $50 each month to get better internet?",
    "Everyone at college has an expensive Canada Goose Parka. Are they worth $900?",
    "Home Depot has a grill for $350. Should I buy it?",
    "Some of us want to have a night out this weekend, but can I afford to spend upwards of $100?",
    "I need to go to a party, can I spend 100 for a costume?",
    "Do I have enough money to take a vacation to Paris this spring?",
    "Do you think it is wise to spend another $200 on uniforms this month?",
    "i want to buy 150 dollar clothes in amazon",
    "Can I buy shoes from Foot Locker that cost $150?",
    "i spend $500 on clothes from amazon",
    "Can I buy an oven from Home Depot at $500?",
    "should i get the short ribs given how expensive they are  ",
    "Do you think it is wise for me to buy a new pair of Converse shoes for $45?",
    "Should I spend $500 dollars for a weekend trip?",
    "Should I spend an extra $80 for an oil change for my car?",
    "Will I go over my budget if I spend $121 on School supplies?",
    "I need advice on spending can you help me?",
    "Does my budget allow for an extra $200 spent on shoes?",
    "Do you think it's a good idea to spend $600 on back to school shopping at Target?",
    "If there enough money left this month for spending $30 on Best Buy?",
    "Can I afford a new car? It is around $30,000",
    "is it actually okay for me to spend $500 at Micor center on computer parts?",
    "Should I spend less than $500 a month on eating out?",
    "Can I afford to spend $80 this weekend to go to a concert?",
    "I am thinking of buying a new MacBook costing $1500 for school, is that a good idea?",
    "Can i afford to spend $600 on electronics and materials for my home?",
    "I want to spend $100 dollar on four dozen cupcakes, do I have the money to do that?",
    "Should I spent $50 on baby clothes at Carter's today?",
    "I have $30, is that enough for dinner tonight?",
    "so can I buy some electronics costing $300 from Fry's Electronics?",
    "Do I have enough money saved up to take a vacation to Paris this spring?",
    "Can I afford to buy new rain boots? They cost $150.",
    "am I allowed to buy some goods from Adidas costing around $1500 dollars now?",
    "Is it smart to spend $4,000 on designer bed sheets?",
    "Will it fit my budget to spend $600 at Kohl's?",
    "Is it a good idea to buy more food from restaurants",
    "Should I purchase the Razer keyboard for $200?",
    "can I buy some goods from Adidas costing around $1500 dollars right now?",
    "I wanna buy a 400 dollar watch, should I buy that?",
    "I want to spend $400 on a new computer part, if i do that will i have enough for rent?",
    "Should I buy this 60 dollar video game?",
    "Can I spend $48.05 on Cofee?",
    "Should I spend $500 at the mechanic's to fix my old car?",
    "Would it be a good idea to spend $1000 on a new TV?",
    "Is it alright to buy some electronics costing $300 from Fry's Electronics?",
    "Would I be able to squeeze in an $800 computer from Dell?",
    "Is it good to buy shoes from Adidas that cost $150?",
    "so is it okay for me to spend $500 at Micor center on computer parts now?",
    "help me with some spending advice",
    "What are the consequences of buying $100 of stuff from Amazon",
    "Should I get a new cat for $50?",
    "The new Iphone is coming out. It's going to be $600. Will I go over budget if I do it?",
    " what do you think about me spending some money on memes",
    "Can I afford a new BMW for $100,000?",
    " Can I afford to eat at a fancy dinner place this week?",
    "is it worth it to buy a coffee machine for $150?",
    "so can I really afford to go for dinner this saturday? it might cost around $50",
    "can I spend $340 on a new computer part from amazon? I am not sure if it's a good idea. Can you tell me?",
    "Do I have enough to spend $100 on clothes from Target",
    "how much should i spend on sewing machine ?",
    "should i spend a twenty dollars on a birthday cake for my four year old boy",
    "How much a month should I spend on recreation?",
    "Is it worth spending $10 more on the boots?",
    "Can I get the bike at Walmart for 120.00?",
    "Can I afford to save $100 out of my paycheck this week to put towards savings?",
    "Is it a good idea to spend around an extra $40 a month good for my current budget",
    "Can I afford a dinner out at Truluck's if it will cost me $50?",
    "Should I spend $300 at Best Buy this month?",
    "Is it a good idea to buy goods from Nike costing around $1000?",
    "Is it possible to spend another $100 on shoes?",
    "is it ok to buy electronics from sony costings around $100 this month?",
    "You think it would be okay if I bought the new Cricut machine? Michaels has it on sale for 399.99?",
    "is it worth it to buy a coffee machine for $120 from Best Buy?",
    "Is it okay for me to spend $500 at Micor center on computer parts",
    "Is $250 a reasonable price for a new monitor?",
    "Is it a good idea to spend around an extra $50 a month good for my current budget",
    "Do you think I could spend $500 on clothes right now?",
    "I gotta buy a 400 dollar watch, should I buy that?",
    "Is it a good idea for me go to Walmart and spend $400 on Christmas decorations?",
    "Is 750 a good price for a 60 inch tv?",
    "Should I spend $800 for the new iPhone from Apple?",
    "Can I afford to go out to dinner with my friends tonight if I only have $20 left?",
    "Can you help me figure out my monthly budget?",
    "I want to buy a new couch for $2000, will I go over my budget if I do?",
    "Is a 20 dollar meal at McDonalds going to break the bank?",
    "I want to buy a house, where do I start?",
    "I like my current tablet, but a faster model will cost me a net of $350: Yay or Nay?",
    "Do I have an extra $200 this month for a hotel room?",
    "can you offer $600 on electricity bill",
    "Do I have enough money saved up to take a vacation to Paris this year?",
    "I want to spend 200 dollars on groceries can i afford that",
    "Can I afford a prom dress costing $175 from Dillards?",
    "I'm planing on going to the movies every other weekend at $10.50 a ticket. Will that affect my budget in the wrong way?",
    "would it be fine if i pay $800 per month for rent?",
    "Should I buy a used iPhone X for $800?",
    "Can I afford to buy a new television for $1000 dollars?",
    "Is it okay for me to spend $40 on clothes at Wal-Mart?",
    "Do you think it's okay if I spend $45 on a pair of shoes?",
    "Can you help me control my spending?",
    "Do you think it is okay for me to spend $500 at Micor center on computer parts",
    "Would you suggest making this spending the money or not?",
    "Would you think it is okay for me to spend $25 at starbucks?",
    "Can I purchase this $700 iPhone X from Apple?",
    "What do you think about a shirt for $25 from the Gap?",
    "if I were to buy a computer on Amazon, would it put me over my avarage spending?",
    "I want to buy the new Honda Civic Sport, is $20,000 a good deal?",
    "Is buying a weight set for $250 a good deal?",
    "should i get clothes in amazon costing $500",
    "Can I purchase a TV from Target for $2000?",
    "The LCD tv is 100.00 cheaper than the LED; do you think I can afford the upgrade?",
    "Should i pay forty dollars for lawn mowing?",
    "can I really buy some goods from Adidas costing around $1500 dollars?",
    "I want to buy a 500 dollar watch, should I buy that?",
    "Can I buy a laptop from Amazon that costs $1500?",
    "am I allowed now to buy some electronics costing $300 from Fry's Electronics?",
    "How much have I spent on Amazon this month?",
    "Lululemon leggings are $100, are they a good investment?",
    " is it ok if i buy a lot of soccer balls",
    "Should I get the Jeffery Campbell boots from DSW that are on sale for $99 today?",
    "i am thinking to get some electronics from Amazon this might cost $550 , do you think it is okay for me to go through with that transaction",
    "I want to donate money to a charity how much can I afford?",
    "Is it a good idea to buy shoes from Nike costing around $1000? Do you think i can afford this?",
    "Is it a good idea to spend $200 at the Addidas outlet?",
    "Do I have enough to spend $48.05 at starbucks?",
    "Do you thnk i have enough budget to buy the new PS3 from Best Buy that cost $500?",
    "Should I spend $150,000 for a house?",
    "Can I afford a night out with the girls for 200 dollars?",
    "am I allowed to buy some electronics costing $300 from Fry's Electronics?",
    "should i spend $600 on food and drinks from ann arbor. is it good idea",
    "Should I pay a $1.50 extra for honey walnut shrimp at Panda Express?",
    "i want to spend 250 dollar for sports kits at puma, is that good idea?",
    "Can I afford to eat out for $10 every day ?",
    "am I allowed to buy compter parts from amazon for around $3000?",
    "I want to buy a 200 dollar watch, should I buy that?",
    "Should I buy a car thank you",
    "I want to buy a new car for 10,000 cash; can I do that?",
    "Will I blow my budget if I spend $48.05 at starbucks?",
    "How much can I afford to spend on eating out this month?",
    "Can i afford to spend $700 on electronics for my home?",
    "Should I buy clothes with 200?",
    "Can I afford to go to the movie this Saturday? It will probably cost $20.",
    "Should I buy a new computer for $600?",
    "Can you help me with some advice on spending?",
    "I want to spend $100 on video games should I buy that?",
    "am I able to spend $340 on a new computer part from amazon? I am not sure if it's a good idea. Can you tell me?",
    "Can I spend 200.00 for dinner at Rios?",
    "I gotta know if it is okay for me to spend $500 at Micor center on computer parts",
    "Can I lend my mom $200?",
    "can I spend $100 on groceries",
    "Can I afford a new toaster this month?",
    "I really like this shirt but it is 50.00; do you think I can afford it?",
    "is spending $500 on an airplane ticket a good idea?",
    "I am looking to buy some new trend of watch, can you help me?",
    "Would I be over my budget for the month if I spend $50 going out to the nightclub tomorrow night?",
    "Can I buy a house for $400,000?",
    "What do you think would be the most I could spend without going over budget? Is $200 on this tv too much.",
    "Is it a good idea to spend around an extra $75 a month good for my current budget",
    "I am gonna be getting a watch for my birthday from Movado, Should i spend $300 for it?",
    "Should I go to Starbucks for $5 coffee?",
    "can i afford to go on a shopping spree and spend 200",
    "so am I allowed to buy some goods from Adidas costing around $1500 dollars?",
    "Should i buy shoes from Amazon for around $50?",
    "Should I pay my rent early - I have 300 extra",
    "am I really able to buy compter parts from amazon for around $3000?",
    "Is it smart to spend $400 on new clothes at Amazon",
    "Can I spend $500 on a puppy right now?",
    "Can i afford to spend $500 on clothes for my self?",
    "is i clothes purchase from amazon costing 500 this week?",
    "so can I actually afford to go for dinner this saturday? it might cost around $50",
    "Can I afford to spend $50 on coffee at Starbucks this month?",
    "Can I afford $125 basketball shoes?",
    "Should I buy a new laptop from Lenovo that costs $500",
    "Can you help me know if it's a good idea to purchase a gaming computer which costs around $5000",
    "Should I buy from Amazon and pay extra for 2 day shipping?",
    "can you offer advice, can i afford a $600 on electricity bill",
    "Should I bundle my DirecTV just to save $20 on a service I would hardly use?",
    "if I kept on buying lotto tickets, would I go over my budget?",
    "Will I go over my budget if I spend $30 on Best Buy?",
    "I want to know will it be feasible to purchase a new set of Dunlop tires from Amazon that cost 600.00?",
    "It is a good idea for me to spend $1000 on a new monitor or would that put me over budget?",
    "Can i order some gym equipment from Amazon?",
    "Can I afford a new car or should I keep saving?",
    "Can I afford a $50 dinner out this week?",
    "Can I spend $200 on clothes?",
    "Is spending $75 a month on Yankee candles too much",
    "am I able to really spend $340 on a new computer part from amazon? I am not sure if it's a good idea. Can you tell me?",
    "hey do you advise against spending $100 on cable because that seems high but i need cable",
    "Will I blow my budget if I spend $805.39 at E-trade?",
    "Will I go over my budget if I spend $500 on a new TV?",
    "Can I spend 100 dollars on nuts at Menards?",
    "How much should I budget for recreation monthly?",
    "Should I spend $500 on maternity clothes from Motherhood Maternity?",
    "Do you think it's smart to spend $100 on a new shoes from adidas",
    "Can I afford to go out to dinner three times a week?",
    "Can I afford a 12 dollar movie ticket?",
    "Should I buy this $150 Netgear router that speeds up my internet connection?",
    "I want to go out to dinner tonight for $100, can my budget handle that?",
    "Should I purchase a boat on craigslist?",
    "Can I afford to spend $75 on a new pair of jeans?",
    "How big of a down payment can I spend?",
    " can i spend five bucks on burgers for my five five year olds",
    "Should I purchase the new pocket knife from Benchmade for $300?",
    "I'd like to order out tonight, do I have the extra 50?",
    "Would it be smart for me to go to the casino and bet $100?",
    "so can spend $340 on a new computer part from amazon? I am not sure if it's a good idea. Can you tell me?",
    "Is it ok to spend 100.00 at Ross",
    "Is it a good idea to buy new sandals that cost $45?",
    "Would it be wise to spend $50 at five below?",
    "I am thinking of spending $10,000 on privite jet with United?",
    "I need new furniture for my apartment, I am thinking to spend $500 total, is that affordable?",
    "Do I have enough to spend $121 at Wallmart?",
    "may i buy that 20 dollar suit, will it put me over budget?",
    "Can i afford to spend $400 on electronics for my home?",
    " say i got my paycheck today. would it be a good idea to buy a new phone?",
    "Is it ok to buy $50 shoes from Vans?",
    "Is it smart to buy a $200 jacket off Amazon?",
    "Should i buy clothes from Sears for around $50?",
    "Is this the right time to buy $200 in mutual fund stock?",
    "How would you ask for spending advice on what you want.",
    "Is it okay to purchase a $20 concert ticket tomorrow?",
    "so am I actually able to afford to go for dinner this saturday? it might cost around $50",
    "Should i spend $340 on a new computer part from amazon? I am not sure if it's a good idea. Can you tell me?",
    "Can I afford buying a $30 bottle of wine at Krogers?",
    "Should I spend an extra $20 for the large birthday cake?",
    "Going out every weekend this month spending about $70 every time. Will that put me over budget?",
    " should i spend a twenty dollars on a cake for my four year old boy",
    "Do you think it's smart to spend $300 on a new shoes from adidas?",
    "Is this a wise thing to spend money on?",
    "Can I buy a latte at Starbucks for $5?",
    "Should I spend an additional $40 for insurance coverage for my laptop?",
    "Will a trip to Best buy for electronics costing $5000 a bad idea",
    "am I currently able to buy some electronics costing $300 from Fry's Electronics?",
    "Can I buy headphones from JBL for $60?",
    "Is it a good buy for underwear costing $5 from Walgreen's?",
    "I need a business suit. Can I buy one that's on sale for $88?",
    "Can I get about $300 of clothes at DressBarn?",
    "an tire went out and my emergency money ran out, will it go over my budget?",
    "Does my budget allow for an unplanned purchase of $200 this month?",
    "Should I buy an airplane for $50,000?",
    "Should I spend $20 to upgrade my phone service?",
    "I'm thinking about spending $500 on a new laptop, would this be a good idea?",
    "Should I buy $50 of clothes from Old Navy?",
    "Do I have enough money to spend on a $400 TV for the next month?",
    "how do you feel about spending like 4 bucks on the pokemon game",
    "How do I determine if I have enough money to buy a new gadget?",
    "Would it be cool if I spent $10,000 on a motorcycle?",
    "Can I stay under my budget if I spend $30 on drinks tonight?",
    "Should I buy new sneakers for $50?",
    "Should I get a bidet toilet seat on Amazon even if it costs 299.99?",
    "Should I spend $4500 on a used car?",
    "If there enough money left this month for spending $$234 on groceries?",
    "hey so I want to fly out this girl I've been seeing can I afford a $1,000 flight?",
    "I am thinking about buying this xbox one x for $400. Will that put me over my monthly budget?",
    "I'm trying to decide if buying this burger for $10 will put me over the edge of my budget. What do you think?",
    "Can I spend $150 on dinner tonight?",
    "Should i buy clothes from Amazon for around $30? will this take me over my average monthly spendings?",
    "can I buy some goods from Adidas costing around $1500 dollars?",
    "Will I blow my budget if I spend $121 at Wallmart?",
    "Can I buy a home for $375,000?",
    "Do I have enough money to go to the movies tonight, costing about $20?",
    "Should I buy a PS4 this week?",
    "Can I spend $$234 on groceries?",
    "so can I spend $340 on a new computer part from amazon? I am not sure if it's a good idea. Can you tell me?",
    "so I will be getting a watch for my birthday from Movado, Should i spend $300 for it?",
    "Will I blow my budget if I spend $$234 at Dollar tree?",
    "Can I buy this $15 pair of Adidas socks?",
    "If there enough money left this month for spending $345 on electronics?",
    "can i afford a $40 hoodie from Adidas?",
    "Is there room in my budget this month to spend $800 on a new suit for work?",
    "What do you think about a belt for $15 from Amazon?",
    "   Test 1.2  yo i just found out i have to buy a new laptop for school can i spend about $1000",
    "is it a good idea to go on this vacation that will cost me about $2000",
    "Can you help me with my spending please",
    "am I able to buy some electronics costing $300 from Fry's Electronics?",
    "Should I spend $50 on groceries at Food Lion today?",
    "so can I buy some goods from Adidas costing around $1500 dollars?",
    "can i spend $100 on groceries",
    "i am thinking of purchase $ 200 on watch at fastrack, my choice",
    "I want to go gout with my friends and drop about 200 dollars on sinner can I afford that?",
    "am I allowed to spend $340 on a new computer part from amazon? I am not sure if it's a good idea. Can you tell me?",
    "so can I afford to go for dinner this saturday? it might cost around $40",
    "is it smart to spend $300 on a new shoes from nike?",
    "I need a computer. Is $495 too much?",
    "Is it wise to spend $300 on a Graco stroller?",
    "Will I go over my budget if I spend $200 on clothes?",
    "can i afford to buy that $200 cow?",
    "I need some advice on my spending.",
    "tell me right now okay for me to spend $500 at Micor center on computer parts",
    "is it smart to spend $50 on a headphones from Walmart?",
    "Is it wise to pay $80 dollars a month for unlimited data for my phone?",
    "can you help me on how to spend on shopping things",
    "Is it a good idea to spend $200 from Adidas before end of this month?",
    "I want to buy a 300 dollar watch, should I buy that?",
    "Do you think I could swing $50 on eBay?",
    "How much should I pay for this car, they're asking $15,000?",
    "Does my budget permit the purchase of a $400 laptop?",
    "If I buy a new handbag for $250 will I go over my budget?",
    "can I spend thirty euros on hockey equipment",
    "Can I afford $800 to spend at Best Buy?",
    "Is it in budget to spend $1000 at Target?",
    "I'm looking to get some advice on my spending.",
    "Will I be able to spend $30 dollars on dinner this weekend?",
    "I want to buy a 700 dollar watch, should I buy that?",
    "is it smart to spend $50 on a headphones?",
    "Do you think I should go for the Sprint plan at $80?",
    "Can I afford dinner at t fancy restaurant for $200?",
    "Will I be over my monthly budget if buy this $500 dollar refrigerator?",
    "should I spend 30$ a month more for better health insurance?",
    "Should we go on a honeymoon to Hawaii for $5,000?",
    "I want to go gout with my friends and drop about 100 dollars on dinner can I afford that?",
    "Should I pay my 6-month auto insurance now at $600, or pay $105 every month?",
    "Should I pay twenty dollars for earbuds?",
    "Can I afford to go to brunch on Sunday? It will cost about $15.",
    "Do I have enough to justify a new mattress purchase for $800?",
    "The family and I want to go on vacation to Disney for about $3500. Can we afford this?",
    "Can I afford to buy a new car?",
    "How much room do I have in my budget, can I spend an extra $25 a month on coffee?",
    "Is it good to buy a shirt for $25 from Costco?",
    "Can I spend $345 on electronics?",
    "How much can I spend until friday?",
    "Do I have $200 in my budget to spend this month?",
    "Would spending $100 on Amazon.com be all right?",
    "is it good idea to buy watches from rolex costing areund $1500",
    "so can I actually spend $340 on a new computer part from amazon? I am not sure if it's a good idea. Can you tell me?",
    "Let me know if it is okay for me to spend $500 at Micor center on computer parts",
    "Would it be okay for me to spend $400 on dancing?",
    "Can I get the new Verizon phone for $500?",
    "Is it okay if I withdraw $40 from the ATM",
    "Is it a good idea to buy shoes from Nike costing around $1000?",
    "Do I have enough for makeup at sephora for the sale? Maybe 100$?",
    "should i book the $390 room reservation now?",
    "I really want to buy $200 shoes from Adidas. Can I afford it?",
    "I am thinking of getting a watch for my birthday from Adidas, Should i spend $300 for it?",
    "Can I afford a new shirt for $35?",
    " Do you think it would be okay to spend $400 on going out tonight?",
    "what do you think of buy $300 tennis shoes from Adidas?",
    "Do I have 400 to spend on earrings at Kay?",
    "Is it a sound transaction to buy the new iMac for $1200?",
    "How much can I spend each month on a cable bill?",
    "let me know if it's okay for me to spend $500 at Micor center on computer parts",
    "Is it a good idea to buy a fridge from Lowes for $1000?",
    "Is 200 dollars a good price for a coach purse?",
    "Is it a good idea for me to spend $60 on this new videogame?",
    "I need an extra $20/week to spend at the movies. Am I going to go over if I do that?",
    "Should I spend $50 at shoes from Nike",
    "I want to know if going out to dinner with my friends this weekend will put me over budget if it costs $30.",
    "Do you find it responsible to spend $100 on new dishes this month?",
    "Can I afford to shop at Whole Foods with $50?",
    "I am thinking of getting a gift card from Starbucks. Should I spend $50?",
    "Do you think I'm able to afford wine tasting in Sonoma for 3 days? it costs acout $400 total",
    "How much should I budget for entertainment monthly?",
    "how to afford money to a particular product, guide me through it",
    "can I afford to go for dinner this saturday? it might cost around $50",
    "tell now okay for me to spend $500 at Micor center on computer parts",
    "Do you think it's smart to spend $300 on a new shoes from nike?",
    "is it good idea to buy watches from rolex costing around $1500",
    "I wish to buy a 400 dollar watch, should I buy that?",
    "Should I purchase this Samsung tablet from Amazon that cost 185.00?",
    "How does $200 at FootLocker sound?",
    "Will I go over by budget if I buy a $200 jacket from Amazon?",
    "is it smart to get a coffee at starbucks",
    "Can I afford to go on a trip to Cuba for $3000?",
    "Is $50 too much for a new top?",
    "so am I able to afford to go for dinner this saturday? it might cost around $50",
    "Would it be a bad idea to spend $467 at Best Buy right now?",
    "Can I spend 300 dollars on Newegg?",
    "Can I afford a $10,000 down payment on a house right now?",
    "Is there atleast $50 in the budget for me to have some fun?",
    "Should I buy this promotional $40 bucket of chicken from KFC?",
    "Should I buy this ps4 from Best Buy for $200?",
    "If there enough money left this month for spending $121 on School supplies?",
    "Can I afford a $12 per month subscription to Netflix?",
    "Is it a good idea to buy electronics from samsung costing around $1000 this month?",
    "I want to go out with my friends and drop about 200 dollars on dinner can I afford that?",
    "Should i spend an extra $34 each month to get better internet?",
    "so can I afford to go for dinner this saturday? it might cost around $50",
    "Should I spend $300 on makeup?",
    "I am thinking of getting a watch for my birthday from Movado, Should i spend $100 for it?",
    "I want to purchase new bouys for our dock from Amazon. The cheapest I can find is $39 for the white poly. Should I go ahead and buy these?",
    "Should I get a new car for $5,000?",
    "If I spend $200 to replace my tires this month will my budget be off track?",
    "Does my budget permit the purchase of a $200 purse at Kate Spade?",
    "can i spend $4.2023432",
    "can i afford to do some digital purchases",
    "There is a sale on laptops, is it a bad idea to spend $750 on a new HP?",
    "Can I afford $200 in new appliances at Home Depot?",
    "Is it a good idea to spend $500 dollars on a new laptop?",
    "I'm thinking about increasing my food expenses by about $40 a week. Is that going to work OK for me?",
    "am I actually able to buy compter parts from amazon for around $3000 now?",
    "I'm thinking about planning a $700 vacation. Can I do that within my budget?",
    "I'm looking at buying the newest GTA game. Can I afford $75?",
    "Would this be a good purchasing decision? if i spend 3000 on a gaming pc",
    "so am I allowed to spend $340 on a new computer part from amazon? I am not sure if it's a good idea. Can you tell me?",
    "Is $25 too much for this seafood dinner?",
    "Can you give me advice on buying the Midcentury sofa on Amazon for 799.00?",
    "shall I spend an extra $34 each month to get better internet?",
    "Do you think it would be a good idea to buy some earring from Kendra Scott for $70?",
    "Can I afford to visit my friends back East for Labor Day and spend $750 on the trip?",
    "what sort of spending advice do you give",
    "Do I have enough saved up to take a vacation to Paris this spring?",
    "i am looking to get some spending activites advice can you help me",
    "I must buy a 400 dollar watch, should I buy that?",
    "Will I blow my budget if I spend $30 at central processing unit?",
    "am I able to buy some goods from Adidas costing around $1500 dollars now?",
    "Will I go over my budget if I spend $345 on electronics?",
    "Tell me if it is okay for me to spend $500 at Micor center on computer parts",
    "looking to see if I can go see a movie it may cost sround $40",
    "i think it is okay for me spend $1000 at mobiles in mobile parts",
    "I want to buy a car, can you help me?",
    "How would you ask for spending advice on what you want?",
    "Do I have enough to spend $345 at Asus?",
    "If there enough money left this month for spending $805.39 on Stocks?",
    "Can I spend $805.39 on Stocks?",
    "so should I spend $340 on a new computer part from amazon? I am not sure if it's a good idea. Can you tell me?",
    "Should I buy the Sony watch for 500? Can I afford it?",
    "Should I buy shoes for $50 from nike?",
    "How much money do you think I'll need for saturday? Do you think $40 is enough?",
    "Is it alright if I buy ten thousand dollars worth of Safeway bananas?",
    "Do I have $7.00 to spend at Starbucks this afternoon?",
    "I am actually getting a watch for my birthday from Movado, Should i spend $300 for it?",
    "Is it ok to spend $100 from H&M this month?",
    "Should I buy a canon camera from Best Buy for $800?",
    "am I able to buy some goods from Adidas costing around $1500 dollars?",
    "Should I buy this laptop for $1500 from Best Buy?",
    "Can I afford a $200 purchase at Bath and Body Works today?",
    "Can I afford a $25,000 Honda?",
    "Can I buy a $1000 computer from Apple?",
    "The shoes I want from Balenciaga are $1000, are they too expensive for me to buy?",
    "Who should I talk to about spending money?",
    "so is it okay for me to spend $500 at Micor center on computer parts",
    "Can I spend $100 on a pair of Nike shoes?",
    "i want to buy a 100 dollar shoe, should i buy that?",
    "Will I go over my budget if I spend $48.05 on Cofee?",
    " can i afford to stay at this hotel that costs $200 a night",
    "I want to order pizza can I afford that?",
    "I want to buy pampered chef stoneware but they are $50, so are more expensive than most. Is it a good value?",
    "Will spending 200 at bath and body, be a bad choice?",
    "These new running shoes at Payless are $99, are they worth it?",
    "am I able to afford to go for dinner this saturday? it might cost around $50",
    " oh no can i spend 35 bucks on food",
    "Can I afford this $500 car repair?",
    "i would buy to medicine for whole month is this a good idea?",
    "Should I spend 800 an a pair of Nike's shoe? Can I afford it?",
    "I'm looking for a teal Hydroflask. They are $39 at REI. I can't find them discounted anywhere. Should I buy this one?",
    "How much should I spend on food?",
    "Is it a good idea to go out to eat again this week?",
    "Can I spend $50 at Buffalo Wild Wings?",
    "Is it ok to spend $1000 from Apple store?",
    "Do I have $600 to spend each month on a car payment?",
    "what do you think about buying pokemon for $4",
    "if I brought an X-box, would it go over my budget?",
    "I need a new car. Can I afford $22,000?",
    "Can you help me figure out my monthly spending?",
    "Will it be wise of me to spend $50 on a new rug this month?",
    "may i buy that 20 dollar suit",
    "What's the amount I should budget monthly for groceries?",
    "Should we but another $25 worth of food?",
    "Do you recommend that I spend my money this way?",
    "i like buy more household furniture for my new house is that a good idea?",
    "How much a month should I budget on entertainment?",
    "Is it smart for me to spend $600 on kitchen appliances from Sears?",
    "can i afford to drop twenty five thousand clams on a new car",
    "Is it a good idea to buy the new water bottle on Amazon for #30?",
    "what is your stance on spending money on bricks",
    "Is the cable and internet bundle a better deal if I spend 40 dollars more every month?",
    "Do you have any advice for me on spending this money?",
    "Would I be able to buy this computer desk from Walmart for $100?",
    "Should I get a babysitter for $30?",
    "If i buy a LED TV costing $450 will it put me over my monthly budget?",
    "Is it a good idea to spend my extra money on a new cell phone that is $575",
    "Would it me a good idea for me to drop $500 on this new computer monitor?",
    "I want to spend 200 dollars on furniture",
    "Should I give her 100 for her birthday?",
    "Do you think I can afford this computer monitor from Amazon? It'll put me down $300.",
    "Do I have enough money in my account to spend $100 on groceries?",
    "Does my budget allow for my to spend $100 this weekend at a restaurant?",
    "Is it wise to buy the coach purse for 1000? Do you think I can afford it?",
    "Am I able to spend $100 on the collectors edition of a game?",
    "Can I buy these new $200 Nike Air 270's?",
    "Do I have enough to spend $805.39 at E-trade?",
    "Will my monthly spending budget cover the purchase of a new desktop from Best Buy that cost 600.00",
    "can I buy some electronics costing $300 from Fry's Electronics?",
    "Is it a good idea to purchase house for 150000? Can I afford it?",
    "I love Reeboks and need new shoes. Is $59 too much right now?",
    "best buy watches $400 from fastrack is good",
    "so tell me is it okay for me to spend $500 at Micor center on computer parts",
    "Is it worth it to add a line on my Sprint account? It's $10 plus fees extra a month.",
    "I need to buy school clothes, can I afford the pants at GAP for $95?",
    "Can you help me make a budget?",
    "i want to go out with my family how much can i spend on food and drinks",
    "i spend smart phone $1000 from samsung?",
    "What's a reasonable amount to spend on groceries each month?",
    "Should I spend the extra $5 for breadsticks at Pizza Hut?",
    "I am thinking of purchasing $300 on shoes at nike, is that a good idea?",
    "is spending $500 on a wedding gift a good idea?",
    "so is it actually smart to spend $300 on a new shoes from nike?",
    "Should I buy a shirt for $25 from Costco?",
    "Is it wise to use $30 to go out to eat this weekend?",
    "Is it a good idea to go to Chilli's and spend $55?",
    "Will I be over budget if I buy the new stereo this month for $800?",
    "I want to spend 100 dollars on groceries can i afford that",
    "Can I afford a new pair of shorts from Lululemon for $55?",
    "Should I spend 400 dollars on a nintendo?",
    "Do I have enough disposable income to buy a 60 dollar game?",
    "It it wise to take a $3,000 vacation to Florida next year?",
    "is it a good idea to spend $550 on new tires this month.",
    "Is it a good idea to by a charger for $12 From Amazon?"
  ],
  "spending_advice_update": [
    "I really wanted advice for spending on a house.",
    "Revise that to be able purchasing a new rug.",
    "Oops. I was attempting to get advice on purchasing a new dresser.",
    "Rewind and make that about spending on a new bed.",
    "IS IT OK TO DEAL WITH WALLMART",
    "I really desired some advice about buying an laptop from Dell instead",
    "I should change it to spending on travel homes",
    "Go back and change that to be about spending on a bed.",
    "No tell me about what graphics cards i should buy",
    "My bad, can I actually buy this phone from Apple?",
    "Yikes, I meant to ask about spending on books.",
    "Sorry I wanted to find out about clothes from GAP instead",
    "I actually wanted to ask for advice on taking a trip this weekend",
    "Go back and revise that to be about spending on kitchen appliances.",
    "what about for amazon instead",
    "I actually was seeking advice on purchasing new kitchen appliances.",
    "I need to correct it to spending on vacations.",
    "i wanted advice about buying a phones from huawei instead",
    "How bout telling me what fishing rods to buy",
    "I did need some advice about buying an laptop from Dell instead",
    "I actually was hoping for advise on a vacation.",
    "Oops. Instead advise me on purchasing a laptop.",
    "I need advice instead on purchasing new electronics for $400 on sale.",
    "What I really needed was advice on buying books.",
    "I need to have advice on this book",
    "Instead of that, can you advise me about buying baby clothes?",
    "I JUST WANTED TO KNOW IF I COULD GET IT FROM AMAZON INSTEAD",
    "What about advice at Carter's instead?",
    "I desire some advice about buying an laptop from Dell instead",
    "Oh my bad I meant to ask about purchasing turnips from Sprouts.",
    "I meant to ask for advice about buying a vacation home.",
    "Take that back and change it to spending on a car.",
    "Oops. I was trying to ask about buying new furniture.",
    "Sorry i ment to ask about my spendings on utility bills instead",
    "Ohh sorry i actually wanted to ask about advice for me spending $200 for new computer parts",
    "I made a mistake, i wanted to know if it was ok to buy that from Target instead",
    "Ohh sorry i actually wanted to ask about advice for me spending $135 for new computer parts",
    "My bad, I meant actually to ask you about spending advice for my trip to florida.",
    "I NEED IT FROM THE ADIDAS IF U DONT MIND",
    "I meant to ask for spending on Electronics instead",
    "can you change it to advice on purchase?",
    "How about if I buy from Target?",
    "I was trying to ask instead about spending on a new sink.",
    "I meant to ask about making a purchase of new guest towels.",
    "i meant to ask about mobiles from samsung instead",
    "Sorry I wanted to find out about clothes from Walmart instead",
    "Rewind. Make that about spending on a crib.",
    "Instead, I was actually hoping for advice on spending money on home decor.",
    "I need to revise that to be about purchasing a vacation home.",
    "Sorry i ment to ask about my advice on utility bills instead",
    "I was meaning to ask about spending a few hundred on a new TV not about my dinner.",
    "I wanted some advice about buying an laptop from Dell instead badly",
    "Oh goodness. I meant instead to ask about purchasing a new set of pots.",
    "I was attempting poorly to ask about purchasing a new power tool set.",
    "Oops! Scratch that and advise me on purchasing a new stove.",
    "I was actually looking to ask for advice on purchasing a boat.",
    "I was actually looking for advice on spending $300 on a new laptop.",
    "Ohh sorry i actually wanted to ask about advice for me spending $100 for new computer parts",
    "i want to find out about clothes from the amazon.",
    "I was attempting to ask for advice about a birthday party budget.",
    "i wanted advice about buying a phones from GOOGLE instead",
    "I really wanted some advice about buying an laptop from Dell instead",
    "I was hoping instead to get some advice about buying a new stereo.",
    "I was hoping to get advice on home furnishing spending instead.",
    "Scratch that and advise me on spending for a new bedroom suite.",
    "I need to update that to spending on cars.",
    "Could you give me advice for buying fitness equipment instead?",
    "Forget that. Please advise on spending for our honeymoon.",
    "Sorry, I actually wanted to know the cost of this at H&M, not Target.",
    "Scratch that. I need advice on spending for kitchen renovations.",
    "I needed to ask about electronics from Micro center instead",
    "Ohh sorry i actually wanted to ask about advice for me spending $400 for new computer parts",
    "I am sorry, I meant to ask about the product from Overstock instead of Amazon.",
    "Oops. I needed to ask advise about purchasing a crib.",
    "Oh sorry! I was trying to ask about purchasing a new cookbook.",
    "What about for Nike instead",
    "I really want some advice about buying an laptop from Dell instead",
    "Scratch that. I was hoping to get advice on purchasing a new DVD player.",
    "Instead of that can I get some advice now on buying a new couch?",
    "That was not what I wanted to aks you but how would you advice me on traveling to Schenectady.",
    "I actually meant to say spending on tours.",
    "What if I buy a phone from samsung instead?",
    "how about looking to ask about buying from target instead, want to learn more thanks",
    "I PREFER EBAY, SORRY",
    "Can we actually discussed the buying coffee online?",
    "I wanted my spending advice for Amazon not ebay",
    "I asked for Amazon, but I meant Wayfair instead.",
    "I made a mistake, I want advice on buying plane tickets.",
    "Oops. I was hoping to ask for advise regarding purchasing a kitchen table.",
    "What I really wanted to say was how can I purchase potatoes from Kroger?",
    "I was trying to get some advice on furniture spending.",
    "Sorry, I wanted to know if it was okay to get a phone from H&M had instead.",
    "i would like to change it mobile parts",
    "MY bad, I meant to ask for spending advice on entertainment",
    "i wanted to find out about watches from rolex instead",
    "Can you actually give me advice on purchasing a high chair instead of that?",
    "Cancel my last query and give me advice for buying gifts.",
    "I made a mistake, i wanted to know if it was ok to buy that from Amazon instead",
    "Oops. Can you give me advice instead on buying luggage?",
    "I needed to know advice for spending for Dicks not Bass pro shops",
    "Oops. Was trying to ask about purchasing a new phone.",
    "I meant to ask about advice on buying a carseat stroller set.",
    "Oh, I didn't really mean that, I meant spending advice on groceries.",
    "Sorry I wanted to find out about clothes from Macys instead",
    "I in fact was seeking your guidance on spending more on my baby's nursery.",
    "I actually want some advice about buying an laptop from Dell instead",
    "Sorry I was talking about buying a lawn flamingo on Amazon.",
    "I meant to ask about spending on a new couch.",
    "Can I buy that from Target?",
    "I could really use advice on purchasing jewelry.",
    "i wanted advice about buying a iphones from samsung instead",
    "I got to change it to spending on travel homes",
    "Sorry I wanted to find out about clothes from amazon instead",
    "i wanted advice about buying a phones from apple instead",
    "I needed advice on spending on a new gaming console not that.",
    "i wanted advice about buying a phones from nokia instead",
    "I made a mistake, i wanted to know if it was ok to buy that from Bed, Bath & Beyond instead",
    "What do you say about me spending at Carter's instead of that?",
    "so I wanted some advice about buying an laptop from Dell instead",
    "Could I find out about grills from Amazon instead of Home Depot.",
    "i would like to change it spending electronics",
    "Oops. I meant to ask about purchasing new bed linens.",
    "I wished to ask about electronics from Micro center instead",
    "explain looking to ask about buying from target instead",
    "I was looking for advice on spending on a baby shower gift.",
    "Can I have advice for buying food instead?",
    "How about advice for spending at Mos instead of Bigos",
    "I want some advice about buying an laptop from Dell instead",
    "I take that back and want advice about purchasing new countertops.",
    "I wanted to ask about electronics from Micro center instead",
    "No, wait, I wasn't talking about visiting a restaurant. I was talking about buying a restaurant as an investment. I want advice on that.",
    "I wanna have some advice about buying an laptop from Dell instead",
    "I meant to ask instead about purchasing a new dishwasher.",
    "I need some advice about buying an laptop from Dell instead",
    "My bad. I wanted to get some advice on upgrading my cable plan.",
    "questioning and looking to ask about buying from target instead currently",
    "Actually I meant to ask about spending on lawn mowers.",
    "I misspoke, actually wanted to ask for info about batteries on Ebay.",
    "Actually could you give me advice for buying a car?",
    "Oops. I was hoping to get some spending advice on buying new linens.",
    "go back and change it to spending on home",
    "I actually asked for bill payment advice",
    "No i think i can get a better deal from new egg, Is it okay if i get it there instead",
    "I would like to change it to spending on travel homes.",
    "Sorry! I misspoke. I mean to ask about spending for my vacation to Hawaii.",
    "what about which shoes to get for it",
    "costco has that for so much less is it okay if i get it from there instead",
    "I was actually looking for some advice on purchasing soccer equipment.",
    "Can I get advice about this stove instead",
    "I wanna get some advice about buying an laptop from Dell instead",
    "Can you give me advice for landscaping instead?",
    "Sorry to be annoying, but I got confused and actually meant to ask about advice for spending at the new art exhibit.",
    "Can I get advice about this calculator instead",
    "Ohh sorry i actually wanted to ask about advice for me spending $75 for new computer parts",
    "I desired to ask about electronics from Micro center instead",
    "Could you give me some advice on purchasing a new computer instead?",
    "Sorry. I was trying to ask about going to the movies.",
    "Sorry I wanted to find out about clothes from Kohls instead",
    "Ohh sorry i actually wanted to ask about advice for me spending $60 for new computer parts",
    "I wanna change it to spending on travel homes",
    "Ohh sorry i actually wanted to ask about advice for me spending $300 for new computer parts",
    "I was trying to get advice on purchasing a curling iron.",
    "I need to know instead about spending on solar panels.",
    "My bad, I wanted information on buying this from Apple instead.",
    "I think i can find it cheaper at walmart, if i get it there will it put me over budget?",
    "My bad. Can you actually advise on purchasing my husband a bike?",
    "Sorry! I wanted to ask about buying new towels for $50.",
    "I want to ask you about cars instead",
    "I made a mistake, i wanted to know if it was ok to buy that from Sears instead",
    "Oops, I meant to ask about purchasing wine, sorry!",
    "I want to change it to spending on travel homes",
    "Ohh sorry i actually wanted to ask about advice for me spending $50 for new computer parts",
    "I made a mistake, i wanted to know if it was ok to buy that from JC Penny instead",
    "I actually was trying to ask you about purchasing a new stove.",
    "I actually needed some advice about buying an laptop from Dell instead",
    "I actually wanted to ask about spending $75 on a new phone plan",
    "i meant to ask about electronics from tv",
    "Wait, I didn't mean eating at a restaurant. I meant spending on transportation.",
    "I want to change that to spending on bedding.",
    "I wanted to have some advice about buying an laptop from Dell instead",
    "I actually needed advice for buying a guitar.",
    "Oops. I actually wanted to ask about purchasing a new microwave.",
    "Could you give me advice on buying clothes instead?",
    "So sorry! I wanted to actually ask about spending on a new TV.",
    "Uh. I meant to ask about a new computer.",
    "My bad. I need advice on purchasing a life insurance plan.",
    "I changed my mind. Tell me about spending on car insurance.",
    "Sorry. I meant to ask for advice on buying a new microwave.",
    "Can I find out the price of lumber from Home Depot instead of Wayfair?",
    "Ohh sorry i actually wanted to ask about advice for me spending $80 for new computer parts",
    "I made a mistake, i wanted to know if it was ok to buy that from tj max instead",
    "i wanted advice about buying a phones from motorola instead",
    "Woops, actually interested in Android Phones on Amazon.",
    "Ohh sorry i actually wanted to ask about advice for me spending $175 for new computer parts",
    "My bad. I meant to ask about spending $50 on new Christmas decor.",
    "Go back and change it to spending on tables.",
    "I was actually looking for advice on baby expenses.",
    "I would like to change that to asking about purchasing a houseboat.",
    "Oops. I meant to ask about netflix spending.",
    "I made a mistake, i wanted to know if it was ok to buy that from Dick's instead",
    "Sorry, I'm not actually interested in a restaurant, I'm interested in buying new shoes.",
    "I was trying to ask for advise on buying a stroller.",
    "ok, that's was my error what I actually want to say is how would you advice me on spending on a travel vacation.",
    "What do you think about advice at Best Buy instead?",
    "I was not thinking properly and I really meant to ask your advice about spending on new school items for my son.",
    "Let me find out about buying clothes from Walmart instead",
    "Forget what I said before, I need spending advice on gifts.",
    "I'm sorry. I wanted to ask about purchasing a new mixer for my kitchen.",
    "I wanted to ask about entertainment spending instead.",
    "Oh my bad. I wanted to ask for advice about buying new clothes for the fall.",
    "I made a mistake, i wanted to know if it was ok to buy that from Wallmart instead",
    "i wanted to know advice for buying electrical devices from sony instead",
    "I need to get advice about this show",
    "I would rather spend my money on Amazon, is that possible",
    "I would like to take that back and ask about spending on new carpetting.",
    "I need advice on a pan",
    "Oops. Can I change that to be about spending on kitchen appliances?",
    "SORRY I WANTED TO KNOW IF I COULD GET IT FROM AMAZON INSTEAD",
    "Oops. Need advice on buying a washing mashine.",
    "i meant to ask about electronics from Micro center instead",
    "so I needed some advice about buying an laptop from Dell instead",
    "I would like to change it to spending advice on travel homes",
    "Scratch that. I need some advice on spending for a new rocking chair.",
    "currently on now looking to ask about buying from target instead",
    "I wanted some advice about buying an laptop from Dell instead",
    "My bad. I was trying to get some advice about purchasing a TV.",
    "I meant to ask about my spending advice to Graco.",
    "i meant to ask about shoes from puma instead",
    "I can have advice on spending on ebay instead?",
    "Sorry to be confusing, but I actually meant to ask for spending advice on the discount grocery store.",
    "Ohh sorry i actually wanted to ask about advice for me spending $225 for new computer parts",
    "I would like to change it to spending on travel homes",
    "I wanted to get some advice about buying an laptop from Dell instead",
    "i wanted to find out about phones from samsung instead",
    "Can I get some advice on a new chair instead?",
    "Nix that, I actually wanted spending advice on travel",
    "Back it up and advise me on purchasing new sheets.",
    "I NEED THE ADVICE ON ELECTRONICS AT ASUS INSTEAD",
    "I wanna have some advice about buying an laptop from Dell instead now",
    "Sorry. I actually need some advice on whether or not to purchase a new kitchen table.",
    "Oops. I needed to ask about purchasing a new car.",
    "Can I get some guidance on purchasing a TV instead?",
    "I actually was trying to ask about purchasing a new car.",
    "I meant to ask for advice for spending in Mcdolands",
    "I made a mistake, i wanted to know if it was ok to buy that from Home Goods instead",
    "Go back one. Tell me about spending on cars,",
    "I must change it to spending on travel homes",
    "I would actually prefer advice for buying video games.",
    "I wanted to ask about spending on kitchen furniture, not dining out.",
    "Oops. I need advice on spending for baby furniture.",
    "what about for puma instead",
    "Please disregard that and help me decide about purchasing a new phone.",
    "What about advice of spending at Kohls instead?",
    "I made a mistake, i wanted to know if it was ok to buy that from K-mart instead",
    "i wanted to know if it was ok to buy that from Wallmart instead",
    "I wanted to say what kind of advice would you give to me spending for a trip to Germany",
    "I made a mistake about the question I wanted to ask, I meant to ask your advise about buying a new smart refrigerator",
    "Forget what I just asked, I want to know about spending on cell phones.",
    "My bad. I need some advice instead on buying a new bathtub.",
    "I did want some advice about buying an laptop from Dell instead"
  ],
  "spending_history_start": [
    "How much have I spent on fast food?",
    "Show me a history of all my  purchases",
    "Also please get the total spent while I was in Michigan",
    "How much fees did i pay at my restaurant visit",
    "I would like to see how much I spent from my savings account at Burger King.",
    "Find out my money spent on food",
    "i was in canada last month can you show me my entire spending history?",
    "How much have i been spending on my Credit Card at Home Depot",
    "what was the bill for my total trip to florida",
    "Hello, I wanted to know what I spent on my trip to California.",
    "How much fee did i pay on my past chargees",
    "What's this month's clothing expense looking like?",
    "um how much did i spend on electrical at best buy on friday?",
    "i wanna see how much i spent from my checking account at pizza hut",
    "I want to know where my money was spent",
    "How much did i spend when i was in Alabama?",
    "When I was in Boston, what amount did I spend?",
    "Let me see how much i spent from my checking account at pizza hut",
    "I want to see how much I spent while in Florida.",
    "How much money was blown from my account on food at hooters",
    "What was my total spending while in Texas?",
    "What has been my expenditure for my restaurant visite last week",
    "How much did I spend on my credit card in Indiana?",
    "Can you show me my spending history on clothes?",
    "can I see what I have spent",
    "What did I spend in Pennsylvania?",
    "How much did I spend at the gas station for the past month.",
    "Can you tell me the amount of money I spent while I was in Hawaii?",
    "I want to know how much i've been spending on food.",
    "How much did I spend on my trip to Paris?",
    "What is the amount of money I've spent on clothes this month?",
    "What was the total cost at the movies on Tuesday?",
    "What is my spending history on movie tickets?",
    "How much did i spend when i was in Vermont?",
    "Could you tell me how much I spent this month at Walmart?",
    "How much did i spend when i was in new york?",
    "What's the total that I spent while in Washington?",
    "How much did I spend at IHOP?",
    "how much have i spent in new york",
    "show what my spendings look like for my checking account",
    "I need to know exactly how much I spent at Nordstrom this year.",
    "So how much exactly did I spend on Chipotle?",
    "remember i was in michigan for two weeks, can you tell me how much i spent",
    "what was the rough estimate of money spent while I was in Paris",
    "how much did i spend last month",
    "What has been my expenditure for this errk",
    "Show me my recent charges on my account",
    "What did I spend while I was in NYC?",
    "How much did i spend when i was in Virginia?",
    "How much of my savings did I spend at Walmart?",
    "Please let me know how much money I've spent on flowers.",
    "How much money did i waste on food and drinks",
    "How much did I spend on gas this week?",
    "I'd really like to know exactly how much I spent while I was in Florida.",
    "may i know the expenses when i was in china",
    "Show me all the money i spent on food and drink",
    "How much has my electronics cost me",
    "did I spend money at Target",
    "I was on now looking for how muchI spend on electronic items",
    "How much money have i used up",
    "What are my total expenses this week?",
    "Can you show me the total amount I've spent dining out?",
    "Can you tell me how much money i've spent at walmart fro over the years",
    "how much of my savings did I spend at Kohls?",
    "How much did I even spend at Target?",
    "How much money have I spent at Lowe's in the last 6 months?",
    "What is the amount of money I spent of food",
    "How much did I spend in Italy?",
    "How much money did i wastre on electronics",
    "Please bring up the spending I made on video games.",
    "Did I spend too much at Toys R US",
    "tell me about my spending at mcDonalds",
    "How much did i spend when i was in Texas?",
    "Let me know how much I've spent at Petco in the last three months.",
    "need to know how much i spent on pizza from my credit card",
    "for my vacation to Ohio I need to get the total spent there",
    "how expensive is the food that i purchased",
    "how much did i spend on electronics at best buy on Tuesday?",
    "Show me how much I spent at Apple.",
    "I would like to see my food spending",
    "What have been my expenditures for the month?",
    "Can you let me know how much I spent in Philly?",
    "How much did I spend on groceries last month?",
    "Can you please show me what I spent at Walmart?",
    "How much did I spend on coffee?",
    "how much i spent on my credit card while in japan",
    "what did I spend last year on electronics",
    "I got to know how much I've spent my savings on clothing this year.",
    "i need to know how much i spent when i was in new york",
    "How much have I spent on food this year?",
    "Check how much I spent in apple",
    "I would like to see how much money I have been spending on coffee this month.",
    "What is the breakdown of my spending at evergreen",
    "How much money did I spend on groceries",
    "What is my spending on groceries",
    "show me spending history for groceries.",
    "What did I spend on groceries this week?",
    "see how much i spent from my savings account at starbucks now",
    "When I was in Florida, how much money did I spend?",
    "it'd be great if i could know how much of savings have gone to food last month",
    "What am I spending on groceries?",
    "What is my spending history in New Jersey",
    "Hola can you tell me what I spent in Mexico",
    "what have i spent the most on",
    "While I was in Florida, how much money did I spend?",
    "When I was on that business trip in June, what did I spend on meals?",
    "How much did I spend on groceries last week?",
    "I'd like to know how much money I've spent at Walmart.",
    "I wish to see how much i spent from my checking account at pizza hut",
    "How much did I spend on cigarettes this week?",
    "I need to know how much I've spent on clothing this year.",
    "how much did i spend on electronics at best buy on monday?",
    "yesterday was a bit crazy what's the damage",
    "What is my average monthly gas spending total?",
    "Please tell me the total spent while I was in Canada on vacation",
    "Check how much I spent on food.",
    "How much did I spend on fast food last week",
    "I need to see what the total I spent in Mexico is",
    "how much did i spend at the restaurant last night",
    "Can you tell me how much I spent while I was away in Mexico?",
    "What was the damage from last months spending",
    "What was my spending total during the time I spent in Italy?",
    "how much should i spend last month?",
    "This app i cool wow, Let me see how much i dropped on evergreen over the years",
    "How much have I spent while in Canada?",
    "What do my coffee expenses look like for the past two weeks?",
    "I would like to know how much my spendings have set me back",
    "How much cash went into burger king",
    "I need to see how much I spent from my savings at Target this week.",
    "what did my trip to france cost me",
    "What did i spend on home repairs last week?",
    "I spent way too much money on clothes right? can you check",
    " i was out in california a lot in the past year and i dropped a ton of cash at restaurants can you show me what that looks like",
    "How much cash money have i dropped?",
    "I have to see how much i spent from my savings account at starbucks",
    "how does my spendings look",
    "Can you tell me how much I've spent on fast food this month?",
    "how much cash did i drop on online shopping in the past 4 months",
    "I need to know how much I've spent my savings on clothing this year.",
    "What did I spend last night at the bar in Ohio?",
    "How much money have i used up at Macy's",
    "Can you tell me what I spent at Target using my savings account?",
    "How much cash money have i dropped in the last 4 months",
    "What's my expenditure for last month",
    "I was wondering how much I spent at CVS?",
    "I would really like to be able to know what restaurants i spent money at",
    "I should see how much i spent from my savings account at starbucks",
    "Where last did i make purchase",
    "did money get spent?",
    "What has charged in the last week",
    "Can you let me know how much money i have used up on Taco Bell food and drink",
    "What was my spending at Lowes last month?",
    "How much was charged to my credit card in Ohio last weekend?",
    "I need to find my purchase history for Wales.",
    "i needa know how much ive been spending on electronics this month",
    "Where has my money gone to",
    "I need to see how much i spent from my checking account at pizza hut",
    "How much cash money habe i dropped in the last week",
    "What is my bill spending",
    "Pleease see how much i spent from my savings account at starbucks",
    "How much did I pay on bills",
    "I wanna know what's the damage on my checking account ",
    "How much have I spent on gas this month?",
    "Can you let me know what money i used up on coffee at starbucks ",
    "I need the total spent at white castles this month",
    "How much did I spend in New Jersey?",
    "um how much did i spend on electronics at best buy on Tuesday?",
    "go and show me my spending history for electronics",
    "HI, please send me my spending history on Starbucks.",
    "Wow , this si cool, I wanna know how much money i spent af microcenter on electronics over the years",
    "Show me how much I spent on utilities last month.",
    "Find out my spending towards bills",
    "I want to know where last i spent money at",
    "hi i wanted to know how much i spent on my credit card while in Nepal",
    "Show me my total spending on groceries so far this year.",
    "How much from my savings account did i spend at target",
    "What's my spending history this month from my savings account at Chili's?",
    "Can you give me a break down of food and drink charges to my account with number 1255324",
    "What did I spend at Starbucks?",
    "How much was i charged at wallmart",
    "I would like to see all the charges to my account from restaurants",
    "how much of my savings did I spend at GAP?",
    "Can you breakdown all  the recent charges i've incurred on my account",
    "How much did money did I spend on gas last week?",
    "Can you show me how much I spent on Amazon?",
    "How much did I spend on gas last week?",
    "Can you show me what I spent on hotels this month?",
    "Tell me what I spent at McDonald's in total.",
    "how much total was spent at restaurants last year",
    "Please show me my spending history for last May.",
    "what was the amount I spent when I went to Florida in total",
    "What did I spend at McDonalds?",
    "Can you also tell me what I spend while I was in New Jersey please",
    "Show me my recent purchases",
    "How much money did I rack up on my credit card while I was in England?",
    "I wish to see how much i spent from my savings account at starbucks",
    "how much of my savings did I spend at Best Buy?",
    "Can you tell me how much I spent on gas last month?",
    "How much have I spent on doughnuts this month?",
    "Do you have any history of the largest expenses of my checking account",
    "currently on now wanting to know the amount I have been using at Chipotle",
    "Find out my apple spending",
    "I need total amount spent while in Florida on vacation",
    "How much I have spent on gas so far this year?",
    "Can I see my spending for food this week?",
    "I really hope i an able to know which restaurants i can spend money at",
    "How much did I spend on food?",
    "Tell me apple spending for this month",
    "How much did I spend at Walmart in the past month",
    "i was in aruba last month can you show me my entire spending history?",
    "how expensive is the clothing that i purchased",
    "What are my total restaurant purchases this month?",
    "i need to know how much i spent on pizza from my credit card",
    "How much cash money have i dropped in the last 2 weeks",
    "How much did i spend when i was in Louisiana?",
    "How much did I spend at the Marriott?",
    "Can you tell me the amount of money I spent at Disney last week?",
    "show what my spending is like for my checking accounbt",
    "can i see how much i spent from my savings account at starbucks",
    "are you able to give me a total while I was in Ohio",
    "I need to know the amount of money spent at Starbucks this month.",
    "don't show me a spending history on electronics from my credit card",
    "Check my spending on groceries",
    "How much have I spent on clothing?",
    "Show me a breakdown of my recent expenditures",
    "I will need to see how much I spent in New York",
    "You must see how much i spent from my savings account at starbucks",
    "What's my gas total for this week?",
    "I feel like I’ve been spending way too much dough at Jimmy Johns can you show me what that looks like?",
    "i just looking for the starubucks consumption history",
    "Show my my spending of clothing last year.",
    "What kind of damage did my night out had on account 32553212",
    "Can you show me how much I spent on food?",
    "i wanna know how much i've been spending at starbucks",
    "How much money have i dropped ",
    "I was in Ohio last weekend and need to know how much I spent there.",
    "couldn't you tell me how much i spent on my credit card when i was in Bali",
    "How much cash have i dropped",
    "How much have I spent at restaurants this year?",
    "How much did I spend on vacation in Chicago last week?",
    "I would really appreciate it if you are able to list my recent charges ",
    "What is my last months spending on apple",
    "How much did I spend in Florida?",
    "Please show my spending history for electronics",
    "How much did I use money on food",
    "Calculate my apple spending for this month",
    "Where last have i spent money",
    "What is my gasoline expense?",
    "How much caseh have i dropped in the last month",
    "Can you let me know about my expenditures for the trips to the mall",
    "I wanna see my spending history for electronics",
    "What is my monthly spending on groceries",
    "Can you show me how much I spent on gas last month?",
    "What has been spent this month for eating out",
    "How much did I spend on Starbucks this month?",
    "Can you show me how much I spent when I was in New York?",
    "What is my spending history for Target?",
    "What was my spending like during my trip to Spain?",
    "show me my spending at walmart.",
    "What is my spending on clothes",
    "where did all my money disappear to",
    "I would like to know a breakdown of my smallest expenses",
    "The ribs I got at the salt lick barbecue were expensive. How much did I spend there?",
    "Lemme know the amount of money i dropped on restaurants this month",
    "I went to Paris over the weekend and really need a total spent",
    "How much did I spend from my savings account at Starbucks?",
    "what has been charged yesterday",
    "Test 3.6  i dropped a bunch of cash at restaurants can you show me what that looked like",
    "I wish to see my spending history for electronics",
    "How much did I spend on starbucks last month?",
    "How much did I spent at Olive Garden last week?",
    "can you show me how much i spent on food?",
    "how did my money get spent this past one month",
    "Can you tell me about the purchases i've made",
    "Did I spent over $50 on clothing this month?",
    "How much of savings did I spend at Walgreen's?",
    "I gotta know how much I've spent my savings on clothing this year.",
    "How much do I spend on gas?",
    "How much did I spend while in Las Vegas Neveda?",
    "How much did I spend last week in China?",
    "Could you show me what I spent on dinning out last week?",
    "Where has my momey been expended",
    "i would like to know about all the goods i've purchased",
    "I need to see my clothing spending history.",
    "When lass did i spend money and where",
    "Last month was a month of reckless spending, show me what the damage is like",
    "what has baeen charged since october",
    "Tell me how much cash used for gas.",
    "can you see how much I spent in Disney",
    "Show me the smallest charges to my account 2355643",
    "I really wish this thing could tell me what restaurants I have been spending all of my money at",
    "How much did I spend at Costco this week?",
    "please see how much i spent from my savings account at starbucks",
    "can you tell me how much i spend on food yesterday",
    "what i have spent more in this week video games or bills?",
    "Can I see how much I spent at restaurants?",
    "how much did i spend at walmart",
    "by chance could you tell me how much i spent on my credit card when i was in Bali",
    "let me know how much I used my credit card when I was in spain",
    "go now see how much i spent from my savings account at starbucks",
    "how much of my savings did I spend at Walmart?",
    "Last month was a bit crazy. what is the damage?",
    "Can you give me a summary of the money I've spent at McDonalds?",
    "how expensive was the food last month",
    "Show me my Nordstrom's spending history.",
    "please let me know how much i've been spending on food",
    "I hope i am able to know where i have spent most money",
    "How much of my savings account did I spend at Macy's?",
    "what was my max amount spent while I was in Canada do you know",
    "i was in california last month can you show me my entire spending history?",
    "how much money did i waste on car parts",
    "Can you show me how much I spent at Nordstrom?",
    "What are my food expenses so far?",
    "how much did i spend on groceries last month",
    "I need the amount of money that went to bills",
    "How much have I spent from savings this year at Dell?",
    "How much have i been spending on my Credit Card at Target",
    "wow how much I gave evergreen over the years",
    "Can you show me how much I spent on restaurants last month?",
    " How much cash money have I dropped in the last month",
    "Are you able to list my purchases",
    "What is my spending history for food for the last 3 months?",
    "How much money have i spend in the last month",
    "go now and please see how much i spent from my savings account at starbucks",
    "Check my spending on clothes",
    "How much had food and drink cost me",
    "you gotta see how much i spent from my savings account at starbucks",
    "how much i spent when i was in toronto",
    "What have i been charged in the last month",
    "if you can, let me know more about wanting to know the amount I have been using at Chipotle thank you",
    "Where was my money expended",
    "How much have I spent at McDonald's in the last month?",
    "I would like to know where last i made a purchase at",
    "How much did I spend at Best Buy?",
    "Show me my spending history for electronics",
    "Can you please see what I spent while I was in Vegas last week",
    "show my spending history for electronics",
    "Where did my money go in April of this year",
    "Show me how much I spent on entertainment this week.",
    "I really hope i am able to know my expenditures for last week",
    "Tell me how much money i've dropped ot evergreen for the past year",
    "How much money did I spend at Walmart?",
    "How much did I spend in Target this week?",
    "Can you show me how much I spent on my trip to Detroit?",
    "How much have I spent at restaurants?",
    "tell me about my spending at Smashburger",
    "i was in spain last month can you show me my entire spending history?",
    "Show me my spending history?",
    "What was the total amount I spent while in Jersey?",
    "Can you tell me how much I've spent on clothes so far?",
    "How much have I spent on Amazon?",
    "How much did I spend on clothing this month?",
    "Can you let me know a rundown of the cash i've dropped in the last 2 weeks",
    "What are my food expenses so far this year?",
    "How much did I spend on gas last month?",
    "Can you give me charges on my account",
    "Please see how much i spent from my savings account at starbucks",
    "I want to see how much I spend at applebees",
    "I feel like I’ve been spending way too much dough at Jimmy Johns can you show me what that looks like",
    "I need to know how much I spent when I was in France.",
    "hi i wanted to know how much i spent on my credit card while in japan",
    "see how much i spent from my savings account at starbucks",
    "Can you tell me how much I spent last week in California?",
    "how much do i spend on fast food",
    "what did i spend the most money on last month",
    "How much did I spend in Wisconsin last weekend?",
    "Can you tell me my total expenditures for this month",
    "Can you tell me my savings spending at Best buy?",
    "What is my biggest expense?",
    "What did I spend out of my savings account at Target?",
    "What did I spend eating out last week?",
    "How much have I been spending at Panera?",
    "How much have I spent at Starbucks?",
    "How much did I use from my savings account at Walgreens?",
    "I would like to see all the charges to my account",
    "Are you able to list my recent expenses",
    "I would like to see my spending history for electronics",
    "How much from my checking did I spend at Panera?",
    "Please tell me you are able to show me the locations i spent money at",
    "I'd like to know my spending at Five Guys.",
    "How much cash have i dropped in the lst month",
    "I want to see how much I spent from my savings account at Target.",
    "Show me how much I've spent on Starbucks since February.",
    "How much was my total spending last week on groceries?",
    "I would like you to list all of my electronic expenses",
    "Can you tell me how much I have been spending at Dunkin Donuts?",
    "Show me my spending history",
    "currently wanting to know how much I spent at Target now",
    "currently wanting to know how much I spent at Target",
    "What were my gas expenses when I was staying in Raleigh.",
    "Give me the food spending money for this month",
    "i just like to know the cost i have spent on pizzahut",
    "I gotta see how much i spent from my savings account at starbucks",
    "I'm looking for my spending history on clothes.",
    "What si the total amount i uved up at seers",
    "what about the consumption i have made for mcdonald's",
    "Can you show me how much I've spent eating out this month so far?",
    "Last week was a bit crazy what's the dammage",
    "Can you tell me how much I've spent at Walmart in the past month?",
    "I want to know how much money I spent last week in Miami",
    "Did I spend too much at Taco Bell.",
    "show me now my spending history for electronics",
    "How much money did I waste on alcohol",
    "How much did I spend on pizza last week",
    "What's my spendings like for my savings account",
    "Tell me what I spent at AMC this month.",
    "Did I spend over $500 in New York last week?",
    "Did I buy a lot from Best Buy",
    "i need to know how much i spent when i was in florida",
    "What kind of fees did i clear recently",
    "can you show me how much i spent on food",
    "I want to know how much I've been charged on P&G this months?",
    "What was spent at City Tacos?",
    "How much did I spend last week in Vegas?",
    "Find out my purchase amount on burger king",
    "how expensive was food last time",
    "show me a spending history on electronics from my credit card",
    "What is my spending history again for Chipotle?",
    "just wondering how much did I spend when I was in China",
    "What's my spending history for just clothing?",
    "When I was in California, how much did I spend?",
    "I have to see how much i spent from my checking account at pizza hut",
    "How much do I spend a week on food?",
    "How much is my entertainment spending?",
    "what does my spendings look like for my credit card",
    "what does my sopendings look like",
    "Can you let me know how much have i used up on milk",
    " what has changed in the last two months",
    "How much did I spend on Food last month?",
    "Can I get a total for my charges I made while in Mexico last month?",
    "What's my spending history for Taco Bell?",
    "let me see how much i spent from my checking account at pizza hut",
    "Can you find and verify what I spend while I was in Canada",
    "Can I get a look at how much I have spent from my savings account at J.C. Penney?",
    "What money was used up from my checking account at Target",
    "what does my spending look like for my savings account",
    "I would like to see how much I spent from my savings account at Macys.",
    "What's the summary of my expenses",
    "Hey I was wondering how much i spent on clothing",
    "How much did I spend at Staples?",
    "how much I am I spending on utilities",
    "show my spendings for my savings account"
  ],
  "spending_history_update": [
    "let me see just from microsoft instead",
    "I got to see just from microsoft instead",
    "What about in ann arbor michigan",
    "waht about for the last 3 months",
    "What about in ann arbor",
    "Will you show me all my CVS spendings?",
    "Could you show me all my recent Whole Foods spendings?",
    "Could you show me all my recent Whole Foods spendings instead?",
    "What about my checking account ending with number 3802848911 at evergreen",
    "Show me everything that is from last month and out of state.",
    "Can you show me all my recent Walgreens spendings instead, please?",
    "show me from ralphs instead thank u",
    "thinking of can you explain the wanting all purchases for retail clothing thing?",
    "I have to see my spending list for Ann arbor instead",
    "hi wanting all purchases for fast food involves what if possible",
    "Could you show me my spendings from San Diego next, please?",
    "Could you show me my grocery spendings next, please?",
    "And was there any from my trip to ann arbor",
    "show me from gap please thank u",
    "What about my checking account ending with number 8398842092 at amazon",
    "show me from old navy please",
    "Let me see just from microsoft instead",
    "Will you show me all my recent Petco spendings?",
    "Will you show me all my recent Walgreens spendings?",
    "thinking of browsing for an answer lookin for spendings in seattle for this",
    "I must see just from microsoft instead now",
    "Was there any expendature on pills?",
    "Can you show me my spendings from San Francisco next, please?",
    "What about from my traveling around Germany",
    "hello, lookin for spendings in seattle give me more on this",
    "Scratch that show me for my money market account",
    "Scratch that query for checking, what about from my account called Recardo's checking",
    "show me addidas please",
    "show me the ones from dell thx",
    "show me the ones from dell thanks",
    "How about how much i've been spending from my checking account at Evergreen",
    "What about my savings account ending with number 32747999900 in New york",
    "Can you show me all my Trader Joes spendings instead, please?",
    "Would you show me all my recent Whole Foods spendings instead?",
    "currently wanting all purchases for retail clothing too",
    "What about my spending at Pizza Hut",
    "wanting to view all from target is what is going on.",
    "I wanna see just from microsoft instead",
    "Would you show me all my Amazon spendings?",
    "What about from my 724839328792 account",
    "Was there any expendature on trips?",
    "what about from my shopping spree last Thursday at Best buy",
    "Can you show me my clothing spendings next?",
    "Scratch that query for checking, what about from my savings",
    "Any spending from Detroit",
    "Can you show me all my recent Petco spendings instead?",
    "What about my spending at Roti Hut",
    "Can you show me my spendings from airlines?",
    "wanting all purchases for fast food works how?",
    "What about the charges from my savings account",
    "wanting to view all from target is about what",
    "what about for the last year",
    "show me for miami instead",
    "Show me for my checking account with number ending in digits 38493 instead",
    "show me from gap please thanks",
    "show me addidas",
    "What about my savings account ending with number 67467479922 in Mexico",
    "How about from account raul",
    "Can you show me all my recent Petco spendings?",
    "let me see spendings for groceries instead",
    "questioning and wanting to view all from Sears currently please",
    "wanting to view all from walmart works how.",
    "if you can, need your help on wanting all purchases for retail clothing?",
    "I only want to see the spending from Wal Mart.",
    "show me the ones from dell plz",
    "Am I able to see the category of spendings for my bills?",
    "How about from Irfam's checking",
    "allow me to see my spending list for Ann arbor instead",
    "Wjhat about from the trip last week",
    "Will you show me all my recent Petco spendings, please?",
    "show me from dell please thanks so much",
    "Could you show me my grocery spendings instead, please?",
    "Can you show me my spendings from San Jose, please?",
    "Let me see spendings for groceries instead",
    "How about on coffee",
    "show me from amazon please thanks so much",
    "Whatg about for when i was in New York",
    "hi wanting to view all from target give me more on this thanks",
    "wanting all purchases for fast food, what do I need to know with this thanks",
    "show me addidas thanks",
    "Can you show me my Costco spendings instead, please?",
    "Will you show me all my Amazon spendings?",
    "What about from the trip last Month",
    "what about in michigan",
    "How about from the money market account ",
    "wanting to view all from target concerns what else?",
    "What about my spending for food and drink at hooters",
    "how about for the last 9 weeks",
    "show me from safeway please if you could",
    "How about from my acccount called PC savings",
    "Could you show me my clothing spendings, please?",
    "How about for the last nine weeks",
    "Would you show me my recent Whole Foods spendings instead, please?",
    "Switch to Oregon instead.",
    "show me from old navy",
    "Can you show me what money I spent at the mall this month?",
    "Is it possible to list all my spendings from the trip to Columbus Georgia?",
    "I have to see just from Amazon instead",
    "wanting all purchases for fast food functions in what way",
    "were there any other expenditure from my trip to Germany",
    "more information on wanting to view all from target ok",
    "hi wanting to view all from walmart, need more info on this",
    "show me addidas thank u",
    "show me fron puma instead",
    "What about my checking account ending with number 398593 at target",
    "I must see just from Microsoft instead",
    "Could you show me my clothing spendings next, please?",
    "hello. wanting all purchases for fast food is what is going on need help",
    "How about from my acccount called Luka's checking",
    "please elaborate more on wanting to view all from walmart also",
    "What about my spending at evergreen",
    "Can you show me my spendings from Dublin next?",
    "show me from dell please",
    "what about food and drink",
    "How about on furniture",
    "Could you show me my spendings from San Jose next, please?",
    "How much was from entertainment ",
    "Show me for my money market account with number ending in digits 38493 instead",
    "Can you show me a spending list for Atlanta instead?",
    "questioning and wanting all purchases for retail clothing currently thanks",
    "And what about for entertainment",
    "Could you show me all my Amazon spendings instead?",
    "I need to see my spending list for Ann arbor instead",
    "Can you show me my spendings from Atlanta, please?",
    "Could you show me all my recent CVS spendings instead, please?",
    "show me from ralphs instead thanks so much",
    "Could you show me my grocery spendings?",
    "Bring up my spendings that involved clothes.",
    "What about from when i was in Detroit",
    "And was there any from food and drink expenses",
    "Was there any expenditure on Watches",
    "hi there, wanting all purchases for fast food",
    "I was on now wanting all purchases for fast food",
    "Can you show me my spendings from Chicago next, please?",
    "I wish to see just from Amazon instead",
    "show me amazon please thanks",
    "I was on now wanting all purchases for retail clothing?",
    "show me only amazon",
    "I was on now wanting all purchases for retail clothing",
    "Show me the spendings from when I was in Los Angeles.",
    "I wanna see my spending list for Ann arbor instead",
    "How much was used from my trip to Germany",
    "What about from Lackhan's savings",
    "hi more information on wanting all purchases for fast food now",
    "what about from my shopping spree last Tuesday at Corla's bar ",
    "Can I print the Atlanta spending list?",
    "Could you show me my TJ Maxx spendings instead?",
    "show me lucky please thank u",
    "show me from safeway if u could",
    "I gotta see my spending list for Ann arbor instead",
    "show me amazon please thank u",
    "right now lookin for spendings in seattle is happening now",
    "what about in flint",
    "were there any other expenditure from my trip to Antigua and Barbuda",
    "How about spending for amazon in new mexice",
    "Will you show me all my CVS spendings instead, please?",
    "What about from Raul's savings",
    "Can you show me all my recent Trader Joes spendings instead?",
    "I got to see my spending list for Ann arbor instead",
    "right now lookin for spendings in seattle is happening ok",
    "Can you show me all my CVS spendings instead, please?",
    "What about in the last month",
    "Show me for my savings account with number ending in digits 38492212 instead",
    "if you can, interested in and lookin for spendings in seattle now",
    "What about from Regenald's savings",
    "Just the spendings for movie tickets please.",
    "What about my spending at walmart",
    "more info on lookin for spendings in seattle etc please",
    "How about from christopher's account",
    "show me from amazon please thanks a lot",
    "Is there a way to show me my activity in Chicago for June?",
    "Let me see my spending list for Ann arbor instead",
    "Can you make it so it only shows the Reebok spendings?",
    "were there any other expenditure from my trip to mexico",
    "Could you show me my grocery spendings, please?",
    "interested in and wanting to view all from walmart?",
    "Could you show me my spendings from Atlanta next, please?",
    "what about from my shopping spree last Wednesday at Clinc",
    "how about for detroit instead",
    "I need a list of all my spendings done during my vacation in Chicago.",
    "Could you show me all my Target spendings instead?",
    "And what about for trips",
    "need how is the wanting all purchases for fast food done",
    "Can you show me my spendings from Paris next?",
    "How about insurance spendings",
    "Can you show me all my recent Petco spendings, please?",
    "show me for bars",
    "show me for hardware stores plz",
    "show me the ones from dell thank u",
    "Can you show me my spendings from Dublin next, please?",
    "Will you show me all my Amazon spendings, please?",
    "Close this list and open up the list for Walmart.",
    "Would you show me all my Amazon spendings instead?",
    "i would like to see just from apple instead",
    "explain wanting all purchases for fast food.",
    "I would like a list of all spendings outside of New York please.",
    "the concept of wanting to view all from Sears is something I want more info on ok",
    "What about from my 54389222 account",
    "Can you sort spending so I only see those from Seattle?",
    "how about wanting to view all from Sears concerns what else for this",
    "what is the wanting to view all from walmart thank you",
    "need wanting all purchases for retail clothing, need more info on this",
    "Can you show me my spendings from airlines next, please?",
    "show me from old navy thanks so much",
    "let me see just from Amazon instead",
    "show me from dell please thanks a lot",
    "have question, wanting to view all from walmart concerns what else need help",
    "Can you show me my spendings from bars, please?",
    "need lookin for spendings in seattle is about what?",
    "Can you show me my spendings from San Jose?",
    "What about from my 1020993200101 account",
    "Can you show me all my recent Trader Joes spendings?",
    "What about my checking account",
    "What about from when i was in new mexico",
    "I want to see just the spendings from KFC.",
    "Can you list the spendings out from San Diego?",
    "What about my checking account ending with number 389422013 at walmart",
    "show me from old navy plz",
    "I need to see my spending list for Ann arbor instead now",
    "What about from amazon",
    "Please give me the spendings for Target only.",
    "show me from safeway plz",
    "Could you show me my spendings from Paris next, please?",
    "hello, can you help with lookin for spendings in seattle",
    "Can you change the spendings list to Kohl's?",
    "What about my spending from when i was in Ann arbor",
    "have issue more information on lookin for spendings in seattle?",
    "show me for food",
    "how about wanting to view all from target, want to learn more now",
    "Can you show me my spendings from restaurants next, please?",
    "Could you show me my TJ Maxx spendings instead, please?",
    "if you can, is more info available on lookin for spendings in seattle",
    "show me from dell please thank u",
    "Scratch that query for savings, what about from my Money market account",
    "show me for hardware stores",
    "Will you show me all my recent Walgreens spendings, please?",
    "What about in new mexico for amazon spendings",
    "What about from Raychiel's savings",
    "what is the wanting all purchases for fast food issue all about?",
    "Can you show me my spendings from Dublin?",
    "hi there, more info requested on lookin for spendings in seattle",
    "Please show me the Adobe spendings that have have occurred.",
    "show me from old navy plz thanks a lot",
    "let me see the spendings from Dallas.",
    "show me lucky please thanks so much",
    "Could you show me my recent Whole Foods spendings instead, please?",
    "how about in miami",
    "help with wanting to view all from target please",
    "show me lucky plz",
    "Can you show me my spendings from San Francisco, please?",
    "Scratch that query for checking, what about from my account called Department Store",
    "questioning and wanting all purchases for retail clothing currently?",
    "Instead of Detroit, could I see my spendings for Flint?",
    "can you help with lookin for spendings in seattle",
    "show me from gap please",
    "show me addidas thanks so much",
    "lookin for spendings in seattle is done how here now",
    "show me from dell please thanks",
    "wanting all purchases for retail clothing works how",
    "show me from safeway please if you would",
    "Would you show me my clothing spendings next, please?",
    "Will you show me all my recent Petco spendings instead, please?",
    "show me for bars thanks so much",
    "what about in detroit",
    "How about from my chase account at Home Depot",
    "Show me for my money market account with number ending in digits 1022 instead",
    "show me amazon please",
    "What about on electronics",
    "Would you show me all my Amazon spendings, please?",
    "Can you show me a spending list for Nashville instead?",
    "How much was used from my trip to new york",
    "allow me to see just from Amazon instead",
    "I wish to see spendings for groceries instead",
    "And was there any from traveling expenses",
    "Instead of showing my spendings from Stamford, I'd rather see the ones from Norwalk.",
    "Were there any other spendings on Sava's restaurant",
    "What about from Raychiel's account",
    "Could you show me all my Target spendings?",
    "I should see just from microsoft instead",
    "Could you show me my spendings from Chicago next?",
    "Can you show me my spendings from bars next?",
    "wanting to view all from walmart tell me more on this aspect",
    "I have to see just from microsoft instead",
    "wanting all purchases for fast food functions in what way also",
    "Could you show me all my recent CVS spendings?",
    "What about my savings account ending with number 748389223 in Germany",
    "interested in and wanting all purchases for fast food",
    "show me from safeway please thanks so much",
    "What about from walmart",
    "Bring up only the spendings from amazon.",
    "show me lucky",
    "Can I take a look at the spending history for Washington?",
    "show me the ones from dell",
    "What about from my traveling around town",
    "what about in new mexic",
    "show me only amazon thanks so much",
    "Can you show me my spendings from Atlanta next?",
    "May I see a list for movie theaters instead?",
    "Can you show me all my CVS spendings?",
    "If not from my checking how about from my Money market account",
    "What about new york",
    "I want to see spendings for groceries instead",
    "What about my savigs account at walmart",
    "Show me for my savings account with number ending in digits 34412 instead",
    "What about my savings account ending with number 39294922134 at target",
    "What about from my caaount named Zephyr",
    "were there any other expenditure from my trip to Guyana",
    "I want the spendings I made at fast food restaurants.",
    "show me from amazon please",
    "Would you show me my Costco spendings?",
    "i want to see for grocery stores thank u",
    "show only for amazon this time",
    "lookin for spendings in seattle functions in what way need help",
    "Will you show me all my Amazon spendings instead?",
    "What spendings are there for Idaho?",
    "Any  spending from amazon",
    "Give me all my spendings from when I was in Alabama.",
    "What about Darian's savings account from that trip",
    "What about from Micro Center",
    "Can you show me my spendings from Atlanta next, please?",
    "how about need your help on wanting all purchases for retail clothing",
    "Can you show me my Costco spendings, please?",
    "I want to see my spending list for Ann arbor instead",
    "show me from old navy plz thanks",
    "browsing for an answer wanting to view all from walmart please",
    "I rather see my spending list from Texas rather than California.",
    "Could you show me my spendings from Chicago next, please?",
    "Ahd was there any from traveling expenses",
    "Could you show me all my CVS spendings instead, please?",
    "show me from ralphs instead thanks",
    "I'd like to see just from microsoft instead",
    "were there any other expenditure from my trip to Canada",
    "Could you show me all my recent Whole Foods spendings instead, please?",
    "What about from my 9482901 account",
    "Could you show me my spendings from San Francisco next, please?",
    "Can i see my spending for huntsville",
    "show me only amazon plz",
    "And what about for electronics",
    "show me from dell",
    "What about on Macy's",
    "Now, let me check the spendings from Michael's.",
    "show me addidas plpease",
    "I want to see the spendings from New Orleans.",
    "Was there any expenditure on food and drink",
    "can you explain the wanting to view all from walmart thing",
    "Can you show me my recent Trader Joes spendings instead, please?",
    "How much was used from my trip to Essiquibo",
    "How about on trips",
    "I need to see just from microsoft instead",
    "show me from safeway please",
    "what about for in miami",
    "How about from Charley's account",
    "have question, is more info available on wanting to view all from target",
    "i want to see for grocery stores thx",
    "Can you show me all my recent Petco spendings instead, please?",
    "Can you show me my Costco spendings?",
    "Will you show me all my Amazon spendings instead, please?",
    "i would like to see just from microsoft instead",
    "What about from when i was in Ann Arbor Michigan",
    "I wish to see just from microsoft instead",
    "How about for the last seven days",
    "What about from my money market account when i was in germany",
    "show me from old navy plz thank u",
    "What about from the trip last Thursday",
    "Will you show me all my recent Walgreens spendings instead?",
    "if you can, lookin for spendings in seattle give me more on this",
    "What about My spending from st Kitts and Nevis",
    "What about my IRA account",
    "What about from the trip last weekend",
    "Any spending from walmart",
    "If not from my checking how about from my savings account",
    "Could you show me my TJ Maxx spendings, please?",
    "How about on maternal care",
    "show me for food please",
    "wanting all purchases for retail clothing works how thanks",
    "I must see spendings for groceries instead",
    "would like to know more on how to do the wanting to view all from walmart",
    "Show me for my money market account with number ending in digits 0928389 instead",
    "wanting to view all from target is something I would like more explanation on thanks",
    "Could you show me all my CVS spendings instead?",
    "I would like all entertainment spendings",
    "How much money did I spend at Walmart this year?",
    "have question, please elaborate more on wanting to view all from walmart",
    "Could you show me my recent Petco spendings instead, please?",
    "Scratch that query for checking, what about from my IRA",
    "I went to Houston, I want to see those spendings.",
    "show for new york instead",
    "Can I print the spending list?",
    "Could you show me my grocery spendings instead?",
    "I got to see just from Amazon instead now",
    "is more info available on wanting to view all from walmart for this",
    "need your help on wanting to view all from target ok",
    "if you can, wanting to view all from target involves what for me",
    "Could you show me all my Amazon spendings?",
    "show me fron nike instead",
    "show me lucky please thanks",
    "how about in florida",
    "I need to see the spendings for only groceries.",
    "i want to see for grocery stores please",
    "What amout charges from account 838492302",
    "I need a list of everything from my vacation in California please",
    "Please show me the healthcare spendings",
    "if you can, can you explain the wanting to view all from walmart thing?",
    "Would you show me my Costco spendings, please?",
    "Would you show me all my recent Whole Foods spendings, please?",
    "How much money was spent for groceries instead",
    "I gotta see just from microsoft instead",
    "show me from amazon please thanks",
    "need I was on now wanting all purchases for fast food now",
    "what about from my shopping spree last Friday at Forever21",
    "more info on wanting to view all from target etc need help",
    "What about my savings account",
    "How about from my acccount called G2 Esports",
    "Scratch that show me my spending for my trip to new york instead",
    "What about my spending at Micro center",
    "if you can, interested in and wanting all purchases for retail clothing?",
    "Now I'd like to see all meals out",
    "I want to see for new york instead",
    "hi currently wanting to view all from target",
    "I must see my spending list for Ann arbor instead",
    "Show me a list of auto repair shops.",
    "How much was for entertainment instead",
    "what about for the last 6 weeks",
    "i want to see for grocery stores thank u a lot",
    "What about Darian's savings account from that",
    "Could you show me all my recent Petco spendings?",
    "I want to see just from Amazon insteadc",
    "show me for bars thanks a lot",
    "Can you show me my spendings from Paris next, please?",
    "i want to see for grocery stores thanks",
    "show me addidas plz",
    "I must see just from microsoft instead",
    "Can you show me my spendings from restaurants?",
    "show me lucky please",
    "how about browsing for an answer wanting to view all from walmart",
    "Show me for my money market account with number ending in digits 38492212 instead",
    "Could you show me all my recent Petco spendings next?",
    "How about for the first day",
    "Would you show me my TJ Maxx spendings instead?",
    "hello, help with wanting to view all from walmart also",
    "need is more info available on lookin for spendings in seattle now",
    "thinking of lookin for spendings in seattle concerns what else",
    "How am I able to just see my bills only?",
    "hi lookin for spendings in seattle is about what need help",
    "Could you show me all my Target spendings, please?",
    "Can I see a list of spendings from just Maine?",
    "if you can, what is the wanting all purchases for fast food?",
    "tell me all about wanting to view all from walmart for this",
    "i want to see for grocery stores plz",
    "show me for bars thank u",
    "show me for bars thanks",
    "What were my spendings for Columbus?",
    "show me for food thank u",
    "If not from my savings how about from my IRA account",
    "I need information for all of my spendings in July in Florida.",
    "show me from old navy plz thanks so much",
    "show me from ralphs instead thanks a lot",
    "show me amazon please thx",
    "Can you show me all my CVS spendings next, please?",
    "Could you show me my spendings from airlines next, please?",
    "Let me view the list for Abercrombie and Fitch.",
    "show me from gap please thanks a lot",
    "Can you show me my spendings from San Diego next?",
    "show me all spendings from Seattle.",
    "What about from my traveling around New York",
    "show me for texas instead",
    "What about from Lakeram's savings",
    "How about from Marcel's money rack account",
    "show me for hardware stores thank u",
    "show me amazon please thank u so much",
    "hello. let me know more on wanting to view all from walmart please",
    "Can you show me my spendings from San Francisco?",
    "show me spendings for nashville",
    "Any spending from amazon",
    "Show me the spendings from Target.",
    "Could you show me a list of spendings for pet store purchases?",
    "Can you show me everything from Florida?",
    "Any spending from Google play store",
    "I need a list for what I did in Georgia.",
    "Could you show me my clothing spendings next?",
    "What about from my traveling around Michigan",
    "Can you show me my spendings from San Francisco next?",
    "Could you show me my spendings from Paris next?",
    "more information on wanting to view all from walmart also",
    "lookin for spendings in seattle is done how here please",
    "show me from dell thanks",
    "Can you please list the spendings for Home Depot for last year?",
    "Have I been spending too much at Taco Bell? Bring up those spendings.",
    "Can I see my New York spendings instead of New Jersey?",
    "Can you show me my Costco spendings next?",
    "i would like to see for clothing also",
    "show me from safeway thank u",
    "Any spending from sava's restaurant",
    "show me from dell thank u",
    "show me lucky please thanks a lot",
    "allow me to see spendings for groceries instead",
    "wanting to view all from Sears functions in what way too",
    "Could I please see the spendings for Pizza Hut in the past 30 days?",
    "How about from my acccount called Vacation savings",
    "as far as wanting to view all from target is concerned, is there more information now",
    "Could you show me my spendings from Dublin next, please?",
    "Could I see my spendings for clothes this time",
    "I want to see all my purchases from Boston.",
    "Could you show me all my recent Whole Foods spendings next?",
    "interested in and wanting all purchases for fast food need help",
    "I need to really see my spending list for Ann arbor instead",
    "How about on food and drinks",
    "Could you show me my spendings from restaurants?",
    "show me for hardware stores thanks",
    "What about for spendings from ann arbor ",
    "If not from my savings how about from my checking account",
    "I got to see spendings for groceries instead now",
    "What about my spending at Courts",
    "What about from Macy's",
    "show me from safeway",
    "Start over and show me the results for Target.",
    "have question, tell me all about wanting to view all from target",
    "Can you show me my spendings from Dublin, please?",
    "i want to see for grocery stores",
    "how about please elaborate more on lookin for spendings in seattle",
    "If not from my savings how about from my money market account",
    "show me for food thanks",
    "What about charges to mother's checking account",
    "Can you show me my spendings from Paris?",
    "Will you show me all my recent Petco spendings instead?",
    "Can I see the spendings for Burger King now?",
    "Can you show me my spendings from San Diego, please?",
    "currently lookin for spendings in seattle thanks",
    "What are my Milford spendings, not Fairfield, from Connecticut?",
    "How much as from my trip to new york",
    "how about interested in and lookin for spendings in seattle",
    "show me from safeway please thank u so much",
    "How about from Reggie's account",
    "have question, let me know more on wanting all purchases for fast food",
    "I got to see spendings for groceries instead",
    "Scratch that query for checking, what about from my account called Depo",
    "more info on wanting all purchases for fast food etc for me",
    "the concept of wanting to view all from Sears is something I want more info on.",
    "I've been going to Burger King a lot recently, bring me those spendings.",
    "I'd like the spendings for San Diego please.",
    "I was in California recently, bring up a list of spendings from there.",
    "hi I was on now wanting to view all from target please",
    "Can you show me my spendings from Sacramento, please?",
    " How about from the money market account ",
    "I want to see a list of spendings in Wyoming and not Colorado.",
    "show me from ralphs instead",
    "Can you show me my spendings from San Jose next, please?",
    "how about wanting to view all from target works how for me",
    "give me a list of spendings that occurred in Toronto.",
    "What about my spending at google play store",
    "currently wanting all purchases for fast food?",
    "what about in th elast year",
    "What about from my 364729131231 account",
    "hi there, need your help on lookin for spendings in seattle for me",
    "Can you show me my recent Petco spendings instead, please?",
    "Can you show me my spendings from restaurants next?",
    "let me see for orlando instead",
    "Can you show me my Costco spendings next, please?",
    "what is the wanting all purchases for retail clothing",
    "hi more info requested on wanting to view all from target also",
    "What about from my 398249229924 account",
    "I would like to see a list of gas stations.",
    "can you explain the lookin for spendings in seattle thing too",
    "Would you show me all my recent Whole Foods spendings instead, please?",
    "please elaborate more on wanting to view all from walmart",
    "Can you show me all my recent Trader Joes spendings, please?",
    "Can you show me everything for Doraville Georgia?",
    "have issue tell me all about wanting all purchases for retail clothing",
    "wanting all purchases for fast food is done how here",
    "Can you show me my spendings from San Jose next?",
    "let me see my spending list for Ann arbor instead",
    "What about from when i was in New mexico",
    "what about in new york",
    "And what about for expensed from the movies",
    "Show me for my savings account with number ending in digits 394783 instead",
    "show me only amazon thanks",
    "What about from my 102093200222 account",
    "Can you show me my TJ Maxx spendings instead, please?",
    "show me from amazon please thank you",
    "I want to see just from Amazon instead",
    "show me for food thanks so much",
    "Can you show me my spendings from bars?",
    "thinking of tell me more on lookin for spendings in seattle",
    "Do you have any spendings from the state of Kentucky?",
    "Can you show me from new york instead?",
    "Could you show me all my Amazon spendings, please?",
    "Scratch that show me my spending for my trip to new york instea",
    "wanting to view all from walmart is what I am currently looking for if possible",
    "thinking of wanting to view all from walmart",
    "show me from safeway please thx",
    "And what about for food and drinks",
    "Can you show me from california instead?",
    "Would you show me my Costco spendings instead?",
    "What about my savings account ending with number 877364673732 in Canada",
    "hi wanting to view all from Sears is about what?",
    "I got to see just from Amazon instead",
    "Scratch that query for checking, what about from my account called Extra savings",
    "How about from my acccount called Mischife",
    "show me from safeway please thank u",
    "Can you show me my spendings from Sacramento?",
    "Any spending from Macy's",
    "Would you show me my TJ Maxx spendings instead, please?",
    "I want to see the spendings from apple.",
    "if you can, wanting to view all from target involves what",
    "What about my money market account",
    "I want to see the set of spendings that were used at Goodwill stores.",
    "How about for those in ann arbor",
    "Would you show me all my recent Whole Foods spendings?",
    "What about in california",
    "I only want the spendings from Italy to appear.",
    "explain wanting to view all from walmart",
    "I need to see spendings for groceries instead",
    "Please give me a list of spendings in Ohio and not Michigan.",
    "hello. wanting to view all from walmart functions in what way?",
    "How about from rack account",
    "Could you show me all my recent CVS spendings instead?",
    "I need see spendings for groceries instead",
    "What about my spending at Chicken Hut",
    "I wish to see my spending list for Ann arbor instead",
    "Can you show me my spendings from San Diego next, please?",
    "Can you show me all my CVS spendings instead?",
    "What about from miami",
    "Please show me spendings from car washes.",
    "Will you show me all my CVS spendings instead?",
    "hello. explain how the wanting to view all from walmart is done thank you",
    "show me the ones from dell please",
    "tell me more on lookin for spendings in seattle need help",
    "I should see my spending list for Ann arbor instead",
    "How about on child care",
    "Were there any other spendings on Sava's restaurant ",
    "Show me for my money market account with number ending in digits 998837 instead",
    "And was there any from Moving expenses",
    "show me from gap please thanks so much",
    "Can you show me my spendings from Sacramento next, please?",
    "I would like to see all the spendings I made at the ATM.",
    "Can you show me my spendings from bars next, please?",
    "I need to see just from Amazon instead",
    "Can you show me all my spendings from Sacramento next, please?",
    "Was there any expendature on furnature?",
    "I have to see spendings for groceries instead",
    "Could you show me my clothing spendings?",
    "allow me to see just from microsoft instead",
    "What about my spending from when i was in michigan",
    "What about from my 10100101991991 account",
    "tell me the spending for amazon instead",
    "Would you show me my TJ Maxx spendings, please?",
    "if you can, explain wanting to view all from walmart",
    "Is it possible to get all my spendings just for Peoria?",
    "Could you show me all my recent Petco spendings instead?",
    "I will see just from microsoft instead",
    "I want all spendings from NC, Eastover",
    "what about from my shopping spree last monday at Micro Center",
    "What about from the trip last Year",
    "Was there any spending on Best Buy products?",
    "show me from dell thanks so much",
    "Can you show me my spendings from San Diego?",
    "need wanting to view all from walmart works how please",
    "show me from safeway please thanks",
    "What about my spending at amazon",
    "I need my spendings from Louisiana, not Tennessee.",
    "I should see spendings for groceries instead",
    "Could you show me all my recent Petco spendings instead, please?",
    "how about in ann arbor",
    "Can you show me my spendings from Atlanta?",
    "Could you show me all my Amazon spendings instead, please?",
    "more information on wanting to view all from walmart.",
    "What about from Steve's account",
    "I went to Portland, please make a list of all my spendings from there, thanks.",
    "I want to see just from microsoft instead",
    "What about on groceries",
    "How much money was used for entertainment instead",
    "tell me the spending for colthes instead",
    "What about in Macy's",
    "How about on Electronice",
    "i want to see for grocery stores thanks a lot",
    "Now show me the records for California.",
    "I gotta see just from Amazon instead",
    "hello. let me know more on wanting all purchases for fast food also",
    "show me only amazon please",
    "I wanna see spendings for groceries instead",
    "Will you show me my recent Petco spendings instead, please?",
    "Can you show me my spendings from Sacramento next?",
    "see just from Amazon instead",
    "Can you show me just the spendings for when I was in Kansas?",
    "thinking of help with lookin for spendings in seattle",
    "have issue wanting to view all from target tell me more on this aspect too",
    "What about my checking account from that trip",
    "What about from the trip last week",
    "Was there any expendature on clothes?",
    "I'd like to see my restaurant spendings.",
    "more info on lookin for spendings in seattle etc?",
    "have question, tell me all about wanting to view all from walmart",
    "I should see just from Amazon instead",
    "I need all the spendings in Massachusetts",
    "what about in brooklyn",
    "would you mind if i take a look at virginia spendings",
    "if you can, currently wanting all purchases for retail clothing",
    "have question, wanting to view all from Sears is done how for me",
    "What about from Roberto's savings",
    "Could you show me my spendings from restaurants next?",
    "Can you show me my spendings from airlines next?",
    "Can you show me my CVS spendings instead, please?",
    "lookin for spendings in seattle is done how?",
    "How about on groceries",
    "hello. wanting to view all from target involves what?",
    "What about from Regenald's money",
    "Will you show me all my recent Walgreens spendings instead, please?",
    "I want to see a listing of all my spendings for Las Vegas.",
    "I gotta see spendings for groceries instead",
    "I must see just from Amazon instead",
    "Can you show me my spendings from Chicago, please?",
    "I only want to see the spendings I made at Wendy's.",
    "Can you show me my spendings from Chicago next?",
    "How about from my acccount called Farm Project",
    "I want to see everything from Arizona.",
    "I wanna see just from Amazon instead",
    "Was there any expendature on traveling?",
    "were there any other expenditure from my trip to Ann Arbor",
    "show me for hardware stores please"
  ]
}